#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainWidget_CM

#include "Basic.hpp"

#include "ETutorialVolumeType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CommonInput_structs.hpp"
#include "Palia_structs.hpp"
#include "UMG_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "ValeriaUI_structs.hpp"
#include "S6UICore_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_MainWidget_CM.WBP_MainWidget_CM_C.ActivateChatPanel
// 0x0007 (0x0007 - 0x0000)
struct WBP_MainWidget_CM_C_ActivateChatPanel final
{
public:
	bool                                          Activate;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanActivateChat_CanActivate;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVALUI_ChatPanelState                         CallFunc_GetCurrentChatState_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVALUI_ChatPanelState                         CallFunc_GetCurrentChatState_ReturnValue_1;        // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_CM_C_ActivateChatPanel) == 0x000001, "Wrong alignment on WBP_MainWidget_CM_C_ActivateChatPanel");
static_assert(sizeof(WBP_MainWidget_CM_C_ActivateChatPanel) == 0x000007, "Wrong size on WBP_MainWidget_CM_C_ActivateChatPanel");
static_assert(offsetof(WBP_MainWidget_CM_C_ActivateChatPanel, Activate) == 0x000000, "Member 'WBP_MainWidget_CM_C_ActivateChatPanel::Activate' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_ActivateChatPanel, CallFunc_CanActivateChat_CanActivate) == 0x000001, "Member 'WBP_MainWidget_CM_C_ActivateChatPanel::CallFunc_CanActivateChat_CanActivate' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_ActivateChatPanel, CallFunc_GetCurrentChatState_ReturnValue) == 0x000002, "Member 'WBP_MainWidget_CM_C_ActivateChatPanel::CallFunc_GetCurrentChatState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_ActivateChatPanel, CallFunc_GetCurrentChatState_ReturnValue_1) == 0x000003, "Member 'WBP_MainWidget_CM_C_ActivateChatPanel::CallFunc_GetCurrentChatState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_ActivateChatPanel, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000004, "Member 'WBP_MainWidget_CM_C_ActivateChatPanel::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_ActivateChatPanel, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000005, "Member 'WBP_MainWidget_CM_C_ActivateChatPanel::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_ActivateChatPanel, CallFunc_BooleanAND_ReturnValue) == 0x000006, "Member 'WBP_MainWidget_CM_C_ActivateChatPanel::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_MainWidget_CM.WBP_MainWidget_CM_C.BindEventsOnPlayerPawn
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_MainWidget_CM_C_BindEventsOnPlayerPawn final
{
public:
	TDelegate<void(class AValeriaCharacter* InValeriaCharacter, class UPrivateSpaceConfig* PrivateSpaceConfig)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AValeriaCharacter* InValeriaCharacter, class UPrivateSpaceConfig* PrivateSpaceConfig)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaCharacterTeleportComponent*     CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVitalsComponent* Vitals)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCharacterStateMachineComponent* Csm, struct FCharacterStateChangeParams& Params, ECharacterState StateBeingExited, ECharacterState StateBeingEntered)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCharacterStateMachineComponent* Csm, struct FCharacterStateChangeParams& Params, TArray<ECharacterState>& StatesExited, ECharacterState StateEntered)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UFishingViewComponent* FishingView, const struct FFishingMiniGameViewState& ViewState, class UFishingComponent* Source)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVitalsComponent*                       CallFunc_GetVitals_ReturnValue;                    // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_FishingViewComponent_C*             CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E2B[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFishingViewComponent*                  CallFunc_GetComponentByClass_ReturnValue_2;        // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFishingComponent*                      CallFunc_GetFishing_ReturnValue;                   // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPlayerInventoryComponent*              CallFunc_GetInventory_ReturnValue;                 // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfActionBarRows_ReturnValue;     // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_CM_C_BindEventsOnPlayerPawn) == 0x000008, "Wrong alignment on WBP_MainWidget_CM_C_BindEventsOnPlayerPawn");
static_assert(sizeof(WBP_MainWidget_CM_C_BindEventsOnPlayerPawn) == 0x0000A0, "Wrong size on WBP_MainWidget_CM_C_BindEventsOnPlayerPawn");
static_assert(offsetof(WBP_MainWidget_CM_C_BindEventsOnPlayerPawn, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_MainWidget_CM_C_BindEventsOnPlayerPawn::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_BindEventsOnPlayerPawn, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'WBP_MainWidget_CM_C_BindEventsOnPlayerPawn::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_BindEventsOnPlayerPawn, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'WBP_MainWidget_CM_C_BindEventsOnPlayerPawn::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_BindEventsOnPlayerPawn, K2Node_CreateDelegate_OutputDelegate_2) == 0x000028, "Member 'WBP_MainWidget_CM_C_BindEventsOnPlayerPawn::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_BindEventsOnPlayerPawn, K2Node_CreateDelegate_OutputDelegate_3) == 0x000038, "Member 'WBP_MainWidget_CM_C_BindEventsOnPlayerPawn::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_BindEventsOnPlayerPawn, K2Node_CreateDelegate_OutputDelegate_4) == 0x000048, "Member 'WBP_MainWidget_CM_C_BindEventsOnPlayerPawn::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_BindEventsOnPlayerPawn, K2Node_CreateDelegate_OutputDelegate_5) == 0x000058, "Member 'WBP_MainWidget_CM_C_BindEventsOnPlayerPawn::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_BindEventsOnPlayerPawn, CallFunc_GetVitals_ReturnValue) == 0x000068, "Member 'WBP_MainWidget_CM_C_BindEventsOnPlayerPawn::CallFunc_GetVitals_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_BindEventsOnPlayerPawn, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000070, "Member 'WBP_MainWidget_CM_C_BindEventsOnPlayerPawn::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_BindEventsOnPlayerPawn, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'WBP_MainWidget_CM_C_BindEventsOnPlayerPawn::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_BindEventsOnPlayerPawn, CallFunc_GetComponentByClass_ReturnValue_2) == 0x000080, "Member 'WBP_MainWidget_CM_C_BindEventsOnPlayerPawn::CallFunc_GetComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_BindEventsOnPlayerPawn, CallFunc_GetFishing_ReturnValue) == 0x000088, "Member 'WBP_MainWidget_CM_C_BindEventsOnPlayerPawn::CallFunc_GetFishing_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_BindEventsOnPlayerPawn, CallFunc_GetInventory_ReturnValue) == 0x000090, "Member 'WBP_MainWidget_CM_C_BindEventsOnPlayerPawn::CallFunc_GetInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_BindEventsOnPlayerPawn, CallFunc_GetNumberOfActionBarRows_ReturnValue) == 0x000098, "Member 'WBP_MainWidget_CM_C_BindEventsOnPlayerPawn::CallFunc_GetNumberOfActionBarRows_ReturnValue' has a wrong offset!");

// Function WBP_MainWidget_CM.WBP_MainWidget_CM_C.BindToChatManagerEvents
// 0x0018 (0x0018 - 0x0000)
struct WBP_MainWidget_CM_C_BindToChatManagerEvents final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UChatManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_CM_C_BindToChatManagerEvents) == 0x000008, "Wrong alignment on WBP_MainWidget_CM_C_BindToChatManagerEvents");
static_assert(sizeof(WBP_MainWidget_CM_C_BindToChatManagerEvents) == 0x000018, "Wrong size on WBP_MainWidget_CM_C_BindToChatManagerEvents");
static_assert(offsetof(WBP_MainWidget_CM_C_BindToChatManagerEvents, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_MainWidget_CM_C_BindToChatManagerEvents::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_BindToChatManagerEvents, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000010, "Member 'WBP_MainWidget_CM_C_BindToChatManagerEvents::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");

// Function WBP_MainWidget_CM.WBP_MainWidget_CM_C.BndEvt__WBP_MainWidget_CM_WBP_SocialWindow_CM_K2Node_ComponentBoundEvent_1_OnTotalRequestCountChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_MainWidget_CM_C_BndEvt__WBP_MainWidget_CM_WBP_SocialWindow_CM_K2Node_ComponentBoundEvent_1_OnTotalRequestCountChanged__DelegateSignature final
{
public:
	int32                                         TotalCount;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_CM_C_BndEvt__WBP_MainWidget_CM_WBP_SocialWindow_CM_K2Node_ComponentBoundEvent_1_OnTotalRequestCountChanged__DelegateSignature) == 0x000004, "Wrong alignment on WBP_MainWidget_CM_C_BndEvt__WBP_MainWidget_CM_WBP_SocialWindow_CM_K2Node_ComponentBoundEvent_1_OnTotalRequestCountChanged__DelegateSignature");
static_assert(sizeof(WBP_MainWidget_CM_C_BndEvt__WBP_MainWidget_CM_WBP_SocialWindow_CM_K2Node_ComponentBoundEvent_1_OnTotalRequestCountChanged__DelegateSignature) == 0x000004, "Wrong size on WBP_MainWidget_CM_C_BndEvt__WBP_MainWidget_CM_WBP_SocialWindow_CM_K2Node_ComponentBoundEvent_1_OnTotalRequestCountChanged__DelegateSignature");
static_assert(offsetof(WBP_MainWidget_CM_C_BndEvt__WBP_MainWidget_CM_WBP_SocialWindow_CM_K2Node_ComponentBoundEvent_1_OnTotalRequestCountChanged__DelegateSignature, TotalCount) == 0x000000, "Member 'WBP_MainWidget_CM_C_BndEvt__WBP_MainWidget_CM_WBP_SocialWindow_CM_K2Node_ComponentBoundEvent_1_OnTotalRequestCountChanged__DelegateSignature::TotalCount' has a wrong offset!");

// Function WBP_MainWidget_CM.WBP_MainWidget_CM_C.BndEvt__WBP_MainWidget_CM_WBP_SocialWindow_CM_K2Node_ComponentBoundEvent_2_OnNumFriendsOnlineChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_MainWidget_CM_C_BndEvt__WBP_MainWidget_CM_WBP_SocialWindow_CM_K2Node_ComponentBoundEvent_2_OnNumFriendsOnlineChanged__DelegateSignature final
{
public:
	int32                                         NumOnline;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_CM_C_BndEvt__WBP_MainWidget_CM_WBP_SocialWindow_CM_K2Node_ComponentBoundEvent_2_OnNumFriendsOnlineChanged__DelegateSignature) == 0x000004, "Wrong alignment on WBP_MainWidget_CM_C_BndEvt__WBP_MainWidget_CM_WBP_SocialWindow_CM_K2Node_ComponentBoundEvent_2_OnNumFriendsOnlineChanged__DelegateSignature");
static_assert(sizeof(WBP_MainWidget_CM_C_BndEvt__WBP_MainWidget_CM_WBP_SocialWindow_CM_K2Node_ComponentBoundEvent_2_OnNumFriendsOnlineChanged__DelegateSignature) == 0x000004, "Wrong size on WBP_MainWidget_CM_C_BndEvt__WBP_MainWidget_CM_WBP_SocialWindow_CM_K2Node_ComponentBoundEvent_2_OnNumFriendsOnlineChanged__DelegateSignature");
static_assert(offsetof(WBP_MainWidget_CM_C_BndEvt__WBP_MainWidget_CM_WBP_SocialWindow_CM_K2Node_ComponentBoundEvent_2_OnNumFriendsOnlineChanged__DelegateSignature, NumOnline) == 0x000000, "Member 'WBP_MainWidget_CM_C_BndEvt__WBP_MainWidget_CM_WBP_SocialWindow_CM_K2Node_ComponentBoundEvent_2_OnNumFriendsOnlineChanged__DelegateSignature::NumOnline' has a wrong offset!");

// Function WBP_MainWidget_CM.WBP_MainWidget_CM_C.BndEvt__WBP_MainWidget_NotificationCountBadge_SocialPanel_K2Node_ComponentBoundEvent_9_OnVisibilityChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_MainWidget_CM_C_BndEvt__WBP_MainWidget_NotificationCountBadge_SocialPanel_K2Node_ComponentBoundEvent_9_OnVisibilityChangedEvent__DelegateSignature final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_CM_C_BndEvt__WBP_MainWidget_NotificationCountBadge_SocialPanel_K2Node_ComponentBoundEvent_9_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on WBP_MainWidget_CM_C_BndEvt__WBP_MainWidget_NotificationCountBadge_SocialPanel_K2Node_ComponentBoundEvent_9_OnVisibilityChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_MainWidget_CM_C_BndEvt__WBP_MainWidget_NotificationCountBadge_SocialPanel_K2Node_ComponentBoundEvent_9_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong size on WBP_MainWidget_CM_C_BndEvt__WBP_MainWidget_NotificationCountBadge_SocialPanel_K2Node_ComponentBoundEvent_9_OnVisibilityChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_MainWidget_CM_C_BndEvt__WBP_MainWidget_NotificationCountBadge_SocialPanel_K2Node_ComponentBoundEvent_9_OnVisibilityChangedEvent__DelegateSignature, InVisibility) == 0x000000, "Member 'WBP_MainWidget_CM_C_BndEvt__WBP_MainWidget_NotificationCountBadge_SocialPanel_K2Node_ComponentBoundEvent_9_OnVisibilityChangedEvent__DelegateSignature::InVisibility' has a wrong offset!");

// Function WBP_MainWidget_CM.WBP_MainWidget_CM_C.Can Activate Collections Wheel
// 0x0038 (0x0038 - 0x0000)
struct WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel final
{
public:
	bool                                          CanActivate;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E2C[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckWantsToSelect_WantsToSelect;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E2D[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGASComponent*                   CallFunc_GetGAS_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCharacterStateMachineComponent*        CallFunc_GetCSM_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanCurrentlyMove_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterState                               CallFunc_GetCurrentStateType_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesStatePreventCircularWheels_Prevented; // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInPlacementMode_IsInPlacementMode;      // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel) == 0x000008, "Wrong alignment on WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel");
static_assert(sizeof(WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel) == 0x000038, "Wrong size on WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel");
static_assert(offsetof(WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel, CanActivate) == 0x000000, "Member 'WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel::CanActivate' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel, CallFunc_GetValeriaCharacter_OutResult) == 0x000001, "Member 'WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000008, "Member 'WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel, CallFunc_CheckWantsToSelect_WantsToSelect) == 0x000010, "Member 'WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel::CallFunc_CheckWantsToSelect_WantsToSelect' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel, CallFunc_GetGAS_ReturnValue) == 0x000018, "Member 'WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel::CallFunc_GetGAS_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel, CallFunc_GetCSM_ReturnValue) == 0x000020, "Member 'WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel::CallFunc_GetCSM_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel, CallFunc_CanCurrentlyMove_ReturnValue) == 0x000028, "Member 'WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel::CallFunc_CanCurrentlyMove_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel, CallFunc_GetCurrentStateType_ReturnValue) == 0x000029, "Member 'WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel::CallFunc_GetCurrentStateType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel, CallFunc_Not_PreBool_ReturnValue) == 0x00002A, "Member 'WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel, CallFunc_DoesStatePreventCircularWheels_Prevented) == 0x00002B, "Member 'WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel::CallFunc_DoesStatePreventCircularWheels_Prevented' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel, K2Node_SwitchEnum_CmpSuccess) == 0x00002C, "Member 'WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel, CallFunc_IsInPlacementMode_IsInPlacementMode) == 0x00002D, "Member 'WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel::CallFunc_IsInPlacementMode_IsInPlacementMode' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel, CallFunc_BooleanOR_ReturnValue) == 0x00002E, "Member 'WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel, CallFunc_BooleanOR_ReturnValue_1) == 0x00002F, "Member 'WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel, CallFunc_BooleanOR_ReturnValue_2) == 0x000030, "Member 'WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel, CallFunc_Not_PreBool_ReturnValue_1) == 0x000031, "Member 'WBP_MainWidget_CM_C_Can_Activate_Collections_Wheel::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");

// Function WBP_MainWidget_CM.WBP_MainWidget_CM_C.CanActivateChat
// 0x0004 (0x0004 - 0x0000)
struct WBP_MainWidget_CM_C_CanActivateChat final
{
public:
	bool                                          CanActivate;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckWantsToSelect_WantsToSelect;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_CM_C_CanActivateChat) == 0x000001, "Wrong alignment on WBP_MainWidget_CM_C_CanActivateChat");
static_assert(sizeof(WBP_MainWidget_CM_C_CanActivateChat) == 0x000004, "Wrong size on WBP_MainWidget_CM_C_CanActivateChat");
static_assert(offsetof(WBP_MainWidget_CM_C_CanActivateChat, CanActivate) == 0x000000, "Member 'WBP_MainWidget_CM_C_CanActivateChat::CanActivate' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CanActivateChat, CallFunc_CheckWantsToSelect_WantsToSelect) == 0x000001, "Member 'WBP_MainWidget_CM_C_CanActivateChat::CallFunc_CheckWantsToSelect_WantsToSelect' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CanActivateChat, CallFunc_BooleanOR_ReturnValue) == 0x000002, "Member 'WBP_MainWidget_CM_C_CanActivateChat::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CanActivateChat, CallFunc_Not_PreBool_ReturnValue) == 0x000003, "Member 'WBP_MainWidget_CM_C_CanActivateChat::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_MainWidget_CM.WBP_MainWidget_CM_C.CanActivatePMenu
// 0x0028 (0x0028 - 0x0000)
struct WBP_MainWidget_CM_C_CanActivatePMenu final
{
public:
	bool                                          bCanActivate;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E2E[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInPlacementMode_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E2F[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterStateMachineComponent*        CallFunc_GetCSM_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECharacterState                               CallFunc_GetCurrentStateType_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanNOR_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_CM_C_CanActivatePMenu) == 0x000008, "Wrong alignment on WBP_MainWidget_CM_C_CanActivatePMenu");
static_assert(sizeof(WBP_MainWidget_CM_C_CanActivatePMenu) == 0x000028, "Wrong size on WBP_MainWidget_CM_C_CanActivatePMenu");
static_assert(offsetof(WBP_MainWidget_CM_C_CanActivatePMenu, bCanActivate) == 0x000000, "Member 'WBP_MainWidget_CM_C_CanActivatePMenu::bCanActivate' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CanActivatePMenu, CallFunc_GetValeriaCharacter_OutResult) == 0x000001, "Member 'WBP_MainWidget_CM_C_CanActivatePMenu::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CanActivatePMenu, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000008, "Member 'WBP_MainWidget_CM_C_CanActivatePMenu::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CanActivatePMenu, K2Node_SwitchEnum_CmpSuccess) == 0x000010, "Member 'WBP_MainWidget_CM_C_CanActivatePMenu::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CanActivatePMenu, CallFunc_IsInPlacementMode_ReturnValue) == 0x000011, "Member 'WBP_MainWidget_CM_C_CanActivatePMenu::CallFunc_IsInPlacementMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CanActivatePMenu, CallFunc_GetCSM_ReturnValue) == 0x000018, "Member 'WBP_MainWidget_CM_C_CanActivatePMenu::CallFunc_GetCSM_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CanActivatePMenu, CallFunc_GetCurrentStateType_ReturnValue) == 0x000020, "Member 'WBP_MainWidget_CM_C_CanActivatePMenu::CallFunc_GetCurrentStateType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CanActivatePMenu, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000021, "Member 'WBP_MainWidget_CM_C_CanActivatePMenu::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CanActivatePMenu, CallFunc_BooleanNOR_ReturnValue) == 0x000022, "Member 'WBP_MainWidget_CM_C_CanActivatePMenu::CallFunc_BooleanNOR_ReturnValue' has a wrong offset!");

// Function WBP_MainWidget_CM.WBP_MainWidget_CM_C.CanActivateToolWheel
// 0x0048 (0x0048 - 0x0000)
struct WBP_MainWidget_CM_C_CanActivateToolWheel final
{
public:
	bool                                          CanActivate;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckWantsToSelect_WantsToSelect;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E30[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInPlacementMode_IsInPlacementMode;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E31[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaPlayerController*               CallFunc_GetValeriaPlayerController_ReturnValue;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UValeriaGASComponent*                   CallFunc_GetGAS_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_ValeriaPlayerController_C*          K2Node_DynamicCast_AsBP_Valeria_Player_Controller; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAbilityMarkedLockedIn_ReturnValue;      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E32[0x5];                                     // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterStateMachineComponent*        CallFunc_GetCSM_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterState                               CallFunc_GetCurrentStateType_ReturnValue;          // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesStatePreventCircularWheels_Prevented; // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_CM_C_CanActivateToolWheel) == 0x000008, "Wrong alignment on WBP_MainWidget_CM_C_CanActivateToolWheel");
static_assert(sizeof(WBP_MainWidget_CM_C_CanActivateToolWheel) == 0x000048, "Wrong size on WBP_MainWidget_CM_C_CanActivateToolWheel");
static_assert(offsetof(WBP_MainWidget_CM_C_CanActivateToolWheel, CanActivate) == 0x000000, "Member 'WBP_MainWidget_CM_C_CanActivateToolWheel::CanActivate' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CanActivateToolWheel, CallFunc_CheckWantsToSelect_WantsToSelect) == 0x000001, "Member 'WBP_MainWidget_CM_C_CanActivateToolWheel::CallFunc_CheckWantsToSelect_WantsToSelect' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CanActivateToolWheel, CallFunc_GetValeriaCharacter_OutResult) == 0x000002, "Member 'WBP_MainWidget_CM_C_CanActivateToolWheel::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CanActivateToolWheel, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000008, "Member 'WBP_MainWidget_CM_C_CanActivateToolWheel::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CanActivateToolWheel, CallFunc_IsInPlacementMode_IsInPlacementMode) == 0x000010, "Member 'WBP_MainWidget_CM_C_CanActivateToolWheel::CallFunc_IsInPlacementMode_IsInPlacementMode' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CanActivateToolWheel, CallFunc_GetValeriaPlayerController_ReturnValue) == 0x000018, "Member 'WBP_MainWidget_CM_C_CanActivateToolWheel::CallFunc_GetValeriaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CanActivateToolWheel, CallFunc_GetGAS_ReturnValue) == 0x000020, "Member 'WBP_MainWidget_CM_C_CanActivateToolWheel::CallFunc_GetGAS_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CanActivateToolWheel, K2Node_DynamicCast_AsBP_Valeria_Player_Controller) == 0x000028, "Member 'WBP_MainWidget_CM_C_CanActivateToolWheel::K2Node_DynamicCast_AsBP_Valeria_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CanActivateToolWheel, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_MainWidget_CM_C_CanActivateToolWheel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CanActivateToolWheel, CallFunc_IsAbilityMarkedLockedIn_ReturnValue) == 0x000031, "Member 'WBP_MainWidget_CM_C_CanActivateToolWheel::CallFunc_IsAbilityMarkedLockedIn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CanActivateToolWheel, CallFunc_BooleanOR_ReturnValue) == 0x000032, "Member 'WBP_MainWidget_CM_C_CanActivateToolWheel::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CanActivateToolWheel, CallFunc_GetCSM_ReturnValue) == 0x000038, "Member 'WBP_MainWidget_CM_C_CanActivateToolWheel::CallFunc_GetCSM_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CanActivateToolWheel, K2Node_SwitchEnum_CmpSuccess) == 0x000040, "Member 'WBP_MainWidget_CM_C_CanActivateToolWheel::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CanActivateToolWheel, CallFunc_GetCurrentStateType_ReturnValue) == 0x000041, "Member 'WBP_MainWidget_CM_C_CanActivateToolWheel::CallFunc_GetCurrentStateType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CanActivateToolWheel, CallFunc_DoesStatePreventCircularWheels_Prevented) == 0x000042, "Member 'WBP_MainWidget_CM_C_CanActivateToolWheel::CallFunc_DoesStatePreventCircularWheels_Prevented' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CanActivateToolWheel, CallFunc_BooleanOR_ReturnValue_1) == 0x000043, "Member 'WBP_MainWidget_CM_C_CanActivateToolWheel::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function WBP_MainWidget_CM.WBP_MainWidget_CM_C.Check for Crafted Tutorial Items
// 0x02A8 (0x02A8 - 0x0000)
struct WBP_MainWidget_CM_C_Check_for_Crafted_Tutorial_Items final
{
public:
	int32                                         RecipeId;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E33[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> Param_StoveItemType;                               // 0x0008(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> TentItemType;                                      // 0x0030(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	struct FRecipeConfig                          CallFunc_GetRecipeConfigById_ReturnValue;          // 0x0058(0x0240)()
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0298(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanStartTutorialForFlag_ReturnValue;      // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_CM_C_Check_for_Crafted_Tutorial_Items) == 0x000008, "Wrong alignment on WBP_MainWidget_CM_C_Check_for_Crafted_Tutorial_Items");
static_assert(sizeof(WBP_MainWidget_CM_C_Check_for_Crafted_Tutorial_Items) == 0x0002A8, "Wrong size on WBP_MainWidget_CM_C_Check_for_Crafted_Tutorial_Items");
static_assert(offsetof(WBP_MainWidget_CM_C_Check_for_Crafted_Tutorial_Items, RecipeId) == 0x000000, "Member 'WBP_MainWidget_CM_C_Check_for_Crafted_Tutorial_Items::RecipeId' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_Check_for_Crafted_Tutorial_Items, Param_StoveItemType) == 0x000008, "Member 'WBP_MainWidget_CM_C_Check_for_Crafted_Tutorial_Items::Param_StoveItemType' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_Check_for_Crafted_Tutorial_Items, TentItemType) == 0x000030, "Member 'WBP_MainWidget_CM_C_Check_for_Crafted_Tutorial_Items::TentItemType' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_Check_for_Crafted_Tutorial_Items, CallFunc_GetRecipeConfigById_ReturnValue) == 0x000058, "Member 'WBP_MainWidget_CM_C_Check_for_Crafted_Tutorial_Items::CallFunc_GetRecipeConfigById_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_Check_for_Crafted_Tutorial_Items, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000298, "Member 'WBP_MainWidget_CM_C_Check_for_Crafted_Tutorial_Items::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_Check_for_Crafted_Tutorial_Items, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0002A0, "Member 'WBP_MainWidget_CM_C_Check_for_Crafted_Tutorial_Items::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_Check_for_Crafted_Tutorial_Items, CallFunc_CanStartTutorialForFlag_ReturnValue) == 0x0002A1, "Member 'WBP_MainWidget_CM_C_Check_for_Crafted_Tutorial_Items::CallFunc_CanStartTutorialForFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_Check_for_Crafted_Tutorial_Items, CallFunc_BooleanAND_ReturnValue) == 0x0002A2, "Member 'WBP_MainWidget_CM_C_Check_for_Crafted_Tutorial_Items::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_MainWidget_CM.WBP_MainWidget_CM_C.Check for Workbench
// 0x0038 (0x0038 - 0x0000)
struct WBP_MainWidget_CM_C_Check_for_Workbench final
{
public:
	class AValeriaCharacter*                      VC;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> WorkbenchType;                                     // 0x0008(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_OwnsItem_ReturnValue;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_CM_C_Check_for_Workbench) == 0x000008, "Wrong alignment on WBP_MainWidget_CM_C_Check_for_Workbench");
static_assert(sizeof(WBP_MainWidget_CM_C_Check_for_Workbench) == 0x000038, "Wrong size on WBP_MainWidget_CM_C_Check_for_Workbench");
static_assert(offsetof(WBP_MainWidget_CM_C_Check_for_Workbench, VC) == 0x000000, "Member 'WBP_MainWidget_CM_C_Check_for_Workbench::VC' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_Check_for_Workbench, WorkbenchType) == 0x000008, "Member 'WBP_MainWidget_CM_C_Check_for_Workbench::WorkbenchType' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_Check_for_Workbench, CallFunc_OwnsItem_ReturnValue) == 0x000030, "Member 'WBP_MainWidget_CM_C_Check_for_Workbench::CallFunc_OwnsItem_ReturnValue' has a wrong offset!");

// Function WBP_MainWidget_CM.WBP_MainWidget_CM_C.CloseSocialPanel
// 0x0040 (0x0040 - 0x0000)
struct WBP_MainWidget_CM_C_CloseSocialPanel final
{
public:
	struct FVALUI_MainHUDState                    HUDState;                                          // 0x0000(0x000C)(Edit, BlueprintVisible, NoDestructor)
	uint8                                         Pad_5E34[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class US6UI_StateViewModel*                   CallFunc_GetViewModel_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_StateViewModel*                   CallFunc_GetViewModel_ReturnValue_1;               // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVALUI_MainHUDViewModel*                K2Node_DynamicCast_AsVALUI_Main_HUDView_Model;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E35[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_MainHUDViewModel*                K2Node_DynamicCast_AsVALUI_Main_HUDView_Model_1;   // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_CM_C_CloseSocialPanel) == 0x000008, "Wrong alignment on WBP_MainWidget_CM_C_CloseSocialPanel");
static_assert(sizeof(WBP_MainWidget_CM_C_CloseSocialPanel) == 0x000040, "Wrong size on WBP_MainWidget_CM_C_CloseSocialPanel");
static_assert(offsetof(WBP_MainWidget_CM_C_CloseSocialPanel, HUDState) == 0x000000, "Member 'WBP_MainWidget_CM_C_CloseSocialPanel::HUDState' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CloseSocialPanel, CallFunc_GetViewModel_ReturnValue) == 0x000010, "Member 'WBP_MainWidget_CM_C_CloseSocialPanel::CallFunc_GetViewModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CloseSocialPanel, CallFunc_GetViewModel_ReturnValue_1) == 0x000018, "Member 'WBP_MainWidget_CM_C_CloseSocialPanel::CallFunc_GetViewModel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CloseSocialPanel, K2Node_DynamicCast_AsVALUI_Main_HUDView_Model) == 0x000020, "Member 'WBP_MainWidget_CM_C_CloseSocialPanel::K2Node_DynamicCast_AsVALUI_Main_HUDView_Model' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CloseSocialPanel, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_MainWidget_CM_C_CloseSocialPanel::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CloseSocialPanel, K2Node_DynamicCast_AsVALUI_Main_HUDView_Model_1) == 0x000030, "Member 'WBP_MainWidget_CM_C_CloseSocialPanel::K2Node_DynamicCast_AsVALUI_Main_HUDView_Model_1' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CloseSocialPanel, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'WBP_MainWidget_CM_C_CloseSocialPanel::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function WBP_MainWidget_CM.WBP_MainWidget_CM_C.CookingTutorialSetup
// 0x0030 (0x0030 - 0x0000)
struct WBP_MainWidget_CM_C_CookingTutorialSetup final
{
public:
	class UVAL_TutorialFlagsManager*              CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E36[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanStartTutorialForFlag_ReturnValue;      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E37[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSkillPersist                          CallFunc_GetSkillLevel_ReturnValue;                // 0x001C(0x000C)(NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_CM_C_CookingTutorialSetup) == 0x000008, "Wrong alignment on WBP_MainWidget_CM_C_CookingTutorialSetup");
static_assert(sizeof(WBP_MainWidget_CM_C_CookingTutorialSetup) == 0x000030, "Wrong size on WBP_MainWidget_CM_C_CookingTutorialSetup");
static_assert(offsetof(WBP_MainWidget_CM_C_CookingTutorialSetup, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000000, "Member 'WBP_MainWidget_CM_C_CookingTutorialSetup::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CookingTutorialSetup, CallFunc_GetValeriaCharacter_OutResult) == 0x000008, "Member 'WBP_MainWidget_CM_C_CookingTutorialSetup::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CookingTutorialSetup, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000010, "Member 'WBP_MainWidget_CM_C_CookingTutorialSetup::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CookingTutorialSetup, CallFunc_CanStartTutorialForFlag_ReturnValue) == 0x000018, "Member 'WBP_MainWidget_CM_C_CookingTutorialSetup::CallFunc_CanStartTutorialForFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CookingTutorialSetup, CallFunc_GetSkillLevel_ReturnValue) == 0x00001C, "Member 'WBP_MainWidget_CM_C_CookingTutorialSetup::CallFunc_GetSkillLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CookingTutorialSetup, K2Node_SwitchEnum_CmpSuccess) == 0x000028, "Member 'WBP_MainWidget_CM_C_CookingTutorialSetup::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_CookingTutorialSetup, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000029, "Member 'WBP_MainWidget_CM_C_CookingTutorialSetup::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_MainWidget_CM.WBP_MainWidget_CM_C.DialogueSetup
// 0x0150 (0x0150 - 0x0000)
struct WBP_MainWidget_CM_C_DialogueSetup final
{
public:
	ECharacterState                               CharacterState;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LeaveDialogueUnchanged;                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E38[0x6];                                     // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDialogueListToShow                    DialoguesToShow;                                   // 0x0008(0x0138)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDialogueComponent*                     Param_DialogueComponent;                           // 0x0140(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_CM_C_DialogueSetup) == 0x000008, "Wrong alignment on WBP_MainWidget_CM_C_DialogueSetup");
static_assert(sizeof(WBP_MainWidget_CM_C_DialogueSetup) == 0x000150, "Wrong size on WBP_MainWidget_CM_C_DialogueSetup");
static_assert(offsetof(WBP_MainWidget_CM_C_DialogueSetup, CharacterState) == 0x000000, "Member 'WBP_MainWidget_CM_C_DialogueSetup::CharacterState' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_DialogueSetup, LeaveDialogueUnchanged) == 0x000001, "Member 'WBP_MainWidget_CM_C_DialogueSetup::LeaveDialogueUnchanged' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_DialogueSetup, DialoguesToShow) == 0x000008, "Member 'WBP_MainWidget_CM_C_DialogueSetup::DialoguesToShow' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_DialogueSetup, Param_DialogueComponent) == 0x000140, "Member 'WBP_MainWidget_CM_C_DialogueSetup::Param_DialogueComponent' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_DialogueSetup, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000148, "Member 'WBP_MainWidget_CM_C_DialogueSetup::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_DialogueSetup, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000149, "Member 'WBP_MainWidget_CM_C_DialogueSetup::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function WBP_MainWidget_CM.WBP_MainWidget_CM_C.DoesStatePreventCircularWheels
// 0x0003 (0x0003 - 0x0000)
struct WBP_MainWidget_CM_C_DoesStatePreventCircularWheels final
{
public:
	ECharacterState                               State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Prevented;                                         // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_CM_C_DoesStatePreventCircularWheels) == 0x000001, "Wrong alignment on WBP_MainWidget_CM_C_DoesStatePreventCircularWheels");
static_assert(sizeof(WBP_MainWidget_CM_C_DoesStatePreventCircularWheels) == 0x000003, "Wrong size on WBP_MainWidget_CM_C_DoesStatePreventCircularWheels");
static_assert(offsetof(WBP_MainWidget_CM_C_DoesStatePreventCircularWheels, State) == 0x000000, "Member 'WBP_MainWidget_CM_C_DoesStatePreventCircularWheels::State' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_DoesStatePreventCircularWheels, Prevented) == 0x000001, "Member 'WBP_MainWidget_CM_C_DoesStatePreventCircularWheels::Prevented' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_DoesStatePreventCircularWheels, K2Node_SwitchEnum_CmpSuccess) == 0x000002, "Member 'WBP_MainWidget_CM_C_DoesStatePreventCircularWheels::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_MainWidget_CM.WBP_MainWidget_CM_C.DoHideHealthBar
// 0x0028 (0x0028 - 0x0000)
struct WBP_MainWidget_CM_C_DoHideHealthBar final
{
public:
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E39[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlayingForward_ReturnValue;    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E3A[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue_1;         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlayingForward_ReturnValue_1;  // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainWidget_CM_C_DoHideHealthBar) == 0x000008, "Wrong alignment on WBP_MainWidget_CM_C_DoHideHealthBar");
static_assert(sizeof(WBP_MainWidget_CM_C_DoHideHealthBar) == 0x000028, "Wrong size on WBP_MainWidget_CM_C_DoHideHealthBar");
static_assert(offsetof(WBP_MainWidget_CM_C_DoHideHealthBar, CallFunc_GetVisibility_ReturnValue) == 0x000000, "Member 'WBP_MainWidget_CM_C_DoHideHealthBar::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_DoHideHealthBar, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_MainWidget_CM_C_DoHideHealthBar::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_DoHideHealthBar, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000010, "Member 'WBP_MainWidget_CM_C_DoHideHealthBar::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_DoHideHealthBar, CallFunc_IsAnimationPlayingForward_ReturnValue) == 0x000011, "Member 'WBP_MainWidget_CM_C_DoHideHealthBar::CallFunc_IsAnimationPlayingForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_DoHideHealthBar, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000012, "Member 'WBP_MainWidget_CM_C_DoHideHealthBar::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_DoHideHealthBar, CallFunc_GetValeriaCharacter_OutResult) == 0x000013, "Member 'WBP_MainWidget_CM_C_DoHideHealthBar::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_MainWidget_CM_C_DoHideHealthBar, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000018, "Member 'WBP_MainWidget_CM_C_DoHideHealthBar::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
