#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Debug_Presences

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "Palia_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Debug_Presences.WBP_Debug_Presences_C.ExecuteUbergraph_WBP_Debug_Presences
// 0x0080 (0x0080 - 0x0000)
struct WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bDisplayDebugPresences)>  K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0014(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_509F[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPresenceManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50A0[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDebugPresenceFlag_ReturnValue;         // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50A1[0x1];                                     // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences) == 0x000008, "Wrong alignment on WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences");
static_assert(sizeof(WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences) == 0x000080, "Wrong size on WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences");
static_assert(offsetof(WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences, EntryPoint) == 0x000000, "Member 'WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences, K2Node_Event_MyGeometry) == 0x000014, "Member 'WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences, K2Node_Event_InDeltaTime) == 0x00004C, "Member 'WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences, CallFunc_Not_PreBool_ReturnValue) == 0x000050, "Member 'WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences, CallFunc_GetVisibility_ReturnValue) == 0x000051, "Member 'WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000058, "Member 'WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000060, "Member 'WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences, CallFunc_GetDebugPresenceFlag_ReturnValue) == 0x000068, "Member 'WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences::CallFunc_GetDebugPresenceFlag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences, CallFunc_Not_PreBool_ReturnValue_1) == 0x000078, "Member 'WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences, CallFunc_GetConsoleVariableBoolValue_ReturnValue) == 0x000079, "Member 'WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences::CallFunc_GetConsoleVariableBoolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences, CallFunc_BooleanAND_ReturnValue) == 0x00007A, "Member 'WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences, CallFunc_Delay_Duration_ImplicitCast) == 0x00007C, "Member 'WBP_Debug_Presences_C_ExecuteUbergraph_WBP_Debug_Presences::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

// Function WBP_Debug_Presences.WBP_Debug_Presences_C.HandleOnShowDebugPresences
// 0x0005 (0x0005 - 0x0000)
struct WBP_Debug_Presences_C_HandleOnShowDebugPresences final
{
public:
	bool                                          bDisplayDebugPresences;                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_Presences_C_HandleOnShowDebugPresences) == 0x000001, "Wrong alignment on WBP_Debug_Presences_C_HandleOnShowDebugPresences");
static_assert(sizeof(WBP_Debug_Presences_C_HandleOnShowDebugPresences) == 0x000005, "Wrong size on WBP_Debug_Presences_C_HandleOnShowDebugPresences");
static_assert(offsetof(WBP_Debug_Presences_C_HandleOnShowDebugPresences, bDisplayDebugPresences) == 0x000000, "Member 'WBP_Debug_Presences_C_HandleOnShowDebugPresences::bDisplayDebugPresences' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Presences_C_HandleOnShowDebugPresences, Temp_bool_Variable) == 0x000001, "Member 'WBP_Debug_Presences_C_HandleOnShowDebugPresences::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Presences_C_HandleOnShowDebugPresences, Temp_byte_Variable) == 0x000002, "Member 'WBP_Debug_Presences_C_HandleOnShowDebugPresences::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Presences_C_HandleOnShowDebugPresences, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_Debug_Presences_C_HandleOnShowDebugPresences::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Presences_C_HandleOnShowDebugPresences, K2Node_Select_Default) == 0x000004, "Member 'WBP_Debug_Presences_C_HandleOnShowDebugPresences::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Debug_Presences.WBP_Debug_Presences_C.RefreshPresences
// 0x0130 (0x0130 - 0x0000)
struct WBP_Debug_Presences_C_RefreshPresences final
{
public:
	TArray<class UObject*>                        Objects;                                           // 0x0000(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50A2[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPresenceManager*                       CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FUniqueNetIdRepl>               CallFunc_GetCachedPresencesUserIdList_ReturnValue; // 0x0028(0x0010)(ReferenceParm)
	struct FUniqueNetIdRepl                       CallFunc_Array_Get_Item;                           // 0x0038(0x0030)(HasGetValueTypeHash)
	class UBP_ListObject_DebugPresence_C*         CallFunc_SpawnObject_ReturnValue;                  // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPresence                              CallFunc_GetPresenceForUserId_ReturnValue;         // 0x0070(0x00B0)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_Presences_C_RefreshPresences) == 0x000008, "Wrong alignment on WBP_Debug_Presences_C_RefreshPresences");
static_assert(sizeof(WBP_Debug_Presences_C_RefreshPresences) == 0x000130, "Wrong size on WBP_Debug_Presences_C_RefreshPresences");
static_assert(offsetof(WBP_Debug_Presences_C_RefreshPresences, Objects) == 0x000000, "Member 'WBP_Debug_Presences_C_RefreshPresences::Objects' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Presences_C_RefreshPresences, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_Debug_Presences_C_RefreshPresences::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Presences_C_RefreshPresences, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_Debug_Presences_C_RefreshPresences::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Presences_C_RefreshPresences, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_Debug_Presences_C_RefreshPresences::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Presences_C_RefreshPresences, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000020, "Member 'WBP_Debug_Presences_C_RefreshPresences::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Presences_C_RefreshPresences, CallFunc_GetCachedPresencesUserIdList_ReturnValue) == 0x000028, "Member 'WBP_Debug_Presences_C_RefreshPresences::CallFunc_GetCachedPresencesUserIdList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Presences_C_RefreshPresences, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_Debug_Presences_C_RefreshPresences::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Presences_C_RefreshPresences, CallFunc_SpawnObject_ReturnValue) == 0x000068, "Member 'WBP_Debug_Presences_C_RefreshPresences::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Presences_C_RefreshPresences, CallFunc_GetPresenceForUserId_ReturnValue) == 0x000070, "Member 'WBP_Debug_Presences_C_RefreshPresences::CallFunc_GetPresenceForUserId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Presences_C_RefreshPresences, CallFunc_Array_Add_ReturnValue) == 0x000120, "Member 'WBP_Debug_Presences_C_RefreshPresences::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Presences_C_RefreshPresences, CallFunc_Array_Length_ReturnValue) == 0x000124, "Member 'WBP_Debug_Presences_C_RefreshPresences::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Presences_C_RefreshPresences, CallFunc_Less_IntInt_ReturnValue) == 0x000128, "Member 'WBP_Debug_Presences_C_RefreshPresences::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Debug_Presences.WBP_Debug_Presences_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_Debug_Presences_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Debug_Presences_C_Tick) == 0x000004, "Wrong alignment on WBP_Debug_Presences_C_Tick");
static_assert(sizeof(WBP_Debug_Presences_C_Tick) == 0x00003C, "Wrong size on WBP_Debug_Presences_C_Tick");
static_assert(offsetof(WBP_Debug_Presences_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_Debug_Presences_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Debug_Presences_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_Debug_Presences_C_Tick::InDeltaTime' has a wrong offset!");

}

