#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CrafterInWorld_Item

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CrafterInWorld_Item.WBP_CrafterInWorld_Item_C.SetItem
// 0x0110 (0x0110 - 0x0000)
struct WBP_CrafterInWorld_Item_C_SetItem final
{
public:
	struct FValeriaItem                           NewItem;                                           // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131A[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition;         // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131B[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0088(0x0050)(HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131C[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F0(0x0018)()
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterInWorld_Item_C_SetItem) == 0x000008, "Wrong alignment on WBP_CrafterInWorld_Item_C_SetItem");
static_assert(sizeof(WBP_CrafterInWorld_Item_C_SetItem) == 0x000110, "Wrong size on WBP_CrafterInWorld_Item_C_SetItem");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_SetItem, NewItem) == 0x000000, "Member 'WBP_CrafterInWorld_Item_C_SetItem::NewItem' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_SetItem, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000060, "Member 'WBP_CrafterInWorld_Item_C_SetItem::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_SetItem, CallFunc_Greater_IntInt_ReturnValue) == 0x000068, "Member 'WBP_CrafterInWorld_Item_C_SetItem::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_SetItem, K2Node_DynamicCast_AsItem_Type_Definition) == 0x000070, "Member 'WBP_CrafterInWorld_Item_C_SetItem::K2Node_DynamicCast_AsItem_Type_Definition' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_SetItem, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'WBP_CrafterInWorld_Item_C_SetItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_SetItem, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000080, "Member 'WBP_CrafterInWorld_Item_C_SetItem::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_SetItem, K2Node_MakeStruct_FormatArgumentData) == 0x000088, "Member 'WBP_CrafterInWorld_Item_C_SetItem::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_SetItem, Temp_byte_Variable) == 0x0000D8, "Member 'WBP_CrafterInWorld_Item_C_SetItem::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_SetItem, K2Node_MakeArray_Array) == 0x0000E0, "Member 'WBP_CrafterInWorld_Item_C_SetItem::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_SetItem, CallFunc_Format_ReturnValue) == 0x0000F0, "Member 'WBP_CrafterInWorld_Item_C_SetItem::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_SetItem, Temp_byte_Variable_1) == 0x000108, "Member 'WBP_CrafterInWorld_Item_C_SetItem::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_SetItem, Temp_bool_Variable) == 0x000109, "Member 'WBP_CrafterInWorld_Item_C_SetItem::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_SetItem, K2Node_Select_Default) == 0x00010A, "Member 'WBP_CrafterInWorld_Item_C_SetItem::K2Node_Select_Default' has a wrong offset!");

// Function WBP_CrafterInWorld_Item.WBP_CrafterInWorld_Item_C.SetItemColorAndOpacity
// 0x0010 (0x0010 - 0x0000)
struct WBP_CrafterInWorld_Item_C_SetItemColorAndOpacity final
{
public:
	struct FLinearColor                           InColorAndOpacity;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterInWorld_Item_C_SetItemColorAndOpacity) == 0x000004, "Wrong alignment on WBP_CrafterInWorld_Item_C_SetItemColorAndOpacity");
static_assert(sizeof(WBP_CrafterInWorld_Item_C_SetItemColorAndOpacity) == 0x000010, "Wrong size on WBP_CrafterInWorld_Item_C_SetItemColorAndOpacity");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_SetItemColorAndOpacity, InColorAndOpacity) == 0x000000, "Member 'WBP_CrafterInWorld_Item_C_SetItemColorAndOpacity::InColorAndOpacity' has a wrong offset!");

// Function WBP_CrafterInWorld_Item.WBP_CrafterInWorld_Item_C.GetRecipeItem
// 0x0340 (0x0340 - 0x0000)
struct WBP_CrafterInWorld_Item_C_GetRecipeItem final
{
public:
	int32                                         RecipeConfigId;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FValeriaItem                           Item;                                              // 0x0008(0x0060)(Parm, OutParm)
	EValeriaFuncResult                            CallFunc_FindRecipeConfigById_OutResult;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131E[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRecipeConfig                          CallFunc_FindRecipeConfigById_ReturnValue;         // 0x0070(0x0240)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_131F[0x7];                                     // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x02B8(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	struct FValeriaItem                           K2Node_MakeStruct_ValeriaItem;                     // 0x02E0(0x0060)()
};
static_assert(alignof(WBP_CrafterInWorld_Item_C_GetRecipeItem) == 0x000008, "Wrong alignment on WBP_CrafterInWorld_Item_C_GetRecipeItem");
static_assert(sizeof(WBP_CrafterInWorld_Item_C_GetRecipeItem) == 0x000340, "Wrong size on WBP_CrafterInWorld_Item_C_GetRecipeItem");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_GetRecipeItem, RecipeConfigId) == 0x000000, "Member 'WBP_CrafterInWorld_Item_C_GetRecipeItem::RecipeConfigId' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_GetRecipeItem, Item) == 0x000008, "Member 'WBP_CrafterInWorld_Item_C_GetRecipeItem::Item' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_GetRecipeItem, CallFunc_FindRecipeConfigById_OutResult) == 0x000068, "Member 'WBP_CrafterInWorld_Item_C_GetRecipeItem::CallFunc_FindRecipeConfigById_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_GetRecipeItem, CallFunc_FindRecipeConfigById_ReturnValue) == 0x000070, "Member 'WBP_CrafterInWorld_Item_C_GetRecipeItem::CallFunc_FindRecipeConfigById_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_GetRecipeItem, K2Node_SwitchEnum_CmpSuccess) == 0x0002B0, "Member 'WBP_CrafterInWorld_Item_C_GetRecipeItem::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_GetRecipeItem, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x0002B8, "Member 'WBP_CrafterInWorld_Item_C_GetRecipeItem::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_GetRecipeItem, K2Node_MakeStruct_ValeriaItem) == 0x0002E0, "Member 'WBP_CrafterInWorld_Item_C_GetRecipeItem::K2Node_MakeStruct_ValeriaItem' has a wrong offset!");

// Function WBP_CrafterInWorld_Item.WBP_CrafterInWorld_Item_C.UpdateCraftTimer
// 0x0370 (0x0370 - 0x0000)
struct WBP_CrafterInWorld_Item_C_UpdateCraftTimer final
{
public:
	class UCrafterComponent*                      Crafter;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECrafterState                                 LocalState;                                        // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1320[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         EndTime;                                           // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StartTime;                                         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1321[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCrafterConfig                         CallFunc_GetCrafterConfig_ReturnValue;             // 0x0018(0x00E0)(ConstParm, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECrafterState                                 CallFunc_GetCrafterState_ReturnValue;              // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1322[0x3];                                     // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRecipeIdCrafting_ReturnValue;          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCraftLimitTimes_startTime;             // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCraftLimitTimes_endTime;               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCraftLimitTimes_ReturnValue;           // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x0116(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1323[0x1];                                     // 0x0117(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCraftPhaseTimes_startTime;             // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCraftPhaseTimes_endTime;               // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCraftPhaseTimes_ReturnValue;           // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_FindRecipeConfigById_OutResult;           // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1324[0x6];                                     // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRecipeConfig                          CallFunc_FindRecipeConfigById_ReturnValue;         // 0x0128(0x0240)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECrafterMode                                  Temp_byte_Variable;                                // 0x0369(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x036A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x036B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer) == 0x000008, "Wrong alignment on WBP_CrafterInWorld_Item_C_UpdateCraftTimer");
static_assert(sizeof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer) == 0x000370, "Wrong size on WBP_CrafterInWorld_Item_C_UpdateCraftTimer");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, Crafter) == 0x000000, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::Crafter' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, LocalState) == 0x000008, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::LocalState' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, EndTime) == 0x00000C, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::EndTime' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, StartTime) == 0x000010, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::StartTime' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, CallFunc_GetCrafterConfig_ReturnValue) == 0x000018, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::CallFunc_GetCrafterConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000F8, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000F9, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0000FA, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, CallFunc_GetCrafterState_ReturnValue) == 0x0000FB, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::CallFunc_GetCrafterState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, CallFunc_BooleanOR_ReturnValue) == 0x0000FC, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, CallFunc_BooleanOR_ReturnValue_1) == 0x0000FD, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, Temp_bool_Variable) == 0x0000FE, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, Temp_bool_Variable_1) == 0x0000FF, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, Temp_bool_Variable_2) == 0x000100, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000101, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, Temp_bool_Variable_3) == 0x000102, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, CallFunc_IsValid_ReturnValue) == 0x000103, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, CallFunc_Greater_IntInt_ReturnValue) == 0x000104, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, CallFunc_GetRecipeIdCrafting_ReturnValue) == 0x000108, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::CallFunc_GetRecipeIdCrafting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, CallFunc_GetCraftLimitTimes_startTime) == 0x00010C, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::CallFunc_GetCraftLimitTimes_startTime' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, CallFunc_GetCraftLimitTimes_endTime) == 0x000110, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::CallFunc_GetCraftLimitTimes_endTime' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, CallFunc_GetCraftLimitTimes_ReturnValue) == 0x000114, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::CallFunc_GetCraftLimitTimes_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000115, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, CallFunc_BooleanOR_ReturnValue_2) == 0x000116, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, CallFunc_GetCraftPhaseTimes_startTime) == 0x000118, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::CallFunc_GetCraftPhaseTimes_startTime' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, CallFunc_GetCraftPhaseTimes_endTime) == 0x00011C, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::CallFunc_GetCraftPhaseTimes_endTime' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, CallFunc_GetCraftPhaseTimes_ReturnValue) == 0x000120, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::CallFunc_GetCraftPhaseTimes_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, CallFunc_FindRecipeConfigById_OutResult) == 0x000121, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::CallFunc_FindRecipeConfigById_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, CallFunc_FindRecipeConfigById_ReturnValue) == 0x000128, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::CallFunc_FindRecipeConfigById_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, K2Node_SwitchEnum_CmpSuccess) == 0x000368, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, Temp_byte_Variable) == 0x000369, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, K2Node_Select_Default) == 0x00036A, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_UpdateCraftTimer, CallFunc_BooleanAND_ReturnValue) == 0x00036B, "Member 'WBP_CrafterInWorld_Item_C_UpdateCraftTimer::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_CrafterInWorld_Item.WBP_CrafterInWorld_Item_C.SetCurrentCrafter
// 0x0038 (0x0038 - 0x0000)
struct WBP_CrafterInWorld_Item_C_SetCurrentCrafter final
{
public:
	class UCrafterComponent*                      NewCrafter;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCrafterComponent*                      OutCrafter;                                        // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1325[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UCrafterComponent* Crafter)> K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCrafterComponent* Crafter)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterInWorld_Item_C_SetCurrentCrafter) == 0x000008, "Wrong alignment on WBP_CrafterInWorld_Item_C_SetCurrentCrafter");
static_assert(sizeof(WBP_CrafterInWorld_Item_C_SetCurrentCrafter) == 0x000038, "Wrong size on WBP_CrafterInWorld_Item_C_SetCurrentCrafter");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_SetCurrentCrafter, NewCrafter) == 0x000000, "Member 'WBP_CrafterInWorld_Item_C_SetCurrentCrafter::NewCrafter' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_SetCurrentCrafter, OutCrafter) == 0x000008, "Member 'WBP_CrafterInWorld_Item_C_SetCurrentCrafter::OutCrafter' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_SetCurrentCrafter, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_CrafterInWorld_Item_C_SetCurrentCrafter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_SetCurrentCrafter, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'WBP_CrafterInWorld_Item_C_SetCurrentCrafter::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_SetCurrentCrafter, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'WBP_CrafterInWorld_Item_C_SetCurrentCrafter::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_SetCurrentCrafter, CallFunc_IsValid_ReturnValue_1) == 0x000034, "Member 'WBP_CrafterInWorld_Item_C_SetCurrentCrafter::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_CrafterInWorld_Item.WBP_CrafterInWorld_Item_C.BP_OnCrafterChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_CrafterInWorld_Item_C_BP_OnCrafterChanged final
{
public:
	class UCrafterComponent*                      Crafter;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterInWorld_Item_C_BP_OnCrafterChanged) == 0x000008, "Wrong alignment on WBP_CrafterInWorld_Item_C_BP_OnCrafterChanged");
static_assert(sizeof(WBP_CrafterInWorld_Item_C_BP_OnCrafterChanged) == 0x000008, "Wrong size on WBP_CrafterInWorld_Item_C_BP_OnCrafterChanged");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_BP_OnCrafterChanged, Crafter) == 0x000000, "Member 'WBP_CrafterInWorld_Item_C_BP_OnCrafterChanged::Crafter' has a wrong offset!");

// Function WBP_CrafterInWorld_Item.WBP_CrafterInWorld_Item_C.LinkOrUnlinkCrafter
// 0x0008 (0x0008 - 0x0000)
struct WBP_CrafterInWorld_Item_C_LinkOrUnlinkCrafter final
{
public:
	class UCrafterComponent*                      Crafter;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterInWorld_Item_C_LinkOrUnlinkCrafter) == 0x000008, "Wrong alignment on WBP_CrafterInWorld_Item_C_LinkOrUnlinkCrafter");
static_assert(sizeof(WBP_CrafterInWorld_Item_C_LinkOrUnlinkCrafter) == 0x000008, "Wrong size on WBP_CrafterInWorld_Item_C_LinkOrUnlinkCrafter");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_LinkOrUnlinkCrafter, Crafter) == 0x000000, "Member 'WBP_CrafterInWorld_Item_C_LinkOrUnlinkCrafter::Crafter' has a wrong offset!");

// Function WBP_CrafterInWorld_Item.WBP_CrafterInWorld_Item_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_CrafterInWorld_Item_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterInWorld_Item_C_Tick) == 0x000004, "Wrong alignment on WBP_CrafterInWorld_Item_C_Tick");
static_assert(sizeof(WBP_CrafterInWorld_Item_C_Tick) == 0x00003C, "Wrong size on WBP_CrafterInWorld_Item_C_Tick");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_CrafterInWorld_Item_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_CrafterInWorld_Item_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_CrafterInWorld_Item.WBP_CrafterInWorld_Item_C.HandleCrafterChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CrafterInWorld_Item_C_HandleCrafterChanged__DelegateSignature final
{
public:
	class UObject*                                Crafter;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterInWorld_Item_C_HandleCrafterChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CrafterInWorld_Item_C_HandleCrafterChanged__DelegateSignature");
static_assert(sizeof(WBP_CrafterInWorld_Item_C_HandleCrafterChanged__DelegateSignature) == 0x000008, "Wrong size on WBP_CrafterInWorld_Item_C_HandleCrafterChanged__DelegateSignature");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_HandleCrafterChanged__DelegateSignature, Crafter) == 0x000000, "Member 'WBP_CrafterInWorld_Item_C_HandleCrafterChanged__DelegateSignature::Crafter' has a wrong offset!");

// Function WBP_CrafterInWorld_Item.WBP_CrafterInWorld_Item_C.ExecuteUbergraph_WBP_CrafterInWorld_Item
// 0x01B8 (0x01B8 - 0x0000)
struct WBP_CrafterInWorld_Item_C_ExecuteUbergraph_WBP_CrafterInWorld_Item final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECrafterState                                 Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1326[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1327[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAlmostBurnt__IsAlmostBurnt;             // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECrafterState                                 CallFunc_GetCrafterState_ReturnValue;              // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1328[0x2];                                     // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UCrafterComponent*                      K2Node_CustomEvent_Crafter;                        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1329[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FValeriaItem                           CallFunc_GetItemCrafting_ReturnValue;              // 0x0048(0x0060)()
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasRecipeFailed_ReturnValue;              // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132A[0x6];                                     // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FValeriaItem                           CallFunc_GetRecipeItemToProduce_ReturnValue;       // 0x00B0(0x0060)()
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132B[0x6];                                     // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCrafterComponent*                      K2Node_Event_Crafter;                              // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCrafterComponent*                      CallFunc_SetCurrentCrafter_OutCrafter;             // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0128(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132C[0x4];                                     // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraUIComponent*                    CallFunc_GetNiagaraComponent_ReturnValue;          // 0x0168(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_FindOuterMostWidget_ReturnValue;          // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderOpacity_ReturnValue;             // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x017D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132D[0x2];                                     // 0x017E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_132E[0x7];                                     // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_AkSpawnAtLocation_ReturnValue;            // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x01B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CrafterInWorld_Item_C_ExecuteUbergraph_WBP_CrafterInWorld_Item) == 0x000008, "Wrong alignment on WBP_CrafterInWorld_Item_C_ExecuteUbergraph_WBP_CrafterInWorld_Item");
static_assert(sizeof(WBP_CrafterInWorld_Item_C_ExecuteUbergraph_WBP_CrafterInWorld_Item) == 0x0001B8, "Wrong size on WBP_CrafterInWorld_Item_C_ExecuteUbergraph_WBP_CrafterInWorld_Item");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_ExecuteUbergraph_WBP_CrafterInWorld_Item, EntryPoint) == 0x000000, "Member 'WBP_CrafterInWorld_Item_C_ExecuteUbergraph_WBP_CrafterInWorld_Item::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CrafterInWorld_Item_C_ExecuteUbergraph_WBP_CrafterInWorld_Item, Temp_byte_Variable) == 0x000004, "Member 'WBP_CrafterInWorld_Item_C_ExecuteUbergraph_WBP_CrafterInWorld_Item::Temp_byte_Variable' has a wrong offset!");
