#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InventoryFullError

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ValeriaUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InventoryFullError.WBP_InventoryFullError_C
// 0x0020 (0x0578 - 0x0558)
class UWBP_InventoryFullError_C final : public UVALUI_ModalWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0558(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVALUI_TextBlock_Styled*                Text_Description;                                  // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Template_Notification_Basic_Error_C* WBP_Template_Notification_Basic_Error;             // 0x0568(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAkAudioEvent*                          Ak_Event;                                          // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void ActivateError();
	void ExecuteUbergraph_WBP_InventoryFullError(int32 EntryPoint, class UVALUI_NotificationQueue* K2Node_Event_NotificationQueue_1, struct FGuid& K2Node_Event_NotificationId_1, class UVALUI_NotificationQueue* K2Node_Event_NotificationQueue, struct FGuid& K2Node_Event_NotificationId);
	void HandleNotificationDismissed(class UVALUI_NotificationQueue* NotificationQueue, struct FGuid& NotificationId);
	void HandleNotificationShown(class UVALUI_NotificationQueue* NotificationQueue, struct FGuid& NotificationId);
	bool MatchesNotification(class FText& NotificationText, TSoftObjectPtr<class UTexture2D>& NotificationIcon);
	void UpdateText(class FText NewText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_InventoryFullError_C">();
	}
	static class UWBP_InventoryFullError_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InventoryFullError_C>();
	}
};
static_assert(alignof(UWBP_InventoryFullError_C) == 0x000008, "Wrong alignment on UWBP_InventoryFullError_C");
static_assert(sizeof(UWBP_InventoryFullError_C) == 0x000578, "Wrong size on UWBP_InventoryFullError_C");
static_assert(offsetof(UWBP_InventoryFullError_C, UberGraphFrame) == 0x000558, "Member 'UWBP_InventoryFullError_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryFullError_C, Text_Description) == 0x000560, "Member 'UWBP_InventoryFullError_C::Text_Description' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryFullError_C, WBP_Template_Notification_Basic_Error) == 0x000568, "Member 'UWBP_InventoryFullError_C::WBP_Template_Notification_Basic_Error' has a wrong offset!");
static_assert(offsetof(UWBP_InventoryFullError_C, Ak_Event) == 0x000570, "Member 'UWBP_InventoryFullError_C::Ak_Event' has a wrong offset!");

}

