#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ListEntry_GuildActivityTracker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Palia_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ListEntry_GuildActivityTracker.WBP_ListEntry_GuildActivityTracker_C
// 0x00C0 (0x0380 - 0x02C0)
class UWBP_ListEntry_GuildActivityTracker_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVALUI_TextBlock_Styled*                Amount;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                CounterId;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVAL_PlayerGuildQuest                  QuestInfo;                                         // 0x02D8(0x0088)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnContributeClicked;                               // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnDeleteClicked;                                   // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WBP_ListEntry_GuildActivityTracker(int32 EntryPoint, TDelegate<void(class UObject* Loaded)> K2Node_CreateDelegate_OutputDelegate, class UObject* K2Node_CustomEvent_Loaded, const class FString& CallFunc_Conv_GuidToString_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue, class UObject* Temp_object_Variable, class UVAL_ItemTypeDefinitionAsset* K2Node_DynamicCast_AsItem_Type_Definition, bool K2Node_DynamicCast_bSuccess, const class FString& CallFunc_Conv_IntToString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, const class FString& CallFunc_Conv_IntToString_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, class FText CallFunc_Conv_StringToText_ReturnValue_1, const struct FVAL_PlayerGuildQuest& K2Node_CustomEvent_Quest);
	void HandleContributeClicked(EValeriaFuncResult CallFunc_GetValeriaPlayerController_OutResult, class AValeriaPlayerController* CallFunc_GetValeriaPlayerController_ReturnValue, class UVAL_PlayerGuildComponent* CallFunc_GetComponentByClass_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, class UObject* CallFunc_LoadAsset_Blocking_ReturnValue, class UVAL_ItemTypeDefinitionAsset* K2Node_DynamicCast_AsItem_Type_Definition, bool K2Node_DynamicCast_bSuccess, const class FString& CallFunc_Conv_IntToString_ReturnValue);
	void HandleDeleteClicked(EValeriaFuncResult CallFunc_GetValeriaPlayerController_OutResult, class AValeriaPlayerController* CallFunc_GetValeriaPlayerController_ReturnValue, class UVAL_PlayerGuildComponent* CallFunc_GetComponentByClass_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess);
	void InitializeFromQuestInfo(struct FVAL_PlayerGuildQuest& Quest);
	void OnContributeClicked__DelegateSignature(struct FVAL_PlayerGuildQuest& Quest);
	void OnDeleteClicked__DelegateSignature(struct FVAL_PlayerGuildQuest& Quest);
	void OnLoaded_EE92293646BD348632AE99B65BDE7D5E(class UObject* Loaded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ListEntry_GuildActivityTracker_C">();
	}
	static class UWBP_ListEntry_GuildActivityTracker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ListEntry_GuildActivityTracker_C>();
	}
};
static_assert(alignof(UWBP_ListEntry_GuildActivityTracker_C) == 0x000008, "Wrong alignment on UWBP_ListEntry_GuildActivityTracker_C");
static_assert(sizeof(UWBP_ListEntry_GuildActivityTracker_C) == 0x000380, "Wrong size on UWBP_ListEntry_GuildActivityTracker_C");
static_assert(offsetof(UWBP_ListEntry_GuildActivityTracker_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_ListEntry_GuildActivityTracker_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_GuildActivityTracker_C, Amount) == 0x0002C8, "Member 'UWBP_ListEntry_GuildActivityTracker_C::Amount' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_GuildActivityTracker_C, CounterId) == 0x0002D0, "Member 'UWBP_ListEntry_GuildActivityTracker_C::CounterId' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_GuildActivityTracker_C, QuestInfo) == 0x0002D8, "Member 'UWBP_ListEntry_GuildActivityTracker_C::QuestInfo' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_GuildActivityTracker_C, OnContributeClicked) == 0x000360, "Member 'UWBP_ListEntry_GuildActivityTracker_C::OnContributeClicked' has a wrong offset!");
static_assert(offsetof(UWBP_ListEntry_GuildActivityTracker_C, OnDeleteClicked) == 0x000370, "Member 'UWBP_ListEntry_GuildActivityTracker_C::OnDeleteClicked' has a wrong offset!");

}

