#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DraggedItem_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "Palia_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DraggedItem_CM.WBP_DraggedItem_CM_C
// 0x0078 (0x0360 - 0x02E8)
class UWBP_DraggedItem_CM_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URetainerBox*                           RetainerBox_Shadow;                                // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Item_CM_C*                         WBP_Item_CM;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FValeriaItem                           Item;                                              // 0x0300(0x0060)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void Construct();
	void ExecuteUbergraph_WBP_DraggedItem_CM(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DraggedItem_CM_C">();
	}
	static class UWBP_DraggedItem_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DraggedItem_CM_C>();
	}
};
static_assert(alignof(UWBP_DraggedItem_CM_C) == 0x000008, "Wrong alignment on UWBP_DraggedItem_CM_C");
static_assert(sizeof(UWBP_DraggedItem_CM_C) == 0x000360, "Wrong size on UWBP_DraggedItem_CM_C");
static_assert(offsetof(UWBP_DraggedItem_CM_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_DraggedItem_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DraggedItem_CM_C, RetainerBox_Shadow) == 0x0002F0, "Member 'UWBP_DraggedItem_CM_C::RetainerBox_Shadow' has a wrong offset!");
static_assert(offsetof(UWBP_DraggedItem_CM_C, WBP_Item_CM) == 0x0002F8, "Member 'UWBP_DraggedItem_CM_C::WBP_Item_CM' has a wrong offset!");
static_assert(offsetof(UWBP_DraggedItem_CM_C, Item) == 0x000300, "Member 'UWBP_DraggedItem_CM_C::Item' has a wrong offset!");

}

