#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Template_Button_Secondary_01_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Template_Button_Secondary_01_CM.WBP_Template_Button_Secondary_01_CM_C
// 0x0138 (0x03F8 - 0x02C0)
class UWBP_Template_Button_Secondary_01_CM_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_Template_Button_CM_C*              Button;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                    CommonActionWidget;                                // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               IADescriptionOverlay;                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                IADescriptionSpacer;                               // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             SlotLeft;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             SlotRight;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                Text_Button;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FocusTip_CM_C*                     WBP_FocusTip_CM;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnButtonClicked;                                   // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                   Text;                                              // 0x0318(0x0018)(Edit, BlueprintVisible)
	class UVALUI_TextBlockStyle*                  TextStyle_Clicked;                                 // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVALUI_TextBlockStyle*                  TextStyle_Default;                                 // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnButtonHovered;                                   // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnButtonUnhovered;                                 // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnButtonPressed;                                   // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_             OnButtonReleased;                                  // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UVALUI_TextBlockStyle*                  TextStyle_Clicked_Console;                         // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVALUI_TextBlockStyle*                  TextStyle_Default_Console;                         // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              LeftSlotVisibility;                                // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              RightSlotVisibility;                               // 0x0391(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C8[0x2];                                     // 0x0392(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                TextPadding;                                       // 0x0394(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45C9[0x4];                                     // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          Clicked_Audio;                                     // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Hovered_Audio;                                     // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Unhovered_Audio;                                   // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          HideInputAction;                                   // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldOverrideButtonStyle;                         // 0x03C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45CA[0x6];                                     // 0x03C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ButtonStyle_Override;                              // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           InInputAction;                                     // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowImage;                                         // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BoundButton;                                       // 0x03D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45CB[0x6];                                     // 0x03DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             OnFocus;                                           // 0x03E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsShowFocusTip;                                   // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BindIA(class UInputAction* IA);
	void BndEvt__WBP_Template_Button_Secondary_01_Button_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature();
	void BndEvt__WBP_Template_Button_Secondary_01_Button_K2Node_ComponentBoundEvent_2_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__WBP_Template_Button_Secondary_01_Button_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_Template_Button_Secondary_01_Button_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_Template_Button_Secondary_01_CM_Button_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Param_Button);
	void BndEvt__WBP_Template_Button_Secondary_01_CM_Button_K2Node_ComponentBoundEvent_11_OnUnfocused__DelegateSignature();
	void BndEvt__WBP_Template_Button_Secondary_01_CM_Button_K2Node_ComponentBoundEvent_5_OnFocused__DelegateSignature();
	void BndEvt__WBP_Template_Button_Secondary_01_CM_Button_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Param_Button);
	void BndEvt__WBP_Template_Button_Secondary_01_CM_Button_K2Node_ComponentBoundEvent_7_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Param_Button);
	void BndEvt__WBP_Template_Button_Secondary_01_CM_Button_K2Node_ComponentBoundEvent_8_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Param_Button);
	void BndEvt__WBP_Template_Button_Secondary_01_CM_Button_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Param_Button);
	void BndEvt__WBP_Template_Button_Secondary_01_VALUI_Button_Styled_73_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_WBP_Template_Button_Secondary_01_CM(int32 EntryPoint, bool K2Node_Event_IsDesignTime, class UOverlaySlot* CallFunc_SlotAsOverlaySlot_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue_1, int32 CallFunc_AkEventGlobal_ReturnValue_2, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_4, int32 CallFunc_AkEventGlobal_ReturnValue_3, int32 CallFunc_AkEventGlobal_ReturnValue_4, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_3, int32 CallFunc_AkEventGlobal_ReturnValue_5, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_2, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button_1, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button, ECommonInputType K2Node_CustomEvent_bNewInputType, class UCommonInputSubsystem* CallFunc_GetLocalPlayerSubsystem_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_IsValid_ReturnValue, TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate, const struct FFocusEvent& K2Node_Event_InFocusEvent);
	void HideFocusTip();
	void OnButtonClicked__DelegateSignature();
	void OnButtonHovered__DelegateSignature();
	void OnButtonPressed__DelegateSignature();
	void OnButtonReleased__DelegateSignature();
	void OnButtonUnhovered__DelegateSignature();
	void OnFocus__DelegateSignature();
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent, const struct FEventReply& CallFunc_Handled_ReturnValue);
	void OnInputMethodChanged(ECommonInputType bNewInputType);
	void PreConstruct(bool IsDesignTime);
	void SetButtonStyle(class UClass* Style);
	void SetInputAction(class UInputAction* Action);
	void SetInputActionOverride(class UInputAction* NewInputAction);
	void SetPlatformAppearance(bool CallFunc_IsConsole_ReturnValue, bool CallFunc_IsDesktop_ReturnValue);
	void SetText(class FText Param_Text);
	void SetTextStyle(class UVALUI_TextBlockStyle* InDesktopStyle, class UVALUI_TextBlockStyle* InConsoleStyle, bool CallFunc_IsConsole_ReturnValue, bool CallFunc_IsDesktop_ReturnValue);
	void ShowFocusTip();
	void UpdateIADescriptionPadding(float OffsetLeft, class UCommonButtonStyle* CallFunc_GetStyle_ReturnValue, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue, const struct FMargin& K2Node_MakeStruct_Margin, class UHorizontalBoxSlot* CallFunc_SlotAsHorizontalBoxSlot_ReturnValue, bool CallFunc_IsValid_ReturnValue, double CallFunc_MakeVector2D_X_ImplicitCast, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast, float K2Node_MakeStruct_Left_ImplicitCast);
	void UpdateKeyPrompt(bool bGamepadInput, const struct FMargin& ConsoleKeyPromptMargin, const struct FMargin& PCKeyPromptMargin);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Template_Button_Secondary_01_CM_C">();
	}
	static class UWBP_Template_Button_Secondary_01_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Template_Button_Secondary_01_CM_C>();
	}
};
static_assert(alignof(UWBP_Template_Button_Secondary_01_CM_C) == 0x000008, "Wrong alignment on UWBP_Template_Button_Secondary_01_CM_C");
static_assert(sizeof(UWBP_Template_Button_Secondary_01_CM_C) == 0x0003F8, "Wrong size on UWBP_Template_Button_Secondary_01_CM_C");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_Template_Button_Secondary_01_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, Button) == 0x0002C8, "Member 'UWBP_Template_Button_Secondary_01_CM_C::Button' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, CommonActionWidget) == 0x0002D0, "Member 'UWBP_Template_Button_Secondary_01_CM_C::CommonActionWidget' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, IADescriptionOverlay) == 0x0002D8, "Member 'UWBP_Template_Button_Secondary_01_CM_C::IADescriptionOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, IADescriptionSpacer) == 0x0002E0, "Member 'UWBP_Template_Button_Secondary_01_CM_C::IADescriptionSpacer' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, SlotLeft) == 0x0002E8, "Member 'UWBP_Template_Button_Secondary_01_CM_C::SlotLeft' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, SlotRight) == 0x0002F0, "Member 'UWBP_Template_Button_Secondary_01_CM_C::SlotRight' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, Text_Button) == 0x0002F8, "Member 'UWBP_Template_Button_Secondary_01_CM_C::Text_Button' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, WBP_FocusTip_CM) == 0x000300, "Member 'UWBP_Template_Button_Secondary_01_CM_C::WBP_FocusTip_CM' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, OnButtonClicked) == 0x000308, "Member 'UWBP_Template_Button_Secondary_01_CM_C::OnButtonClicked' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, Text) == 0x000318, "Member 'UWBP_Template_Button_Secondary_01_CM_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, TextStyle_Clicked) == 0x000330, "Member 'UWBP_Template_Button_Secondary_01_CM_C::TextStyle_Clicked' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, TextStyle_Default) == 0x000338, "Member 'UWBP_Template_Button_Secondary_01_CM_C::TextStyle_Default' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, OnButtonHovered) == 0x000340, "Member 'UWBP_Template_Button_Secondary_01_CM_C::OnButtonHovered' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, OnButtonUnhovered) == 0x000350, "Member 'UWBP_Template_Button_Secondary_01_CM_C::OnButtonUnhovered' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, OnButtonPressed) == 0x000360, "Member 'UWBP_Template_Button_Secondary_01_CM_C::OnButtonPressed' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, OnButtonReleased) == 0x000370, "Member 'UWBP_Template_Button_Secondary_01_CM_C::OnButtonReleased' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, TextStyle_Clicked_Console) == 0x000380, "Member 'UWBP_Template_Button_Secondary_01_CM_C::TextStyle_Clicked_Console' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, TextStyle_Default_Console) == 0x000388, "Member 'UWBP_Template_Button_Secondary_01_CM_C::TextStyle_Default_Console' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, LeftSlotVisibility) == 0x000390, "Member 'UWBP_Template_Button_Secondary_01_CM_C::LeftSlotVisibility' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, RightSlotVisibility) == 0x000391, "Member 'UWBP_Template_Button_Secondary_01_CM_C::RightSlotVisibility' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, TextPadding) == 0x000394, "Member 'UWBP_Template_Button_Secondary_01_CM_C::TextPadding' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, Clicked_Audio) == 0x0003A8, "Member 'UWBP_Template_Button_Secondary_01_CM_C::Clicked_Audio' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, Hovered_Audio) == 0x0003B0, "Member 'UWBP_Template_Button_Secondary_01_CM_C::Hovered_Audio' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, Unhovered_Audio) == 0x0003B8, "Member 'UWBP_Template_Button_Secondary_01_CM_C::Unhovered_Audio' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, HideInputAction) == 0x0003C0, "Member 'UWBP_Template_Button_Secondary_01_CM_C::HideInputAction' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, ShouldOverrideButtonStyle) == 0x0003C1, "Member 'UWBP_Template_Button_Secondary_01_CM_C::ShouldOverrideButtonStyle' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, ButtonStyle_Override) == 0x0003C8, "Member 'UWBP_Template_Button_Secondary_01_CM_C::ButtonStyle_Override' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, InInputAction) == 0x0003D0, "Member 'UWBP_Template_Button_Secondary_01_CM_C::InInputAction' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, ShowImage) == 0x0003D8, "Member 'UWBP_Template_Button_Secondary_01_CM_C::ShowImage' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, BoundButton) == 0x0003D9, "Member 'UWBP_Template_Button_Secondary_01_CM_C::BoundButton' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, OnFocus) == 0x0003E0, "Member 'UWBP_Template_Button_Secondary_01_CM_C::OnFocus' has a wrong offset!");
static_assert(offsetof(UWBP_Template_Button_Secondary_01_CM_C, bIsShowFocusTip) == 0x0003F0, "Member 'UWBP_Template_Button_Secondary_01_CM_C::bIsShowFocusTip' has a wrong offset!");

}

