#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AmmoPouch_TutorialModal2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_TutorialModal_CM_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_AmmoPouch_TutorialModal2.WBP_AmmoPouch_TutorialModal2_C
// 0x0030 (0x0300 - 0x02D0)
class UWBP_AmmoPouch_TutorialModal2_C final : public UWBP_TutorialModal_CM_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image;                                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_RichTextBlock_Styled*            VALUI_RichTextBlock_Styled;                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             ButtonClicked;                                     // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UBinkMediaPlayer*                       BinkPlayer;                                        // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ButtonClicked__DelegateSignature();
	void Construct();
	void Destruct();
	void ExecuteUbergraph_WBP_AmmoPouch_TutorialModal2(int32 EntryPoint, bool CallFunc_IsValid_ReturnValue, class UBinkMediaPlayer* CallFunc_SetTutorialModalData_BinkPlayerValue, class UMediaPlayer* CallFunc_SetTutorialModalData_MediaPlayerValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_AmmoPouch_TutorialModal2_C">();
	}
	static class UWBP_AmmoPouch_TutorialModal2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_AmmoPouch_TutorialModal2_C>();
	}
};
static_assert(alignof(UWBP_AmmoPouch_TutorialModal2_C) == 0x000008, "Wrong alignment on UWBP_AmmoPouch_TutorialModal2_C");
static_assert(sizeof(UWBP_AmmoPouch_TutorialModal2_C) == 0x000300, "Wrong size on UWBP_AmmoPouch_TutorialModal2_C");
static_assert(offsetof(UWBP_AmmoPouch_TutorialModal2_C, UberGraphFrame) == 0x0002D0, "Member 'UWBP_AmmoPouch_TutorialModal2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_AmmoPouch_TutorialModal2_C, Image) == 0x0002D8, "Member 'UWBP_AmmoPouch_TutorialModal2_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_AmmoPouch_TutorialModal2_C, VALUI_RichTextBlock_Styled) == 0x0002E0, "Member 'UWBP_AmmoPouch_TutorialModal2_C::VALUI_RichTextBlock_Styled' has a wrong offset!");
static_assert(offsetof(UWBP_AmmoPouch_TutorialModal2_C, ButtonClicked) == 0x0002E8, "Member 'UWBP_AmmoPouch_TutorialModal2_C::ButtonClicked' has a wrong offset!");
static_assert(offsetof(UWBP_AmmoPouch_TutorialModal2_C, BinkPlayer) == 0x0002F8, "Member 'UWBP_AmmoPouch_TutorialModal2_C::BinkPlayer' has a wrong offset!");

}

