#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SettingsItem_Parent_DoNotEdit

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_SettingsItem_Parent_DoNotEdit.WBP_SettingsItem_Parent_DoNotEdit_C.OnSettingsItem_Hovered__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct WBP_SettingsItem_Parent_DoNotEdit_C_OnSettingsItem_Hovered__DelegateSignature final
{
public:
	class FText                                   Param_Name;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Description;                                       // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_SettingsItem_Parent_DoNotEdit_C_OnSettingsItem_Hovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SettingsItem_Parent_DoNotEdit_C_OnSettingsItem_Hovered__DelegateSignature");
static_assert(sizeof(WBP_SettingsItem_Parent_DoNotEdit_C_OnSettingsItem_Hovered__DelegateSignature) == 0x000030, "Wrong size on WBP_SettingsItem_Parent_DoNotEdit_C_OnSettingsItem_Hovered__DelegateSignature");
static_assert(offsetof(WBP_SettingsItem_Parent_DoNotEdit_C_OnSettingsItem_Hovered__DelegateSignature, Param_Name) == 0x000000, "Member 'WBP_SettingsItem_Parent_DoNotEdit_C_OnSettingsItem_Hovered__DelegateSignature::Param_Name' has a wrong offset!");
static_assert(offsetof(WBP_SettingsItem_Parent_DoNotEdit_C_OnSettingsItem_Hovered__DelegateSignature, Description) == 0x000018, "Member 'WBP_SettingsItem_Parent_DoNotEdit_C_OnSettingsItem_Hovered__DelegateSignature::Description' has a wrong offset!");

// Function WBP_SettingsItem_Parent_DoNotEdit.WBP_SettingsItem_Parent_DoNotEdit_C.ExecuteUbergraph_WBP_SettingsItem_Parent_DoNotEdit
// 0x0004 (0x0004 - 0x0000)
struct WBP_SettingsItem_Parent_DoNotEdit_C_ExecuteUbergraph_WBP_SettingsItem_Parent_DoNotEdit final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsItem_Parent_DoNotEdit_C_ExecuteUbergraph_WBP_SettingsItem_Parent_DoNotEdit) == 0x000004, "Wrong alignment on WBP_SettingsItem_Parent_DoNotEdit_C_ExecuteUbergraph_WBP_SettingsItem_Parent_DoNotEdit");
static_assert(sizeof(WBP_SettingsItem_Parent_DoNotEdit_C_ExecuteUbergraph_WBP_SettingsItem_Parent_DoNotEdit) == 0x000004, "Wrong size on WBP_SettingsItem_Parent_DoNotEdit_C_ExecuteUbergraph_WBP_SettingsItem_Parent_DoNotEdit");
static_assert(offsetof(WBP_SettingsItem_Parent_DoNotEdit_C_ExecuteUbergraph_WBP_SettingsItem_Parent_DoNotEdit, EntryPoint) == 0x000000, "Member 'WBP_SettingsItem_Parent_DoNotEdit_C_ExecuteUbergraph_WBP_SettingsItem_Parent_DoNotEdit::EntryPoint' has a wrong offset!");

}

