#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterCreationScreen_CM

#include "Basic.hpp"

#include "ValeriaDTOs_structs.hpp"
#include "F_GenericErrorModalPayload_structs.hpp"
#include "Palia_structs.hpp"
#include "ValeriaUI_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "OnlineSubsystemValeria_structs.hpp"
#include "EnhancedInput_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_CharacterCreationScreen_CM.WBP_CharacterCreationScreen_CM_C.BndEvt__WBP_CharacterCreationScreen_CM_CustomizationPanel_K2Node_ComponentBoundEvent_2_OnPrimaryTabSelectionChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_CustomizationPanel_K2Node_ComponentBoundEvent_2_OnPrimaryTabSelectionChanged__DelegateSignature final
{
public:
	class FName                                   TabId;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_CustomizationPanel_K2Node_ComponentBoundEvent_2_OnPrimaryTabSelectionChanged__DelegateSignature) == 0x000004, "Wrong alignment on WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_CustomizationPanel_K2Node_ComponentBoundEvent_2_OnPrimaryTabSelectionChanged__DelegateSignature");
static_assert(sizeof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_CustomizationPanel_K2Node_ComponentBoundEvent_2_OnPrimaryTabSelectionChanged__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_CustomizationPanel_K2Node_ComponentBoundEvent_2_OnPrimaryTabSelectionChanged__DelegateSignature");
static_assert(offsetof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_CustomizationPanel_K2Node_ComponentBoundEvent_2_OnPrimaryTabSelectionChanged__DelegateSignature, TabId) == 0x000000, "Member 'WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_CustomizationPanel_K2Node_ComponentBoundEvent_2_OnPrimaryTabSelectionChanged__DelegateSignature::TabId' has a wrong offset!");

// Function WBP_CharacterCreationScreen_CM.WBP_CharacterCreationScreen_CM_C.BndEvt__WBP_CharacterCreationScreen_CM_CustomizationPanel_K2Node_ComponentBoundEvent_5_OnLoadoutUpdated__DelegateSignature
// 0x0068 (0x0068 - 0x0000)
struct WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_CustomizationPanel_K2Node_ComponentBoundEvent_5_OnLoadoutUpdated__DelegateSignature final
{
public:
	struct FVALUI_CharCustomization_UpdateLoadoutContextPayload Context_Payload;                                   // 0x0000(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_CustomizationPanel_K2Node_ComponentBoundEvent_5_OnLoadoutUpdated__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_CustomizationPanel_K2Node_ComponentBoundEvent_5_OnLoadoutUpdated__DelegateSignature");
static_assert(sizeof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_CustomizationPanel_K2Node_ComponentBoundEvent_5_OnLoadoutUpdated__DelegateSignature) == 0x000068, "Wrong size on WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_CustomizationPanel_K2Node_ComponentBoundEvent_5_OnLoadoutUpdated__DelegateSignature");
static_assert(offsetof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_CustomizationPanel_K2Node_ComponentBoundEvent_5_OnLoadoutUpdated__DelegateSignature, Context_Payload) == 0x000000, "Member 'WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_CustomizationPanel_K2Node_ComponentBoundEvent_5_OnLoadoutUpdated__DelegateSignature::Context_Payload' has a wrong offset!");

// Function WBP_CharacterCreationScreen_CM.WBP_CharacterCreationScreen_CM_C.BndEvt__WBP_CharacterCreationScreen_CM_WBP_BodyTypeSelectScreen_CM_K2Node_ComponentBoundEvent_13_OnBodyTypeButtonSelected__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_BodyTypeSelectScreen_CM_K2Node_ComponentBoundEvent_13_OnBodyTypeButtonSelected__DelegateSignature final
{
public:
	EVAL_CharacterBodyType                        BodyTypeClicked;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FirstClick;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_BodyTypeSelectScreen_CM_K2Node_ComponentBoundEvent_13_OnBodyTypeButtonSelected__DelegateSignature) == 0x000001, "Wrong alignment on WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_BodyTypeSelectScreen_CM_K2Node_ComponentBoundEvent_13_OnBodyTypeButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_BodyTypeSelectScreen_CM_K2Node_ComponentBoundEvent_13_OnBodyTypeButtonSelected__DelegateSignature) == 0x000002, "Wrong size on WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_BodyTypeSelectScreen_CM_K2Node_ComponentBoundEvent_13_OnBodyTypeButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_BodyTypeSelectScreen_CM_K2Node_ComponentBoundEvent_13_OnBodyTypeButtonSelected__DelegateSignature, BodyTypeClicked) == 0x000000, "Member 'WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_BodyTypeSelectScreen_CM_K2Node_ComponentBoundEvent_13_OnBodyTypeButtonSelected__DelegateSignature::BodyTypeClicked' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_BodyTypeSelectScreen_CM_K2Node_ComponentBoundEvent_13_OnBodyTypeButtonSelected__DelegateSignature, FirstClick) == 0x000001, "Member 'WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_BodyTypeSelectScreen_CM_K2Node_ComponentBoundEvent_13_OnBodyTypeButtonSelected__DelegateSignature::FirstClick' has a wrong offset!");

// Function WBP_CharacterCreationScreen_CM.WBP_CharacterCreationScreen_CM_C.BndEvt__WBP_CharacterCreationScreen_CM_WBP_BodyTypeSelectScreen_CM_K2Node_ComponentBoundEvent_1_OnContinueClicked__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_BodyTypeSelectScreen_CM_K2Node_ComponentBoundEvent_1_OnContinueClicked__DelegateSignature final
{
public:
	EVAL_CharacterBodyType                        Selected_Body_Type;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_BodyTypeSelectScreen_CM_K2Node_ComponentBoundEvent_1_OnContinueClicked__DelegateSignature) == 0x000001, "Wrong alignment on WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_BodyTypeSelectScreen_CM_K2Node_ComponentBoundEvent_1_OnContinueClicked__DelegateSignature");
static_assert(sizeof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_BodyTypeSelectScreen_CM_K2Node_ComponentBoundEvent_1_OnContinueClicked__DelegateSignature) == 0x000001, "Wrong size on WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_BodyTypeSelectScreen_CM_K2Node_ComponentBoundEvent_1_OnContinueClicked__DelegateSignature");
static_assert(offsetof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_BodyTypeSelectScreen_CM_K2Node_ComponentBoundEvent_1_OnContinueClicked__DelegateSignature, Selected_Body_Type) == 0x000000, "Member 'WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_BodyTypeSelectScreen_CM_K2Node_ComponentBoundEvent_1_OnContinueClicked__DelegateSignature::Selected_Body_Type' has a wrong offset!");

// Function WBP_CharacterCreationScreen_CM.WBP_CharacterCreationScreen_CM_C.BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterCreationPanel_CM_K2Node_ComponentBoundEvent_21_OnEmoteBarClicked__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterCreationPanel_CM_K2Node_ComponentBoundEvent_21_OnEmoteBarClicked__DelegateSignature final
{
public:
	class UVALUI_EmoteButtonContainer*            Container;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVALUI_EmoteButton*                     ButtonClicked;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UEmoteDataAsset*                        EmoteDataAsset;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterCreationPanel_CM_K2Node_ComponentBoundEvent_21_OnEmoteBarClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterCreationPanel_CM_K2Node_ComponentBoundEvent_21_OnEmoteBarClicked__DelegateSignature");
static_assert(sizeof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterCreationPanel_CM_K2Node_ComponentBoundEvent_21_OnEmoteBarClicked__DelegateSignature) == 0x000018, "Wrong size on WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterCreationPanel_CM_K2Node_ComponentBoundEvent_21_OnEmoteBarClicked__DelegateSignature");
static_assert(offsetof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterCreationPanel_CM_K2Node_ComponentBoundEvent_21_OnEmoteBarClicked__DelegateSignature, Container) == 0x000000, "Member 'WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterCreationPanel_CM_K2Node_ComponentBoundEvent_21_OnEmoteBarClicked__DelegateSignature::Container' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterCreationPanel_CM_K2Node_ComponentBoundEvent_21_OnEmoteBarClicked__DelegateSignature, ButtonClicked) == 0x000008, "Member 'WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterCreationPanel_CM_K2Node_ComponentBoundEvent_21_OnEmoteBarClicked__DelegateSignature::ButtonClicked' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterCreationPanel_CM_K2Node_ComponentBoundEvent_21_OnEmoteBarClicked__DelegateSignature, EmoteDataAsset) == 0x000010, "Member 'WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterCreationPanel_CM_K2Node_ComponentBoundEvent_21_OnEmoteBarClicked__DelegateSignature::EmoteDataAsset' has a wrong offset!");

// Function WBP_CharacterCreationScreen_CM.WBP_CharacterCreationScreen_CM_C.BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterNameSelection_CM_K2Node_ComponentBoundEvent_12_OnPreferredNameChaged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterNameSelection_CM_K2Node_ComponentBoundEvent_12_OnPreferredNameChaged__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	EVAL_CharacterNameType                        Type;                                              // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Commit;                                         // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterNameSelection_CM_K2Node_ComponentBoundEvent_12_OnPreferredNameChaged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterNameSelection_CM_K2Node_ComponentBoundEvent_12_OnPreferredNameChaged__DelegateSignature");
static_assert(sizeof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterNameSelection_CM_K2Node_ComponentBoundEvent_12_OnPreferredNameChaged__DelegateSignature) == 0x000020, "Wrong size on WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterNameSelection_CM_K2Node_ComponentBoundEvent_12_OnPreferredNameChaged__DelegateSignature");
static_assert(offsetof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterNameSelection_CM_K2Node_ComponentBoundEvent_12_OnPreferredNameChaged__DelegateSignature, Text) == 0x000000, "Member 'WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterNameSelection_CM_K2Node_ComponentBoundEvent_12_OnPreferredNameChaged__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterNameSelection_CM_K2Node_ComponentBoundEvent_12_OnPreferredNameChaged__DelegateSignature, Type) == 0x000018, "Member 'WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterNameSelection_CM_K2Node_ComponentBoundEvent_12_OnPreferredNameChaged__DelegateSignature::Type' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterNameSelection_CM_K2Node_ComponentBoundEvent_12_OnPreferredNameChaged__DelegateSignature, Is_Commit) == 0x000019, "Member 'WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterNameSelection_CM_K2Node_ComponentBoundEvent_12_OnPreferredNameChaged__DelegateSignature::Is_Commit' has a wrong offset!");

// Function WBP_CharacterCreationScreen_CM.WBP_CharacterCreationScreen_CM_C.BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterNameSelection_CM_K2Node_ComponentBoundEvent_4_OnFullNameChanged__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterNameSelection_CM_K2Node_ComponentBoundEvent_4_OnFullNameChanged__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	EVAL_CharacterNameType                        Type;                                              // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Commit;                                         // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterNameSelection_CM_K2Node_ComponentBoundEvent_4_OnFullNameChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterNameSelection_CM_K2Node_ComponentBoundEvent_4_OnFullNameChanged__DelegateSignature");
static_assert(sizeof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterNameSelection_CM_K2Node_ComponentBoundEvent_4_OnFullNameChanged__DelegateSignature) == 0x000020, "Wrong size on WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterNameSelection_CM_K2Node_ComponentBoundEvent_4_OnFullNameChanged__DelegateSignature");
static_assert(offsetof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterNameSelection_CM_K2Node_ComponentBoundEvent_4_OnFullNameChanged__DelegateSignature, Text) == 0x000000, "Member 'WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterNameSelection_CM_K2Node_ComponentBoundEvent_4_OnFullNameChanged__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterNameSelection_CM_K2Node_ComponentBoundEvent_4_OnFullNameChanged__DelegateSignature, Type) == 0x000018, "Member 'WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterNameSelection_CM_K2Node_ComponentBoundEvent_4_OnFullNameChanged__DelegateSignature::Type' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterNameSelection_CM_K2Node_ComponentBoundEvent_4_OnFullNameChanged__DelegateSignature, Is_Commit) == 0x000019, "Member 'WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_CharacterNameSelection_CM_K2Node_ComponentBoundEvent_4_OnFullNameChanged__DelegateSignature::Is_Commit' has a wrong offset!");

// Function WBP_CharacterCreationScreen_CM.WBP_CharacterCreationScreen_CM_C.BndEvt__WBP_CharacterCreationScreen_CM_WBP_Turntable_K2Node_ComponentBoundEvent_8_OnMouseDragged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_Turntable_K2Node_ComponentBoundEvent_8_OnMouseDragged__DelegateSignature final
{
public:
	struct FRotator                               Rotation;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_Turntable_K2Node_ComponentBoundEvent_8_OnMouseDragged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_Turntable_K2Node_ComponentBoundEvent_8_OnMouseDragged__DelegateSignature");
static_assert(sizeof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_Turntable_K2Node_ComponentBoundEvent_8_OnMouseDragged__DelegateSignature) == 0x000018, "Wrong size on WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_Turntable_K2Node_ComponentBoundEvent_8_OnMouseDragged__DelegateSignature");
static_assert(offsetof(WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_Turntable_K2Node_ComponentBoundEvent_8_OnMouseDragged__DelegateSignature, Rotation) == 0x000000, "Member 'WBP_CharacterCreationScreen_CM_C_BndEvt__WBP_CharacterCreationScreen_CM_WBP_Turntable_K2Node_ComponentBoundEvent_8_OnMouseDragged__DelegateSignature::Rotation' has a wrong offset!");

// Function WBP_CharacterCreationScreen_CM.WBP_CharacterCreationScreen_CM_C.BP_OnHandleBackAction
// 0x0018 (0x0018 - 0x0000)
struct WBP_CharacterCreationScreen_CM_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41C0[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCreationScreen_CM_C_BP_OnHandleBackAction) == 0x000008, "Wrong alignment on WBP_CharacterCreationScreen_CM_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_CharacterCreationScreen_CM_C_BP_OnHandleBackAction) == 0x000018, "Wrong size on WBP_CharacterCreationScreen_CM_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_CharacterCreationScreen_CM_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_CharacterCreationScreen_CM_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreationScreen_CM_C_BP_OnHandleBackAction, CallFunc_GetActiveWidget_ReturnValue) == 0x000008, "Member 'WBP_CharacterCreationScreen_CM_C_BP_OnHandleBackAction::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreationScreen_CM_C_BP_OnHandleBackAction, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000010, "Member 'WBP_CharacterCreationScreen_CM_C_BP_OnHandleBackAction::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreationScreen_CM_C_BP_OnHandleBackAction, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000011, "Member 'WBP_CharacterCreationScreen_CM_C_BP_OnHandleBackAction::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");

// Function WBP_CharacterCreationScreen_CM.WBP_CharacterCreationScreen_CM_C.ClearNamingText
// 0x0001 (0x0001 - 0x0000)
struct WBP_CharacterCreationScreen_CM_C_ClearNamingText final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCreationScreen_CM_C_ClearNamingText) == 0x000001, "Wrong alignment on WBP_CharacterCreationScreen_CM_C_ClearNamingText");
static_assert(sizeof(WBP_CharacterCreationScreen_CM_C_ClearNamingText) == 0x000001, "Wrong size on WBP_CharacterCreationScreen_CM_C_ClearNamingText");
static_assert(offsetof(WBP_CharacterCreationScreen_CM_C_ClearNamingText, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'WBP_CharacterCreationScreen_CM_C_ClearNamingText::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_CharacterCreationScreen_CM.WBP_CharacterCreationScreen_CM_C.Completed_06AE7FA341D3C46278A450AD1A0AB37A
// 0x0070 (0x0070 - 0x0000)
struct WBP_CharacterCreationScreen_CM_C_Completed_06AE7FA341D3C46278A450AD1A0AB37A final
{
public:
	class UVALUI_CharacterCustomizationPanelBase* CharacterCustomizationPanel;                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVALUI_CharCustomization_UpdateLoadoutContextPayload ContextPayload;                                    // 0x0008(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CharacterCreationScreen_CM_C_Completed_06AE7FA341D3C46278A450AD1A0AB37A) == 0x000008, "Wrong alignment on WBP_CharacterCreationScreen_CM_C_Completed_06AE7FA341D3C46278A450AD1A0AB37A");
static_assert(sizeof(WBP_CharacterCreationScreen_CM_C_Completed_06AE7FA341D3C46278A450AD1A0AB37A) == 0x000070, "Wrong size on WBP_CharacterCreationScreen_CM_C_Completed_06AE7FA341D3C46278A450AD1A0AB37A");
static_assert(offsetof(WBP_CharacterCreationScreen_CM_C_Completed_06AE7FA341D3C46278A450AD1A0AB37A, CharacterCustomizationPanel) == 0x000000, "Member 'WBP_CharacterCreationScreen_CM_C_Completed_06AE7FA341D3C46278A450AD1A0AB37A::CharacterCustomizationPanel' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreationScreen_CM_C_Completed_06AE7FA341D3C46278A450AD1A0AB37A, ContextPayload) == 0x000008, "Member 'WBP_CharacterCreationScreen_CM_C_Completed_06AE7FA341D3C46278A450AD1A0AB37A::ContextPayload' has a wrong offset!");

// Function WBP_CharacterCreationScreen_CM.WBP_CharacterCreationScreen_CM_C.Completed_0FBCDC9943CB89AE8344869673D64225
// 0x0900 (0x0900 - 0x0000)
struct WBP_CharacterCreationScreen_CM_C_Completed_0FBCDC9943CB89AE8344869673D64225 final
{
public:
	struct FVAL_CharacterCustomizationLoadout     Loadout;                                           // 0x0000(0x0900)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_CharacterCreationScreen_CM_C_Completed_0FBCDC9943CB89AE8344869673D64225) == 0x000008, "Wrong alignment on WBP_CharacterCreationScreen_CM_C_Completed_0FBCDC9943CB89AE8344869673D64225");
static_assert(sizeof(WBP_CharacterCreationScreen_CM_C_Completed_0FBCDC9943CB89AE8344869673D64225) == 0x000900, "Wrong size on WBP_CharacterCreationScreen_CM_C_Completed_0FBCDC9943CB89AE8344869673D64225");
static_assert(offsetof(WBP_CharacterCreationScreen_CM_C_Completed_0FBCDC9943CB89AE8344869673D64225, Loadout) == 0x000000, "Member 'WBP_CharacterCreationScreen_CM_C_Completed_0FBCDC9943CB89AE8344869673D64225::Loadout' has a wrong offset!");

// Function WBP_CharacterCreationScreen_CM.WBP_CharacterCreationScreen_CM_C.Completed_561810214BA0BEF8298BB2AFF76C88DB
// 0x0070 (0x0070 - 0x0000)
struct WBP_CharacterCreationScreen_CM_C_Completed_561810214BA0BEF8298BB2AFF76C88DB final
{
public:
	class UVALUI_CharacterCustomizationPanelBase* CharacterCustomizationPanel;                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVALUI_CharCustomization_UpdateLoadoutContextPayload ContextPayload;                                    // 0x0008(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_CharacterCreationScreen_CM_C_Completed_561810214BA0BEF8298BB2AFF76C88DB) == 0x000008, "Wrong alignment on WBP_CharacterCreationScreen_CM_C_Completed_561810214BA0BEF8298BB2AFF76C88DB");
static_assert(sizeof(WBP_CharacterCreationScreen_CM_C_Completed_561810214BA0BEF8298BB2AFF76C88DB) == 0x000070, "Wrong size on WBP_CharacterCreationScreen_CM_C_Completed_561810214BA0BEF8298BB2AFF76C88DB");
static_assert(offsetof(WBP_CharacterCreationScreen_CM_C_Completed_561810214BA0BEF8298BB2AFF76C88DB, CharacterCustomizationPanel) == 0x000000, "Member 'WBP_CharacterCreationScreen_CM_C_Completed_561810214BA0BEF8298BB2AFF76C88DB::CharacterCustomizationPanel' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreationScreen_CM_C_Completed_561810214BA0BEF8298BB2AFF76C88DB, ContextPayload) == 0x000008, "Member 'WBP_CharacterCreationScreen_CM_C_Completed_561810214BA0BEF8298BB2AFF76C88DB::ContextPayload' has a wrong offset!");

// Function WBP_CharacterCreationScreen_CM.WBP_CharacterCreationScreen_CM_C.DisplayConfirmWindow
// 0x0038 (0x0038 - 0x0000)
struct WBP_CharacterCreationScreen_CM_C_DisplayConfirmWindow final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_CharacterCreationConfirmationWindow_CM_C* CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCreationScreen_CM_C_DisplayConfirmWindow) == 0x000008, "Wrong alignment on WBP_CharacterCreationScreen_CM_C_DisplayConfirmWindow");
static_assert(sizeof(WBP_CharacterCreationScreen_CM_C_DisplayConfirmWindow) == 0x000038, "Wrong size on WBP_CharacterCreationScreen_CM_C_DisplayConfirmWindow");
static_assert(offsetof(WBP_CharacterCreationScreen_CM_C_DisplayConfirmWindow, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_CharacterCreationScreen_CM_C_DisplayConfirmWindow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreationScreen_CM_C_DisplayConfirmWindow, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'WBP_CharacterCreationScreen_CM_C_DisplayConfirmWindow::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreationScreen_CM_C_DisplayConfirmWindow, CallFunc_GetOwningPlayer_ReturnValue) == 0x000020, "Member 'WBP_CharacterCreationScreen_CM_C_DisplayConfirmWindow::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreationScreen_CM_C_DisplayConfirmWindow, CallFunc_Create_ReturnValue) == 0x000028, "Member 'WBP_CharacterCreationScreen_CM_C_DisplayConfirmWindow::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCreationScreen_CM_C_DisplayConfirmWindow, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000030, "Member 'WBP_CharacterCreationScreen_CM_C_DisplayConfirmWindow::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function WBP_CharacterCreationScreen_CM.WBP_CharacterCreationScreen_CM_C.ExecuteUbergraph_WBP_CharacterCreationScreen_CM
// 0x56C0 (0x56C0 - 0x0000)
struct WBP_CharacterCreationScreen_CM_C_ExecuteUbergraph_WBP_CharacterCreationScreen_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41C1[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_CharacterCustomizationPanelBase* K2Node_CustomEvent_CharacterCustomizationPanel;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVALUI_CharCustomization_UpdateLoadoutContextPayload K2Node_CustomEvent_ContextPayload;                 // 0x0010(0x0068)(ConstParm)
	struct FVALUI_CharCustomization_UpdateLoadoutContextPayload Temp_struct_Variable;                              // 0x0078(0x0068)()
	class UVALUI_CharacterCustomizationPanelBase* Temp_object_Variable;                              // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVALUI_CharCustomization_UpdateLoadoutContextPayload K2Node_MakeStruct_VALUI_CharCustomization_UpdateLoadoutContextPayload; // 0x00E8(0x0068)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0150(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0160(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0170(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0178(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x01A0(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_1;                            // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue; // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x01E0(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0208(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue_1; // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_2;                            // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3;                              // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4_0;                            // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41C2[0x3];                                     // 0x0249(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FOSSVAL_ProfanityFilterResponse& Response)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x024C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41C3[0x4];                                     // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetCharacter_ReturnValue;                 // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FOSSVAL_ProfanityFilterResponse        K2Node_CustomEvent_Response_4;                     // 0x0268(0x0018)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41C4[0x6];                                     // 0x0282(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOSSVAL_ProfanityFilterResponse        Temp_struct_Variable_1;                            // 0x0288(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41C5[0x3];                                     // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FOSSVAL_ProfanityFilterResponse& Response)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x02A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41C6[0x4];                                     // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOSSVAL_ProfanityFilterResponse        K2Node_CustomEvent_Response_3;                     // 0x02B8(0x0018)(ConstParm)
	struct FOSSVAL_ProfanityFilterResponse        Temp_struct_Variable_2;                            // 0x02D0(0x0018)()
	TDelegate<void(const struct FOSSVAL_RegisterCharacterResponse& Response)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x02E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FOSSVAL_RegisterCharacterResponse      K2Node_CustomEvent_Response_2;                     // 0x02F8(0x0798)()
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0A90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41C7[0x3];                                     // 0x0A91(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FOSSVAL_RegisterCharacterResponse& Response)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0A94(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41C8[0x4];                                     // 0x0AA4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOSSVAL_RegisterCharacterResponse      K2Node_CustomEvent_Response_1;                     // 0x0AA8(0x0798)()
	struct FOSSVAL_RegisterCharacterResponse      K2Node_CustomEvent_Response;                       // 0x1240(0x0798)()
	TDelegate<void(const struct FOSSVAL_RegisterCharacterResponse& Response)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x19D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FOSSVAL_RegisterCharacterResponse      Temp_struct_Variable_3;                            // 0x19E8(0x0798)()
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x2180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x2188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x2190(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_3;                            // 0x21A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_CharacterCustomizationLoadoutPreset* K2Node_DynamicCast_AsVAL_Character_Customization_Loadout_Preset; // 0x21A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x21B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41C9[0x3];                                     // 0x21B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x21B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVALDTOS_MetaCharacterFormat           CallFunc_GetMetaCharacterData_ReturnValue;         // 0x21B8(0x0778)()
	struct FVALUI_CharacterNameValidityResponse   K2Node_Event_Response;                             // 0x2930(0x0018)(ConstParm)
	struct FVALDTOS_MetaCharacterFormat           K2Node_Copy_ReturnValue;                           // 0x2948(0x0778)()
	EVAL_CharacterBodyType                        K2Node_CustomEvent_BodyType;                       // 0x30C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41CA[0x7];                                     // 0x30C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<TSoftObjectPtr<class UVAL_CharacterCustomizationItemBase>> CallFunc_GetAllowedCustomizationItems_ReturnValue; // 0x30C8(0x0050)()
	class UVAL_AsyncActionCreateRandomLoadoutFromItems* CallFunc_CreateRandomLoadoutFromItems_ReturnValue; // 0x3118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x3120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x3121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41CB[0x2];                                     // 0x3122(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UVALUI_CharacterCustomizationPanelBase* CharacterCustomizationPanel, struct FVALUI_CharCustomization_UpdateLoadoutContextPayload& ContextPayload)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x3124(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41CC[0x4];                                     // 0x3134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x3138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVALUI_CharCustomization_UpdateLoadoutContextPayload K2Node_CustomEvent_ContextPayload_1;               // 0x3140(0x0068)(ConstParm)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x31A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41CD[0x3];                                     // 0x31A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FVALUI_CharCustomization_UpdateLoadoutContextPayload& ContextPayload)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x31AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41CE[0x4];                                     // 0x31BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVALUI_CharCustomization_UpdateLoadoutContextPayload K2Node_MakeStruct_VALUI_CharCustomization_UpdateLoadoutContextPayload_1; // 0x31C0(0x0068)()
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x3228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_2;              // 0x322C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVAL_CharacterBodyType                        K2Node_ComponentBoundEvent_Selected_Body_Type;     // 0x3230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVAL_CharacterBodyType                        K2Node_ComponentBoundEvent_BodyTypeClicked;        // 0x3231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_FirstClick;             // 0x3232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetConsoleVariableBoolValue_ReturnValue;  // 0x3233(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x3234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41CF[0x3];                                     // 0x3235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UVAL_CharacterCustomizationLoadoutPreset> CallFunc_GetRandomDefaultLoadout_Char_Cust_Loadout_Preset; // 0x3238(0x0028)(HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_3;              // 0x3260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41D0[0x4];                                     // 0x3264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_CharacterCustomizationLoadout     Temp_struct_Variable_4;                            // 0x3268(0x0900)()
	bool                                          K2Node_Event_bEnable_2;                            // 0x3B68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable_1;                            // 0x3B69(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41D1[0x6];                                     // 0x3B6A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetDesiredFocusTarget_ReturnValue;        // 0x3B70(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_ComponentBoundEvent_Rotation;               // 0x3B78(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x3B90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnable;                              // 0x3B91(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41D2[0x6];                                     // 0x3B92(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_ActionValue_1;                  // 0x3B98(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVAL_CharacterCustomizationLoadout     K2Node_CustomEvent_Loadout;                        // 0x3BA0(0x0900)()
	class UVALUI_CharacterCustomizationPanelBase* Temp_object_Variable_4;                            // 0x44A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVALUI_CharCustomization_UpdateLoadoutContextPayload Temp_struct_Variable_5;                            // 0x44A8(0x0068)()
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x4510(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x4518(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CustomEvent_ActionValue;                    // 0x4520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x4528(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(const struct FVAL_CharacterCustomizationLoadout& Loadout)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x4540(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVALUI_CharacterCustomizationPanelBase* K2Node_CustomEvent_CharacterCustomizationPanel_1;  // 0x4550(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVALUI_CharCustomization_UpdateLoadoutContextPayload K2Node_CustomEvent_ContextPayload_2;               // 0x4558(0x0068)(ConstParm)
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue;         // 0x45C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue_1;       // 0x45C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UVALUI_CharacterCustomizationPanelBase* CharacterCustomizationPanel, struct FVALUI_CharCustomization_UpdateLoadoutContextPayload& ContextPayload)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x45D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULocalPlayer*                           CallFunc_GetOwningLocalPlayer_ReturnValue_2;       // 0x45E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_4;              // 0x45E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_12;           // 0x45EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41D3[0x4];                                     // 0x45FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVALUI_CharCustomization_UpdateLoadoutContextPayload K2Node_CustomEvent_ContextPayload_3;               // 0x4600(0x0068)(ConstParm)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x4668(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41D4[0x3];                                     // 0x4669(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FVALUI_CharCustomization_UpdateLoadoutContextPayload& ContextPayload)> K2Node_CreateDelegate_OutputDelegate_13;           // 0x466C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x467C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41D5[0x3];                                     // 0x467D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x4680(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_5;              // 0x4688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x468C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41D6[0x3];                                     // 0x468D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_1;            // 0x4690(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x4698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41D7[0x7];                                     // 0x4699(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAuthManager*                           CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x46A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_GetAccountId_ReturnValue;                 // 0x46A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text_1;                 // 0x46B8(0x0018)()
	EVAL_CharacterNameType                        K2Node_ComponentBoundEvent_Type_1;                 // 0x46D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Is_Commit_1;            // 0x46D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41D8[0x6];                                     // 0x46D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CommonUIButtonPromptItem_C*        CallFunc_GetPromptItemByIA_PromptItem;             // 0x46D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x46E0(0x0018)()
	EVAL_CharacterNameType                        K2Node_ComponentBoundEvent_Type;                   // 0x46F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Is_Commit;              // 0x46F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41D9[0x6];                                     // 0x46FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_EmoteButtonContainer*            K2Node_ComponentBoundEvent_Container;              // 0x4700(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVALUI_EmoteButton*                     K2Node_ComponentBoundEvent_ButtonClicked;          // 0x4708(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UEmoteDataAsset*                        K2Node_ComponentBoundEvent_EmoteDataAsset;         // 0x4710(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVALUI_AsyncUpdateLoadout*              CallFunc_UpdateLoadout_ReturnValue;                // 0x4718(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVALDTOS_CharacterCustomizationLoadout_PersistDTO_Volatile CallFunc_LoadoutToPersistenceDTO_Volatile_ReturnValue; // 0x4720(0x0480)()
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x4BA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41DA[0x7];                                     // 0x4BA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVALDTOS_CharacterCustomizationLoadout_PersistDTO_Stable CallFunc_LoadoutToPersistenceDTO_Stable_ReturnValue; // 0x4BA8(0x02B8)()
	struct FVALDTOS_MetaCharacterFormat           K2Node_SetFieldsInStruct_StructOut;                // 0x4E60(0x0778)()
	class UVAL_AsyncActionRegisterCharacterAndCacheRequest* CallFunc_RegisterCharacterAndCacheRequest_ReturnValue; // 0x55D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x55E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_CharacterCustomizationItem_Torso*  K2Node_DynamicCast_AsVAL_Character_Customization_Item_Torso; // 0x55E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x55F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41DB[0x7];                                     // 0x55F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetCameraActorForCosmeticAsset_ReturnValue; // 0x55F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x5600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x5601(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41DC[0x6];                                     // 0x5602(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOSSVAL_AsyncActionProfanityFilterString* CallFunc_FilterString_ReturnValue;                 // 0x5608(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UOSSVAL_AsyncActionProfanityFilterString* CallFunc_FilterString_ReturnValue_1;               // 0x5610(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x5618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x5619(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x561A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x561B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_GuidGuid_ReturnValue;            // 0x561C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41DD[0x3];                                     // 0x561D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
