#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GpPopup_PopupData

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_GpPopup_PopupData.WBP_GpPopup_PopupData_C.ExecuteUbergraph_WBP_GpPopup_PopupData
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_GpPopup_PopupData_C_ExecuteUbergraph_WBP_GpPopup_PopupData final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C53[0xB];                                     // 0x0005(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x0010(0x00D0)()
};
static_assert(alignof(WBP_GpPopup_PopupData_C_ExecuteUbergraph_WBP_GpPopup_PopupData) == 0x000010, "Wrong alignment on WBP_GpPopup_PopupData_C_ExecuteUbergraph_WBP_GpPopup_PopupData");
static_assert(sizeof(WBP_GpPopup_PopupData_C_ExecuteUbergraph_WBP_GpPopup_PopupData) == 0x0000E0, "Wrong size on WBP_GpPopup_PopupData_C_ExecuteUbergraph_WBP_GpPopup_PopupData");
static_assert(offsetof(WBP_GpPopup_PopupData_C_ExecuteUbergraph_WBP_GpPopup_PopupData, EntryPoint) == 0x000000, "Member 'WBP_GpPopup_PopupData_C_ExecuteUbergraph_WBP_GpPopup_PopupData::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_GpPopup_PopupData_C_ExecuteUbergraph_WBP_GpPopup_PopupData, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_GpPopup_PopupData_C_ExecuteUbergraph_WBP_GpPopup_PopupData::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_GpPopup_PopupData_C_ExecuteUbergraph_WBP_GpPopup_PopupData, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x000010, "Member 'WBP_GpPopup_PopupData_C_ExecuteUbergraph_WBP_GpPopup_PopupData::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");

// Function WBP_GpPopup_PopupData.WBP_GpPopup_PopupData_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_GpPopup_PopupData_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GpPopup_PopupData_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_GpPopup_PopupData_C_PreConstruct");
static_assert(sizeof(WBP_GpPopup_PopupData_C_PreConstruct) == 0x000001, "Wrong size on WBP_GpPopup_PopupData_C_PreConstruct");
static_assert(offsetof(WBP_GpPopup_PopupData_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_GpPopup_PopupData_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_GpPopup_PopupData.WBP_GpPopup_PopupData_C.SetPopupData
// 0x0140 (0x0140 - 0x0000)
struct WBP_GpPopup_PopupData_C_SetPopupData final
{
public:
	struct FPopupPageInfo                         PageData;                                          // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C54[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x0070(0x00D0)()
};
static_assert(alignof(WBP_GpPopup_PopupData_C_SetPopupData) == 0x000010, "Wrong alignment on WBP_GpPopup_PopupData_C_SetPopupData");
static_assert(sizeof(WBP_GpPopup_PopupData_C_SetPopupData) == 0x000140, "Wrong size on WBP_GpPopup_PopupData_C_SetPopupData");
static_assert(offsetof(WBP_GpPopup_PopupData_C_SetPopupData, PageData) == 0x000000, "Member 'WBP_GpPopup_PopupData_C_SetPopupData::PageData' has a wrong offset!");
static_assert(offsetof(WBP_GpPopup_PopupData_C_SetPopupData, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000058, "Member 'WBP_GpPopup_PopupData_C_SetPopupData::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GpPopup_PopupData_C_SetPopupData, K2Node_DynamicCast_AsTexture_2D) == 0x000060, "Member 'WBP_GpPopup_PopupData_C_SetPopupData::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_GpPopup_PopupData_C_SetPopupData, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WBP_GpPopup_PopupData_C_SetPopupData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GpPopup_PopupData_C_SetPopupData, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x000070, "Member 'WBP_GpPopup_PopupData_C_SetPopupData::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");

}

