#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FishingEncouragementEmoji

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_FishingEncouragementEmoji.WBP_FishingEncouragementEmoji_C.ExecuteUbergraph_WBP_FishingEncouragementEmoji
// 0x0038 (0x0038 - 0x0000)
struct WBP_FishingEncouragementEmoji_C_ExecuteUbergraph_WBP_FishingEncouragementEmoji final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C83[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C84[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_FishingEncouragementEmoji_C_ExecuteUbergraph_WBP_FishingEncouragementEmoji) == 0x000008, "Wrong alignment on WBP_FishingEncouragementEmoji_C_ExecuteUbergraph_WBP_FishingEncouragementEmoji");
static_assert(sizeof(WBP_FishingEncouragementEmoji_C_ExecuteUbergraph_WBP_FishingEncouragementEmoji) == 0x000038, "Wrong size on WBP_FishingEncouragementEmoji_C_ExecuteUbergraph_WBP_FishingEncouragementEmoji");
static_assert(offsetof(WBP_FishingEncouragementEmoji_C_ExecuteUbergraph_WBP_FishingEncouragementEmoji, EntryPoint) == 0x000000, "Member 'WBP_FishingEncouragementEmoji_C_ExecuteUbergraph_WBP_FishingEncouragementEmoji::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_FishingEncouragementEmoji_C_ExecuteUbergraph_WBP_FishingEncouragementEmoji, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'WBP_FishingEncouragementEmoji_C_ExecuteUbergraph_WBP_FishingEncouragementEmoji::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingEncouragementEmoji_C_ExecuteUbergraph_WBP_FishingEncouragementEmoji, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_FishingEncouragementEmoji_C_ExecuteUbergraph_WBP_FishingEncouragementEmoji::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingEncouragementEmoji_C_ExecuteUbergraph_WBP_FishingEncouragementEmoji, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'WBP_FishingEncouragementEmoji_C_ExecuteUbergraph_WBP_FishingEncouragementEmoji::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingEncouragementEmoji_C_ExecuteUbergraph_WBP_FishingEncouragementEmoji, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'WBP_FishingEncouragementEmoji_C_ExecuteUbergraph_WBP_FishingEncouragementEmoji::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingEncouragementEmoji_C_ExecuteUbergraph_WBP_FishingEncouragementEmoji, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000024, "Member 'WBP_FishingEncouragementEmoji_C_ExecuteUbergraph_WBP_FishingEncouragementEmoji::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_FishingEncouragementEmoji_C_ExecuteUbergraph_WBP_FishingEncouragementEmoji, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_FishingEncouragementEmoji_C_ExecuteUbergraph_WBP_FishingEncouragementEmoji::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_FishingEncouragementEmoji_C_ExecuteUbergraph_WBP_FishingEncouragementEmoji, CallFunc_Delay_Duration_ImplicitCast) == 0x000030, "Member 'WBP_FishingEncouragementEmoji_C_ExecuteUbergraph_WBP_FishingEncouragementEmoji::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

}

