#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CarouselPageButton_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "S6UICommonWidgets_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CarouselPageButton_CM.WBP_CarouselPageButton_CM_C
// 0x0030 (0x15A0 - 0x1570)
class UWBP_CarouselPageButton_CM_C final : public US6UI_CommonButton_Styled
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1570(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	FMulticastInlineDelegateProperty_             OnClicked;                                         // 0x1578(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UClass*                                 ButtonStyle_Unselected;                            // 0x1588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ButtonStyle_Selected;                              // 0x1590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         PageIndex;                                         // 0x1598(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BP_OnClicked();
	void BP_OnHovered();
	void ExecuteUbergraph_WBP_CarouselPageButton_CM(int32 EntryPoint, int32 CallFunc_AkEventGlobal_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue_1);
	void OnClicked__DelegateSignature(class UWBP_CarouselPageButton_CM_C* TutorialPageButton);
	void SetIsSeclected(bool Value, bool Temp_bool_Variable, class UClass* K2Node_Select_Default);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CarouselPageButton_CM_C">();
	}
	static class UWBP_CarouselPageButton_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CarouselPageButton_CM_C>();
	}
};
static_assert(alignof(UWBP_CarouselPageButton_CM_C) == 0x000010, "Wrong alignment on UWBP_CarouselPageButton_CM_C");
static_assert(sizeof(UWBP_CarouselPageButton_CM_C) == 0x0015A0, "Wrong size on UWBP_CarouselPageButton_CM_C");
static_assert(offsetof(UWBP_CarouselPageButton_CM_C, UberGraphFrame) == 0x001570, "Member 'UWBP_CarouselPageButton_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CarouselPageButton_CM_C, OnClicked) == 0x001578, "Member 'UWBP_CarouselPageButton_CM_C::OnClicked' has a wrong offset!");
static_assert(offsetof(UWBP_CarouselPageButton_CM_C, ButtonStyle_Unselected) == 0x001588, "Member 'UWBP_CarouselPageButton_CM_C::ButtonStyle_Unselected' has a wrong offset!");
static_assert(offsetof(UWBP_CarouselPageButton_CM_C, ButtonStyle_Selected) == 0x001590, "Member 'UWBP_CarouselPageButton_CM_C::ButtonStyle_Selected' has a wrong offset!");
static_assert(offsetof(UWBP_CarouselPageButton_CM_C, PageIndex) == 0x001598, "Member 'UWBP_CarouselPageButton_CM_C::PageIndex' has a wrong offset!");

}

