#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterActionToolUse_Console

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Palia_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CharacterActionToolUse_Console.WBP_CharacterActionToolUse_Console_C
// 0x00F8 (0x03B8 - 0x02C0)
class UWBP_CharacterActionToolUse_Console_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeAndScale;                                      // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_Template_Button_CM_C*              Button_CM;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_UnequippedTool;                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Equip;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Unequipped;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ReleasedAnimation;                                 // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonInputActionWidget_C*         WBP_CommonInputActionWidget;                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemSlot_CM_C*                     WBP_ItemSlot_CM;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ToolBacker_CM_C*                   WBP_ToolBacker_CM;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ToolItem_CM_C*                     WBP_ToolItem_CM;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_ToolUse;                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FValeriaItem                           EquippedTool;                                      // 0x0320(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_             OnReleasedEvent;                                   // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> ToolUsed;                                          // 0x0390(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BndEvt__WBP_CharacterActionToolUse_Console_Button_CM_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void Construct();
	void ExecuteUbergraph_WBP_CharacterActionToolUse_Console(int32 EntryPoint, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate, class UInventoryComponent* K2Node_CustomEvent_Inventory, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, const struct FValeriaItem& CallFunc_GetEquippedItem_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult_1, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue_1, class UEquipmentComponent* CallFunc_GetEquipment_ReturnValue, class UPlayerInventoryComponent* CallFunc_GetInventory_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_1, class UEquipmentComponent* K2Node_CustomEvent_EquipmentComponent, const struct FEquipmentItem& K2Node_CustomEvent_Item, TDelegate<void(class UEquipmentComponent* EquipmentComponent, const struct FEquipmentItem& Item)> K2Node_CreateDelegate_OutputDelegate_1, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_ItemEquals_ReturnValue, TDelegate<void(class UInventoryComponent* Inventory)> K2Node_CreateDelegate_OutputDelegate_2, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, class UCommonButtonBase* K2Node_ComponentBoundEvent_Button);
	void HandleEquipmentChanged(class UEquipmentComponent* EquipmentComponent, const struct FEquipmentItem& Item);
	void HandleEquippedItemUpdate(bool CallFunc_SetTool_IsVisible, class UObject* CallFunc_LoadAsset_Blocking_ReturnValue, class UVAL_ItemTypeDefinitionAsset* K2Node_DynamicCast_AsItem_Type_Definition, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsValid_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue);
	void HandleOnChanged(class UInventoryComponent* Inventory);
	void OnReleasedEffect();
	void OnReleasedEvent__DelegateSignature();
	void UpdateCurrentEquipped(const struct FBagSlotLocation& InventorySlot, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, class UPlayerInventoryComponent* CallFunc_GetInventory_ReturnValue, const struct FValeriaItem& CallFunc_GetItemAt_ReturnValue, bool CallFunc_ItemEquals_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CharacterActionToolUse_Console_C">();
	}
	static class UWBP_CharacterActionToolUse_Console_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CharacterActionToolUse_Console_C>();
	}
};
static_assert(alignof(UWBP_CharacterActionToolUse_Console_C) == 0x000008, "Wrong alignment on UWBP_CharacterActionToolUse_Console_C");
static_assert(sizeof(UWBP_CharacterActionToolUse_Console_C) == 0x0003B8, "Wrong size on UWBP_CharacterActionToolUse_Console_C");
static_assert(offsetof(UWBP_CharacterActionToolUse_Console_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_CharacterActionToolUse_Console_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterActionToolUse_Console_C, FadeAndScale) == 0x0002C8, "Member 'UWBP_CharacterActionToolUse_Console_C::FadeAndScale' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterActionToolUse_Console_C, Button_CM) == 0x0002D0, "Member 'UWBP_CharacterActionToolUse_Console_C::Button_CM' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterActionToolUse_Console_C, Image_UnequippedTool) == 0x0002D8, "Member 'UWBP_CharacterActionToolUse_Console_C::Image_UnequippedTool' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterActionToolUse_Console_C, Overlay_Equip) == 0x0002E0, "Member 'UWBP_CharacterActionToolUse_Console_C::Overlay_Equip' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterActionToolUse_Console_C, Overlay_Unequipped) == 0x0002E8, "Member 'UWBP_CharacterActionToolUse_Console_C::Overlay_Unequipped' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterActionToolUse_Console_C, ReleasedAnimation) == 0x0002F0, "Member 'UWBP_CharacterActionToolUse_Console_C::ReleasedAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterActionToolUse_Console_C, WBP_CommonInputActionWidget) == 0x0002F8, "Member 'UWBP_CharacterActionToolUse_Console_C::WBP_CommonInputActionWidget' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterActionToolUse_Console_C, WBP_ItemSlot_CM) == 0x000300, "Member 'UWBP_CharacterActionToolUse_Console_C::WBP_ItemSlot_CM' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterActionToolUse_Console_C, WBP_ToolBacker_CM) == 0x000308, "Member 'UWBP_CharacterActionToolUse_Console_C::WBP_ToolBacker_CM' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterActionToolUse_Console_C, WBP_ToolItem_CM) == 0x000310, "Member 'UWBP_CharacterActionToolUse_Console_C::WBP_ToolItem_CM' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterActionToolUse_Console_C, WidgetSwitcher_ToolUse) == 0x000318, "Member 'UWBP_CharacterActionToolUse_Console_C::WidgetSwitcher_ToolUse' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterActionToolUse_Console_C, EquippedTool) == 0x000320, "Member 'UWBP_CharacterActionToolUse_Console_C::EquippedTool' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterActionToolUse_Console_C, OnReleasedEvent) == 0x000380, "Member 'UWBP_CharacterActionToolUse_Console_C::OnReleasedEvent' has a wrong offset!");
static_assert(offsetof(UWBP_CharacterActionToolUse_Console_C, ToolUsed) == 0x000390, "Member 'UWBP_CharacterActionToolUse_Console_C::ToolUsed' has a wrong offset!");

}

