#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Buffs

#include "Basic.hpp"

#include "Palia_structs.hpp"


namespace SDK::Params
{

// Function WBP_Buffs.WBP_Buffs_C.EvaulateVisibility
// 0x0003 (0x0003 - 0x0000)
struct WBP_Buffs_C_EvaulateVisibility final
{
public:
	bool                                          ValeriaIsVisible;                                  // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldBeVisible;                                   // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetShouldBeVisible_Visible;               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Buffs_C_EvaulateVisibility) == 0x000001, "Wrong alignment on WBP_Buffs_C_EvaulateVisibility");
static_assert(sizeof(WBP_Buffs_C_EvaulateVisibility) == 0x000003, "Wrong size on WBP_Buffs_C_EvaulateVisibility");
static_assert(offsetof(WBP_Buffs_C_EvaulateVisibility, ValeriaIsVisible) == 0x000000, "Member 'WBP_Buffs_C_EvaulateVisibility::ValeriaIsVisible' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_EvaulateVisibility, ShouldBeVisible) == 0x000001, "Member 'WBP_Buffs_C_EvaulateVisibility::ShouldBeVisible' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_EvaulateVisibility, CallFunc_GetShouldBeVisible_Visible) == 0x000002, "Member 'WBP_Buffs_C_EvaulateVisibility::CallFunc_GetShouldBeVisible_Visible' has a wrong offset!");

// Function WBP_Buffs.WBP_Buffs_C.ExecuteUbergraph_WBP_Buffs
// 0x0058 (0x0058 - 0x0000)
struct WBP_Buffs_C_ExecuteUbergraph_WBP_Buffs final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F09[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBuffComponent*                         K2Node_CustomEvent_buffs;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F0A[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBuffComponent*                         CallFunc_GetBuffs_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F0B[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UBuffComponent* Buffs)>  K2Node_CreateDelegate_OutputDelegate;              // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult_1;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F0C[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue_1;        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBuffComponent*                         CallFunc_GetBuffs_ReturnValue_1;                   // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldListenToChanges_Visible;            // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Buffs_C_ExecuteUbergraph_WBP_Buffs) == 0x000008, "Wrong alignment on WBP_Buffs_C_ExecuteUbergraph_WBP_Buffs");
static_assert(sizeof(WBP_Buffs_C_ExecuteUbergraph_WBP_Buffs) == 0x000058, "Wrong size on WBP_Buffs_C_ExecuteUbergraph_WBP_Buffs");
static_assert(offsetof(WBP_Buffs_C_ExecuteUbergraph_WBP_Buffs, EntryPoint) == 0x000000, "Member 'WBP_Buffs_C_ExecuteUbergraph_WBP_Buffs::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_ExecuteUbergraph_WBP_Buffs, K2Node_CustomEvent_buffs) == 0x000008, "Member 'WBP_Buffs_C_ExecuteUbergraph_WBP_Buffs::K2Node_CustomEvent_buffs' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_ExecuteUbergraph_WBP_Buffs, CallFunc_GetValeriaCharacter_OutResult) == 0x000010, "Member 'WBP_Buffs_C_ExecuteUbergraph_WBP_Buffs::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_ExecuteUbergraph_WBP_Buffs, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000018, "Member 'WBP_Buffs_C_ExecuteUbergraph_WBP_Buffs::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_ExecuteUbergraph_WBP_Buffs, CallFunc_GetBuffs_ReturnValue) == 0x000020, "Member 'WBP_Buffs_C_ExecuteUbergraph_WBP_Buffs::CallFunc_GetBuffs_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_ExecuteUbergraph_WBP_Buffs, K2Node_SwitchEnum_CmpSuccess) == 0x000028, "Member 'WBP_Buffs_C_ExecuteUbergraph_WBP_Buffs::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_ExecuteUbergraph_WBP_Buffs, K2Node_CreateDelegate_OutputDelegate) == 0x00002C, "Member 'WBP_Buffs_C_ExecuteUbergraph_WBP_Buffs::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_ExecuteUbergraph_WBP_Buffs, CallFunc_GetValeriaCharacter_OutResult_1) == 0x00003C, "Member 'WBP_Buffs_C_ExecuteUbergraph_WBP_Buffs::CallFunc_GetValeriaCharacter_OutResult_1' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_ExecuteUbergraph_WBP_Buffs, CallFunc_GetValeriaCharacter_ReturnValue_1) == 0x000040, "Member 'WBP_Buffs_C_ExecuteUbergraph_WBP_Buffs::CallFunc_GetValeriaCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_ExecuteUbergraph_WBP_Buffs, CallFunc_GetBuffs_ReturnValue_1) == 0x000048, "Member 'WBP_Buffs_C_ExecuteUbergraph_WBP_Buffs::CallFunc_GetBuffs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_ExecuteUbergraph_WBP_Buffs, K2Node_SwitchEnum_CmpSuccess_1) == 0x000050, "Member 'WBP_Buffs_C_ExecuteUbergraph_WBP_Buffs::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_ExecuteUbergraph_WBP_Buffs, CallFunc_ShouldListenToChanges_Visible) == 0x000051, "Member 'WBP_Buffs_C_ExecuteUbergraph_WBP_Buffs::CallFunc_ShouldListenToChanges_Visible' has a wrong offset!");

// Function WBP_Buffs.WBP_Buffs_C.GetShouldBeVisible
// 0x000C (0x000C - 0x0000)
struct WBP_Buffs_C_GetShouldBeVisible final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldListenToChanges_Visible;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F0D[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Buffs_C_GetShouldBeVisible) == 0x000004, "Wrong alignment on WBP_Buffs_C_GetShouldBeVisible");
static_assert(sizeof(WBP_Buffs_C_GetShouldBeVisible) == 0x00000C, "Wrong size on WBP_Buffs_C_GetShouldBeVisible");
static_assert(offsetof(WBP_Buffs_C_GetShouldBeVisible, Visible) == 0x000000, "Member 'WBP_Buffs_C_GetShouldBeVisible::Visible' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_GetShouldBeVisible, CallFunc_ShouldListenToChanges_Visible) == 0x000001, "Member 'WBP_Buffs_C_GetShouldBeVisible::CallFunc_ShouldListenToChanges_Visible' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_GetShouldBeVisible, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'WBP_Buffs_C_GetShouldBeVisible::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_GetShouldBeVisible, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Buffs_C_GetShouldBeVisible::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_GetShouldBeVisible, CallFunc_BooleanAND_ReturnValue) == 0x000009, "Member 'WBP_Buffs_C_GetShouldBeVisible::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_Buffs.WBP_Buffs_C.OnBuffChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_Buffs_C_OnBuffChanged final
{
public:
	class UBuffComponent*                         Buffs;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Buffs_C_OnBuffChanged) == 0x000008, "Wrong alignment on WBP_Buffs_C_OnBuffChanged");
static_assert(sizeof(WBP_Buffs_C_OnBuffChanged) == 0x000008, "Wrong size on WBP_Buffs_C_OnBuffChanged");
static_assert(offsetof(WBP_Buffs_C_OnBuffChanged, Buffs) == 0x000000, "Member 'WBP_Buffs_C_OnBuffChanged::Buffs' has a wrong offset!");

// Function WBP_Buffs.WBP_Buffs_C.ShouldListenToChanges
// 0x0007 (0x0007 - 0x0000)
struct WBP_Buffs_C_ShouldListenToChanges final
{
public:
	bool                                          Visible;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDebuggingOn__IsDebuggingOn;             // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Buffs_C_ShouldListenToChanges) == 0x000001, "Wrong alignment on WBP_Buffs_C_ShouldListenToChanges");
static_assert(sizeof(WBP_Buffs_C_ShouldListenToChanges) == 0x000007, "Wrong size on WBP_Buffs_C_ShouldListenToChanges");
static_assert(offsetof(WBP_Buffs_C_ShouldListenToChanges, Visible) == 0x000000, "Member 'WBP_Buffs_C_ShouldListenToChanges::Visible' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_ShouldListenToChanges, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x000001, "Member 'WBP_Buffs_C_ShouldListenToChanges::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_ShouldListenToChanges, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WBP_Buffs_C_ShouldListenToChanges::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_ShouldListenToChanges, CallFunc_IsDebuggingOn__IsDebuggingOn) == 0x000003, "Member 'WBP_Buffs_C_ShouldListenToChanges::CallFunc_IsDebuggingOn__IsDebuggingOn' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_ShouldListenToChanges, CallFunc_BooleanAND_ReturnValue) == 0x000004, "Member 'WBP_Buffs_C_ShouldListenToChanges::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_ShouldListenToChanges, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000005, "Member 'WBP_Buffs_C_ShouldListenToChanges::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_ShouldListenToChanges, CallFunc_BooleanOR_ReturnValue) == 0x000006, "Member 'WBP_Buffs_C_ShouldListenToChanges::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_Buffs.WBP_Buffs_C.UpdateBuffs
// 0x01C0 (0x01C0 - 0x0000)
struct WBP_Buffs_C_UpdateBuffs final
{
public:
	struct FBuffConfig                            BuffConfig;                                        // 0x0000(0x0098)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F0E[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ListItem_Buff_C*                    CallFunc_SpawnObject_ReturnValue;                  // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBuffActivation                        CallFunc_Array_Get_Item;                           // 0x00B0(0x0048)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F0F[0x3];                                     // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_FindBuffConfigById_OutResult;             // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F10[0x3];                                     // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBuffConfig                            CallFunc_FindBuffConfigById_ReturnValue;           // 0x0108(0x0098)()
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F11[0x7];                                     // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBuffComponent*                         CallFunc_GetBuffs_ReturnValue;                     // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Buffs_C_UpdateBuffs) == 0x000008, "Wrong alignment on WBP_Buffs_C_UpdateBuffs");
static_assert(sizeof(WBP_Buffs_C_UpdateBuffs) == 0x0001C0, "Wrong size on WBP_Buffs_C_UpdateBuffs");
static_assert(offsetof(WBP_Buffs_C_UpdateBuffs, BuffConfig) == 0x000000, "Member 'WBP_Buffs_C_UpdateBuffs::BuffConfig' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_UpdateBuffs, Temp_int_Array_Index_Variable) == 0x000098, "Member 'WBP_Buffs_C_UpdateBuffs::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_UpdateBuffs, CallFunc_SpawnObject_ReturnValue) == 0x0000A0, "Member 'WBP_Buffs_C_UpdateBuffs::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_UpdateBuffs, CallFunc_Array_Add_ReturnValue) == 0x0000A8, "Member 'WBP_Buffs_C_UpdateBuffs::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_UpdateBuffs, Temp_int_Loop_Counter_Variable) == 0x0000AC, "Member 'WBP_Buffs_C_UpdateBuffs::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_UpdateBuffs, CallFunc_Array_Get_Item) == 0x0000B0, "Member 'WBP_Buffs_C_UpdateBuffs::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_UpdateBuffs, CallFunc_Array_Length_ReturnValue) == 0x0000F8, "Member 'WBP_Buffs_C_UpdateBuffs::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_UpdateBuffs, CallFunc_Less_IntInt_ReturnValue) == 0x0000FC, "Member 'WBP_Buffs_C_UpdateBuffs::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_UpdateBuffs, CallFunc_Add_IntInt_ReturnValue) == 0x000100, "Member 'WBP_Buffs_C_UpdateBuffs::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_UpdateBuffs, CallFunc_FindBuffConfigById_OutResult) == 0x000104, "Member 'WBP_Buffs_C_UpdateBuffs::CallFunc_FindBuffConfigById_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_UpdateBuffs, CallFunc_FindBuffConfigById_ReturnValue) == 0x000108, "Member 'WBP_Buffs_C_UpdateBuffs::CallFunc_FindBuffConfigById_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_UpdateBuffs, CallFunc_GetValeriaCharacter_OutResult) == 0x0001A0, "Member 'WBP_Buffs_C_UpdateBuffs::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_UpdateBuffs, CallFunc_GetValeriaCharacter_ReturnValue) == 0x0001A8, "Member 'WBP_Buffs_C_UpdateBuffs::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_UpdateBuffs, CallFunc_GetBuffs_ReturnValue) == 0x0001B0, "Member 'WBP_Buffs_C_UpdateBuffs::CallFunc_GetBuffs_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_UpdateBuffs, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0001B8, "Member 'WBP_Buffs_C_UpdateBuffs::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_UpdateBuffs, K2Node_SwitchEnum_CmpSuccess) == 0x0001B9, "Member 'WBP_Buffs_C_UpdateBuffs::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Buffs_C_UpdateBuffs, K2Node_SwitchEnum_CmpSuccess_1) == 0x0001BA, "Member 'WBP_Buffs_C_UpdateBuffs::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

}

