#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Cooking_Minigame_Chopping_ProgressMarker

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_Cooking_Minigame_Chopping_ProgressMarker.WBP_Cooking_Minigame_Chopping_ProgressMarker_C.ExecuteUbergraph_WBP_Cooking_Minigame_Chopping_ProgressMarker
// 0x0004 (0x0004 - 0x0000)
struct WBP_Cooking_Minigame_Chopping_ProgressMarker_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping_ProgressMarker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Minigame_Chopping_ProgressMarker_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping_ProgressMarker) == 0x000004, "Wrong alignment on WBP_Cooking_Minigame_Chopping_ProgressMarker_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping_ProgressMarker");
static_assert(sizeof(WBP_Cooking_Minigame_Chopping_ProgressMarker_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping_ProgressMarker) == 0x000004, "Wrong size on WBP_Cooking_Minigame_Chopping_ProgressMarker_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping_ProgressMarker");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_ProgressMarker_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping_ProgressMarker, EntryPoint) == 0x000000, "Member 'WBP_Cooking_Minigame_Chopping_ProgressMarker_C_ExecuteUbergraph_WBP_Cooking_Minigame_Chopping_ProgressMarker::EntryPoint' has a wrong offset!");

// Function WBP_Cooking_Minigame_Chopping_ProgressMarker.WBP_Cooking_Minigame_Chopping_ProgressMarker_C.PlaySuccessfulHitAnimationFromDelay
// 0x0008 (0x0008 - 0x0000)
struct WBP_Cooking_Minigame_Chopping_ProgressMarker_C_PlaySuccessfulHitAnimationFromDelay final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Minigame_Chopping_ProgressMarker_C_PlaySuccessfulHitAnimationFromDelay) == 0x000008, "Wrong alignment on WBP_Cooking_Minigame_Chopping_ProgressMarker_C_PlaySuccessfulHitAnimationFromDelay");
static_assert(sizeof(WBP_Cooking_Minigame_Chopping_ProgressMarker_C_PlaySuccessfulHitAnimationFromDelay) == 0x000008, "Wrong size on WBP_Cooking_Minigame_Chopping_ProgressMarker_C_PlaySuccessfulHitAnimationFromDelay");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_ProgressMarker_C_PlaySuccessfulHitAnimationFromDelay, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'WBP_Cooking_Minigame_Chopping_ProgressMarker_C_PlaySuccessfulHitAnimationFromDelay::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_Cooking_Minigame_Chopping_ProgressMarker.WBP_Cooking_Minigame_Chopping_ProgressMarker_C.SuccessfulHit
// 0x0018 (0x0018 - 0x0000)
struct WBP_Cooking_Minigame_Chopping_ProgressMarker_C_SuccessfulHit final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Cooking_Minigame_Chopping_ProgressMarker_C_SuccessfulHit) == 0x000008, "Wrong alignment on WBP_Cooking_Minigame_Chopping_ProgressMarker_C_SuccessfulHit");
static_assert(sizeof(WBP_Cooking_Minigame_Chopping_ProgressMarker_C_SuccessfulHit) == 0x000018, "Wrong size on WBP_Cooking_Minigame_Chopping_ProgressMarker_C_SuccessfulHit");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_ProgressMarker_C_SuccessfulHit, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_Cooking_Minigame_Chopping_ProgressMarker_C_SuccessfulHit::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Cooking_Minigame_Chopping_ProgressMarker_C_SuccessfulHit, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000010, "Member 'WBP_Cooking_Minigame_Chopping_ProgressMarker_C_SuccessfulHit::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");

}

