#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DecoratedHeader

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DecoratedHeader.WBP_DecoratedHeader_C
// 0x0050 (0x0310 - 0x02C0)
class UWBP_DecoratedHeader_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Left;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Right;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TextBlock_Header;                                  // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   HeaderText;                                        // 0x02E0(0x0018)(Edit, BlueprintVisible)
	struct FLinearColor                           DecorationColor;                                   // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVALUI_TextBlockStyle*                  HeaderTextStyle;                                   // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_DecoratedHeader(int32 EntryPoint, bool K2Node_Event_IsDesignTime);
	void PreConstruct(bool IsDesignTime);
	void UpdateText(class FText Text);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DecoratedHeader_C">();
	}
	static class UWBP_DecoratedHeader_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DecoratedHeader_C>();
	}
};
static_assert(alignof(UWBP_DecoratedHeader_C) == 0x000008, "Wrong alignment on UWBP_DecoratedHeader_C");
static_assert(sizeof(UWBP_DecoratedHeader_C) == 0x000310, "Wrong size on UWBP_DecoratedHeader_C");
static_assert(offsetof(UWBP_DecoratedHeader_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_DecoratedHeader_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DecoratedHeader_C, Image_Left) == 0x0002C8, "Member 'UWBP_DecoratedHeader_C::Image_Left' has a wrong offset!");
static_assert(offsetof(UWBP_DecoratedHeader_C, Image_Right) == 0x0002D0, "Member 'UWBP_DecoratedHeader_C::Image_Right' has a wrong offset!");
static_assert(offsetof(UWBP_DecoratedHeader_C, TextBlock_Header) == 0x0002D8, "Member 'UWBP_DecoratedHeader_C::TextBlock_Header' has a wrong offset!");
static_assert(offsetof(UWBP_DecoratedHeader_C, HeaderText) == 0x0002E0, "Member 'UWBP_DecoratedHeader_C::HeaderText' has a wrong offset!");
static_assert(offsetof(UWBP_DecoratedHeader_C, DecorationColor) == 0x0002F8, "Member 'UWBP_DecoratedHeader_C::DecorationColor' has a wrong offset!");
static_assert(offsetof(UWBP_DecoratedHeader_C, HeaderTextStyle) == 0x000308, "Member 'UWBP_DecoratedHeader_C::HeaderTextStyle' has a wrong offset!");

}

