#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SettingsItem_Slider_CM

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "FSettingsItemSlider_structs.hpp"


namespace SDK::Params
{

// Function WBP_SettingsItem_Slider_CM.WBP_SettingsItem_Slider_CM_C.BndEvt__WBP_SettingsItem_Slider_CM_Button_Backer_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsItem_Slider_CM_C_BndEvt__WBP_SettingsItem_Slider_CM_Button_Backer_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsItem_Slider_CM_C_BndEvt__WBP_SettingsItem_Slider_CM_Button_Backer_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SettingsItem_Slider_CM_C_BndEvt__WBP_SettingsItem_Slider_CM_Button_Backer_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SettingsItem_Slider_CM_C_BndEvt__WBP_SettingsItem_Slider_CM_Button_Backer_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SettingsItem_Slider_CM_C_BndEvt__WBP_SettingsItem_Slider_CM_Button_Backer_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SettingsItem_Slider_CM_C_BndEvt__WBP_SettingsItem_Slider_CM_Button_Backer_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SettingsItem_Slider_CM_C_BndEvt__WBP_SettingsItem_Slider_CM_Button_Backer_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SettingsItem_Slider_CM.WBP_SettingsItem_Slider_CM_C.BndEvt__WBP_SettingsItem_Slider_CM_Button_Backer_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsItem_Slider_CM_C_BndEvt__WBP_SettingsItem_Slider_CM_Button_Backer_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsItem_Slider_CM_C_BndEvt__WBP_SettingsItem_Slider_CM_Button_Backer_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SettingsItem_Slider_CM_C_BndEvt__WBP_SettingsItem_Slider_CM_Button_Backer_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SettingsItem_Slider_CM_C_BndEvt__WBP_SettingsItem_Slider_CM_Button_Backer_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SettingsItem_Slider_CM_C_BndEvt__WBP_SettingsItem_Slider_CM_Button_Backer_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SettingsItem_Slider_CM_C_BndEvt__WBP_SettingsItem_Slider_CM_Button_Backer_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SettingsItem_Slider_CM_C_BndEvt__WBP_SettingsItem_Slider_CM_Button_Backer_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SettingsItem_Slider_CM.WBP_SettingsItem_Slider_CM_C.BndEvt__WBP_SettingsItem_Slider_CM_Button_Backer_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsItem_Slider_CM_C_BndEvt__WBP_SettingsItem_Slider_CM_Button_Backer_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsItem_Slider_CM_C_BndEvt__WBP_SettingsItem_Slider_CM_Button_Backer_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SettingsItem_Slider_CM_C_BndEvt__WBP_SettingsItem_Slider_CM_Button_Backer_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_SettingsItem_Slider_CM_C_BndEvt__WBP_SettingsItem_Slider_CM_Button_Backer_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_SettingsItem_Slider_CM_C_BndEvt__WBP_SettingsItem_Slider_CM_Button_Backer_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_SettingsItem_Slider_CM_C_BndEvt__WBP_SettingsItem_Slider_CM_Button_Backer_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_SettingsItem_Slider_CM_C_BndEvt__WBP_SettingsItem_Slider_CM_Button_Backer_K2Node_ComponentBoundEvent_9_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SettingsItem_Slider_CM.WBP_SettingsItem_Slider_CM_C.BndEvt__WBP_SettingsItem_Slider_CM_WBP_Slider_Settings_CM_K2Node_ComponentBoundEvent_11_OnSliderValueChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsItem_Slider_CM_C_BndEvt__WBP_SettingsItem_Slider_CM_WBP_Slider_Settings_CM_K2Node_ComponentBoundEvent_11_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsItem_Slider_CM_C_BndEvt__WBP_SettingsItem_Slider_CM_WBP_Slider_Settings_CM_K2Node_ComponentBoundEvent_11_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SettingsItem_Slider_CM_C_BndEvt__WBP_SettingsItem_Slider_CM_WBP_Slider_Settings_CM_K2Node_ComponentBoundEvent_11_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(WBP_SettingsItem_Slider_CM_C_BndEvt__WBP_SettingsItem_Slider_CM_WBP_Slider_Settings_CM_K2Node_ComponentBoundEvent_11_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong size on WBP_SettingsItem_Slider_CM_C_BndEvt__WBP_SettingsItem_Slider_CM_WBP_Slider_Settings_CM_K2Node_ComponentBoundEvent_11_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(WBP_SettingsItem_Slider_CM_C_BndEvt__WBP_SettingsItem_Slider_CM_WBP_Slider_Settings_CM_K2Node_ComponentBoundEvent_11_OnSliderValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_SettingsItem_Slider_CM_C_BndEvt__WBP_SettingsItem_Slider_CM_WBP_Slider_Settings_CM_K2Node_ComponentBoundEvent_11_OnSliderValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function WBP_SettingsItem_Slider_CM.WBP_SettingsItem_Slider_CM_C.ExecuteUbergraph_WBP_SettingsItem_Slider_CM
// 0x0038 (0x0038 - 0x0000)
struct WBP_SettingsItem_Slider_CM_C_ExecuteUbergraph_WBP_SettingsItem_Slider_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5533[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_ComponentBoundEvent_Value;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_2;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetStepSize_InValue_ImplicitCast;         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsItem_Slider_CM_C_ExecuteUbergraph_WBP_SettingsItem_Slider_CM) == 0x000008, "Wrong alignment on WBP_SettingsItem_Slider_CM_C_ExecuteUbergraph_WBP_SettingsItem_Slider_CM");
static_assert(sizeof(WBP_SettingsItem_Slider_CM_C_ExecuteUbergraph_WBP_SettingsItem_Slider_CM) == 0x000038, "Wrong size on WBP_SettingsItem_Slider_CM_C_ExecuteUbergraph_WBP_SettingsItem_Slider_CM");
static_assert(offsetof(WBP_SettingsItem_Slider_CM_C_ExecuteUbergraph_WBP_SettingsItem_Slider_CM, EntryPoint) == 0x000000, "Member 'WBP_SettingsItem_Slider_CM_C_ExecuteUbergraph_WBP_SettingsItem_Slider_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SettingsItem_Slider_CM_C_ExecuteUbergraph_WBP_SettingsItem_Slider_CM, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_SettingsItem_Slider_CM_C_ExecuteUbergraph_WBP_SettingsItem_Slider_CM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_SettingsItem_Slider_CM_C_ExecuteUbergraph_WBP_SettingsItem_Slider_CM, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000005, "Member 'WBP_SettingsItem_Slider_CM_C_ExecuteUbergraph_WBP_SettingsItem_Slider_CM::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsItem_Slider_CM_C_ExecuteUbergraph_WBP_SettingsItem_Slider_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x000008, "Member 'WBP_SettingsItem_Slider_CM_C_ExecuteUbergraph_WBP_SettingsItem_Slider_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsItem_Slider_CM_C_ExecuteUbergraph_WBP_SettingsItem_Slider_CM, CallFunc_AkEventGlobal_ReturnValue_1) == 0x00000C, "Member 'WBP_SettingsItem_Slider_CM_C_ExecuteUbergraph_WBP_SettingsItem_Slider_CM::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsItem_Slider_CM_C_ExecuteUbergraph_WBP_SettingsItem_Slider_CM, K2Node_ComponentBoundEvent_Button_2) == 0x000010, "Member 'WBP_SettingsItem_Slider_CM_C_ExecuteUbergraph_WBP_SettingsItem_Slider_CM::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_SettingsItem_Slider_CM_C_ExecuteUbergraph_WBP_SettingsItem_Slider_CM, K2Node_ComponentBoundEvent_Button_1) == 0x000018, "Member 'WBP_SettingsItem_Slider_CM_C_ExecuteUbergraph_WBP_SettingsItem_Slider_CM::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_SettingsItem_Slider_CM_C_ExecuteUbergraph_WBP_SettingsItem_Slider_CM, K2Node_ComponentBoundEvent_Button) == 0x000020, "Member 'WBP_SettingsItem_Slider_CM_C_ExecuteUbergraph_WBP_SettingsItem_Slider_CM::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_SettingsItem_Slider_CM_C_ExecuteUbergraph_WBP_SettingsItem_Slider_CM, K2Node_ComponentBoundEvent_Value) == 0x000028, "Member 'WBP_SettingsItem_Slider_CM_C_ExecuteUbergraph_WBP_SettingsItem_Slider_CM::K2Node_ComponentBoundEvent_Value' has a wrong offset!");
static_assert(offsetof(WBP_SettingsItem_Slider_CM_C_ExecuteUbergraph_WBP_SettingsItem_Slider_CM, CallFunc_AkEventGlobal_ReturnValue_2) == 0x000030, "Member 'WBP_SettingsItem_Slider_CM_C_ExecuteUbergraph_WBP_SettingsItem_Slider_CM::CallFunc_AkEventGlobal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SettingsItem_Slider_CM_C_ExecuteUbergraph_WBP_SettingsItem_Slider_CM, CallFunc_SetStepSize_InValue_ImplicitCast) == 0x000034, "Member 'WBP_SettingsItem_Slider_CM_C_ExecuteUbergraph_WBP_SettingsItem_Slider_CM::CallFunc_SetStepSize_InValue_ImplicitCast' has a wrong offset!");

// Function WBP_SettingsItem_Slider_CM.WBP_SettingsItem_Slider_CM_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_SettingsItem_Slider_CM_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_SettingsItem_Slider_CM_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_SettingsItem_Slider_CM_C_OnFocusReceived");
static_assert(sizeof(WBP_SettingsItem_Slider_CM_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_SettingsItem_Slider_CM_C_OnFocusReceived");
static_assert(offsetof(WBP_SettingsItem_Slider_CM_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_SettingsItem_Slider_CM_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SettingsItem_Slider_CM_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_SettingsItem_Slider_CM_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_SettingsItem_Slider_CM_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_SettingsItem_Slider_CM_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SettingsItem_Slider_CM_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_SettingsItem_Slider_CM_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_SettingsItem_Slider_CM.WBP_SettingsItem_Slider_CM_C.OnSliderValueChanged__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsItem_Slider_CM_C_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsItem_Slider_CM_C_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SettingsItem_Slider_CM_C_OnSliderValueChanged__DelegateSignature");
static_assert(sizeof(WBP_SettingsItem_Slider_CM_C_OnSliderValueChanged__DelegateSignature) == 0x000008, "Wrong size on WBP_SettingsItem_Slider_CM_C_OnSliderValueChanged__DelegateSignature");
static_assert(offsetof(WBP_SettingsItem_Slider_CM_C_OnSliderValueChanged__DelegateSignature, Value) == 0x000000, "Member 'WBP_SettingsItem_Slider_CM_C_OnSliderValueChanged__DelegateSignature::Value' has a wrong offset!");

// Function WBP_SettingsItem_Slider_CM.WBP_SettingsItem_Slider_CM_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_SettingsItem_Slider_CM_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsItem_Slider_CM_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_SettingsItem_Slider_CM_C_PreConstruct");
static_assert(sizeof(WBP_SettingsItem_Slider_CM_C_PreConstruct) == 0x000001, "Wrong size on WBP_SettingsItem_Slider_CM_C_PreConstruct");
static_assert(offsetof(WBP_SettingsItem_Slider_CM_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_SettingsItem_Slider_CM_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_SettingsItem_Slider_CM.WBP_SettingsItem_Slider_CM_C.SetItemName
// 0x0018 (0x0018 - 0x0000)
struct WBP_SettingsItem_Slider_CM_C_SetItemName final
{
public:
	class FText                                   Param_ItemName;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_SettingsItem_Slider_CM_C_SetItemName) == 0x000008, "Wrong alignment on WBP_SettingsItem_Slider_CM_C_SetItemName");
static_assert(sizeof(WBP_SettingsItem_Slider_CM_C_SetItemName) == 0x000018, "Wrong size on WBP_SettingsItem_Slider_CM_C_SetItemName");
static_assert(offsetof(WBP_SettingsItem_Slider_CM_C_SetItemName, Param_ItemName) == 0x000000, "Member 'WBP_SettingsItem_Slider_CM_C_SetItemName::Param_ItemName' has a wrong offset!");

// Function WBP_SettingsItem_Slider_CM.WBP_SettingsItem_Slider_CM_C.SetSliderSettings
// 0x0028 (0x0028 - 0x0000)
struct WBP_SettingsItem_Slider_CM_C_SetSliderSettings final
{
public:
	struct FFSettingsItemSlider                   Param_SliderSettings;                              // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsItem_Slider_CM_C_SetSliderSettings) == 0x000008, "Wrong alignment on WBP_SettingsItem_Slider_CM_C_SetSliderSettings");
static_assert(sizeof(WBP_SettingsItem_Slider_CM_C_SetSliderSettings) == 0x000028, "Wrong size on WBP_SettingsItem_Slider_CM_C_SetSliderSettings");
static_assert(offsetof(WBP_SettingsItem_Slider_CM_C_SetSliderSettings, Param_SliderSettings) == 0x000000, "Member 'WBP_SettingsItem_Slider_CM_C_SetSliderSettings::Param_SliderSettings' has a wrong offset!");

// Function WBP_SettingsItem_Slider_CM.WBP_SettingsItem_Slider_CM_C.SetSliderValue
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsItem_Slider_CM_C_SetSliderValue final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsItem_Slider_CM_C_SetSliderValue) == 0x000008, "Wrong alignment on WBP_SettingsItem_Slider_CM_C_SetSliderValue");
static_assert(sizeof(WBP_SettingsItem_Slider_CM_C_SetSliderValue) == 0x000008, "Wrong size on WBP_SettingsItem_Slider_CM_C_SetSliderValue");
static_assert(offsetof(WBP_SettingsItem_Slider_CM_C_SetSliderValue, SliderValue) == 0x000000, "Member 'WBP_SettingsItem_Slider_CM_C_SetSliderValue::SliderValue' has a wrong offset!");

// Function WBP_SettingsItem_Slider_CM.WBP_SettingsItem_Slider_CM_C.UpdateSliderDisplayedValueModifier
// 0x0008 (0x0008 - 0x0000)
struct WBP_SettingsItem_Slider_CM_C_UpdateSliderDisplayedValueModifier final
{
public:
	double                                        DisplayedValueModifier;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SettingsItem_Slider_CM_C_UpdateSliderDisplayedValueModifier) == 0x000008, "Wrong alignment on WBP_SettingsItem_Slider_CM_C_UpdateSliderDisplayedValueModifier");
static_assert(sizeof(WBP_SettingsItem_Slider_CM_C_UpdateSliderDisplayedValueModifier) == 0x000008, "Wrong size on WBP_SettingsItem_Slider_CM_C_UpdateSliderDisplayedValueModifier");
static_assert(offsetof(WBP_SettingsItem_Slider_CM_C_UpdateSliderDisplayedValueModifier, DisplayedValueModifier) == 0x000000, "Member 'WBP_SettingsItem_Slider_CM_C_UpdateSliderDisplayedValueModifier::DisplayedValueModifier' has a wrong offset!");

}

