#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StandaloneInventory_CM

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonWidgetInputExtended_classes.hpp"
#include "Palia_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_StandaloneInventory_CM.WBP_StandaloneInventory_CM_C
// 0x0088 (0x0598 - 0x0510)
class UWBP_StandaloneInventory_CM_C final : public UCommonActivatableWidgetInputExtended
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_CloseButton_CM_C*                  CloseButton;                                       // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         CommunityPointsHBox;                               // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         CurrencyHBox;                                      // 0x0528(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                Overflow_TextBlock;                                // 0x0530(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                Text_Currency_CommunityPoints;                     // 0x0538(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                Text_Currency_Gold;                                // 0x0540(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_TextBlock_Styled*                TitleTextBlock;                                    // 0x0548(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CommonUIButtonPrompt_C*            WBP_CommonUIButtonPrompt;                          // 0x0550(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Inventory_CM_C*                    WBP_Inventory_CM;                                  // 0x0558(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Inventory_CM_C*                    WBP_Inventory_CM_Overflow;                         // 0x0560(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnClosed;                                          // 0x0568(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UVillagerGiftReceiverComponent*         VillagerGiftReceiver;                              // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnGiveGiftClosed;                                  // 0x0580(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWidget*                                LastValidFocusedWidget;                            // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_Inventory_CloseButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WBP_StandaloneInventory_CM_CloseButton_K2Node_ComponentBoundEvent_4_OnButtonClicked__DelegateSignature();
	void BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_2_OnInventorySlotFocused__DelegateSignature(class UWidget* Widget);
	void BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_5_OnSlotLeftClicked__DelegateSignature(class UWBP_Inventory_CM_C* Inventory, class UWBP_InventoryBag_CM_C* Bag, class UWBP_InventorySlot_CM_C* Param_Slot);
	void BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_K2Node_ComponentBoundEvent_6_OnSlotRightClicked__DelegateSignature(class UWBP_Inventory_CM_C* Inventory, class UWBP_InventoryBag_CM_C* Bag, class UWBP_InventorySlot_CM_C* Param_Slot);
	void BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_3_OnInventorySlotFocused__DelegateSignature(class UWidget* Widget);
	void BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_7_OnSlotLeftClicked__DelegateSignature(class UWBP_Inventory_CM_C* Inventory, class UWBP_InventoryBag_CM_C* Bag, class UWBP_InventorySlot_CM_C* Param_Slot);
	void BndEvt__WBP_StandaloneInventory_CM_WBP_Inventory_CM_Overflow_K2Node_ComponentBoundEvent_8_OnSlotRightClicked__DelegateSignature(class UWBP_Inventory_CM_C* Inventory, class UWBP_InventoryBag_CM_C* Bag, class UWBP_InventorySlot_CM_C* Param_Slot);
	bool BP_OnHandleBackAction(int32 CallFunc_AkEventGlobal_ReturnValue);
	void CloseInventory(bool CallFunc_IsValid_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue);
	void Construct();
	void ExecuteUbergraph_WBP_StandaloneInventory_CM(int32 EntryPoint, int32 CallFunc_AkEventGlobal_ReturnValue, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue_1, float K2Node_EnhancedInputActionEvent_ElapsedTime_1, float K2Node_EnhancedInputActionEvent_TriggeredTime_1, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction_1, class UInputAction* Temp_object_Variable, bool CallFunc_Conv_InputActionValueToBool_ReturnValue, double Temp_real_Variable, double Temp_real_Variable_1, double Temp_real_Variable_0, double Temp_real_Variable_1_0, bool Temp_bool_Variable, const struct FInputActionValue& K2Node_EnhancedInputActionEvent_ActionValue, float K2Node_EnhancedInputActionEvent_ElapsedTime, float K2Node_EnhancedInputActionEvent_TriggeredTime, class UInputAction* K2Node_EnhancedInputActionEvent_SourceAction, bool CallFunc_Conv_InputActionValueToBool_ReturnValue_1, class UInputAction* Temp_object_Variable_1, double Temp_real_Variable_2, double Temp_real_Variable_2_0, double Temp_real_Variable_3, bool Temp_bool_Variable_1, double Temp_real_Variable_3_0, class UVitalsComponent* K2Node_CustomEvent_Vitals, int32 CallFunc_GetVital_ReturnValue, int32 CallFunc_GetVital_ReturnValue_1, class FText CallFunc_Conv_IntToText_ReturnValue, class FText CallFunc_Conv_IntToText_ReturnValue_1, int32 CallFunc_AkEventGlobal_ReturnValue_1, class UInventoryComponent* K2Node_CustomEvent_Inventory, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, int32 CallFunc_GetNumberOfOverflowSlots_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, class AValeriaCharacter* CallFunc_WaitForValeriaCharacter_valeriaCharacter, class UPlayerInventoryComponent* CallFunc_GetInventory_ReturnValue, class FText CallFunc_GetTooltipForVital_ReturnValue, class FText CallFunc_GetTooltipForVital_ReturnValue_1, class FText CallFunc_GetTooltipForVital_ReturnValue_2, class FText CallFunc_GetTooltipForVital_ReturnValue_3, int32 CallFunc_AkEventGlobal_ReturnValue_2, TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate, class UWBP_Inventory_CM_C* K2Node_ComponentBoundEvent_Inventory_3, class UWBP_InventoryBag_CM_C* K2Node_ComponentBoundEvent_Bag_3, class UWBP_InventorySlot_CM_C* K2Node_ComponentBoundEvent_Slot_3, class UWBP_Inventory_CM_C* K2Node_ComponentBoundEvent_Inventory_2, class UWBP_InventoryBag_CM_C* K2Node_ComponentBoundEvent_Bag_2, class UWBP_InventorySlot_CM_C* K2Node_ComponentBoundEvent_Slot_2, class UWidget* K2Node_ComponentBoundEvent_Widget_1, bool CallFunc_IsValid_ReturnValue, TDelegate<void(class UInventoryComponent* Inventory)> K2Node_CreateDelegate_OutputDelegate_1, TDelegate<void(class UVitalsComponent* Vitals)> K2Node_CreateDelegate_OutputDelegate_2, class UWidget* K2Node_ComponentBoundEvent_Widget, bool CallFunc_IsValid_ReturnValue_1, class UWBP_Inventory_CM_C* K2Node_ComponentBoundEvent_Inventory_1, class UWBP_InventoryBag_CM_C* K2Node_ComponentBoundEvent_Bag_1, class UWBP_InventorySlot_CM_C* K2Node_ComponentBoundEvent_Slot_1, class UWBP_Inventory_CM_C* K2Node_ComponentBoundEvent_Inventory, class UWBP_InventoryBag_CM_C* K2Node_ComponentBoundEvent_Bag, class UWBP_InventorySlot_CM_C* K2Node_ComponentBoundEvent_Slot, bool K2Node_Event_IsDesignTime, bool CallFunc_IsConsolePlatform_ReturnValue, int32 CallFunc_AkEventGlobal_ReturnValue_3);
	void GetAllInventoryWidgets(TArray<class UWBP_Inventory_CM_C*>* InventoryWidgets, TArray<class UWBP_Inventory_CM_C*>& K2Node_MakeArray_Array);
	void GetCharacterInventory(class UPlayerInventoryComponent** Inventory, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, class UPlayerInventoryComponent* CallFunc_GetInventory_ReturnValue);
	void HandleButtonClicked(class UWBP_InventorySlot_CM_C* Param_Slot, bool bRightClick, class UDialogueManagerComponent* DialogueManager, class AValeriaPlayerController* PlayerController, bool Temp_bool_Variable, int32 Temp_int_Variable, const struct FBagSlotLocation& K2Node_MakeStruct_BagSlotLocation, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, int32 Temp_int_Array_Index_Variable, class UDialogueManagerComponent* CallFunc_GetDialogueManager_ReturnValue, int32 Temp_int_Variable_1, const struct FValeriaItem& CallFunc_GetItem_Item, const struct FValeriaItem& CallFunc_GetItem_Item_1, const struct FValeriaItem& CallFunc_GetItem_Item_2, const struct FValeriaItem& CallFunc_GetItem_Item_3, const struct FValeriaItem& CallFunc_GetItem_Item_4, class UObject* CallFunc_LoadAsset_Blocking_ReturnValue, class UVAL_ItemTypeDefinitionAsset* K2Node_DynamicCast_AsItem_Type_Definition, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsSlotHasGiftableItem_IsItemGiftable, class UPlayerInventoryComponent* CallFunc_GetCharacterInventory_Inventory, int32 CallFunc_PostGlobalEvent_ReturnValue, bool Temp_bool_Variable_1, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue_1, class UStorageComponent* CallFunc_GetStorage_ReturnValue, bool CallFunc_IsValid_ReturnValue, EStoragePoolType CallFunc_GetActiveStoragePool_ReturnValue, EStoragePoolType CallFunc_GetActiveStoragePool_ReturnValue_1, class UObject* CallFunc_LoadAsset_Blocking_ReturnValue_1, bool CallFunc_EqualEqual_ByteByte_ReturnValue, class UVAL_ItemTypeDefinitionAsset* K2Node_DynamicCast_AsItem_Type_Definition_1, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_IsValid_ReturnValue_1, EItemStorageCategory CallFunc_Array_Get_Item, bool CallFunc_IsItemTypeInCategory_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_UseOrSelectItem_ReturnValue, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 K2Node_Select_Default, int32 K2Node_Select_Default_1, class UInventoryComponent* CallFunc_GetInteractor_OtherInventory_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, EValeriaFuncResult CallFunc_GetValeriaPlayerController_OutResult, class AValeriaPlayerController* CallFunc_GetValeriaPlayerController_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_1);
	void HandleInventoryChanged(class UInventoryComponent* Inventory);
	void HandleVisibilityChanged(ESlateVisibility InVisibility, bool Param_IsVisible, bool CallFunc_IsVisible_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue, class UVALUI_UIManagerWidgetBase* K2Node_DynamicCast_AsVALUI_UIManager_Widget_Base, bool K2Node_DynamicCast_bSuccess);
	void HandleVitalsChanged(class UVitalsComponent* Vitals);
	void InpActEvt_IA_UI_SecondaryTab_Switch_L_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	void InpActEvt_IA_UI_SecondaryTab_Switch_R_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, class UInputAction* SourceAction);
	void IsSlotHasGiftableItem(class UWBP_InventorySlot_CM_C* InventorySlot, bool* IsItemGiftable, bool IsGiftable, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, const struct FValeriaItem& CallFunc_GetItem_Item, bool CallFunc_Greater_IntInt_ReturnValue, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, bool CallFunc_GetPredictedResponseFor_bAlreadyReceived, EGiftPredictedResponse CallFunc_GetPredictedResponseFor_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, bool K2Node_SwitchEnum_CmpSuccess_1);
	void OnClosed__DelegateSignature();
	void OnGiveGiftClosed__DelegateSignature();
	void OnInitialized();
	void PlayItemAddedSound(const struct FValeriaItem& Item, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, class UComp_Player_Audio_C* CallFunc_GetComponentByClass_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess);
	void PreConstruct(bool IsDesignTime);
	void Reset_Gifting_Info(int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Array_Index_Variable_1, int32 Temp_int_Loop_Counter_Variable_1, TArray<class UWBP_Inventory_CM_C*>& CallFunc_GetAllInventoryWidgets_InventoryWidgets, class UWBP_Inventory_CM_C* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, TArray<class UWBP_InventorySlot_CM_C*>& CallFunc_GetAllSlots_Slots, bool CallFunc_Less_IntInt_ReturnValue, class UWBP_InventorySlot_CM_C* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_1);
	void Setup();
	void ShowGiftingInfo(int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Array_Index_Variable_1, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, int32 Temp_int_Loop_Counter_Variable_1, TArray<class UWBP_Inventory_CM_C*>& CallFunc_GetAllInventoryWidgets_InventoryWidgets, class UWBP_Inventory_CM_C* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, TArray<class UWBP_InventorySlot_CM_C*>& CallFunc_GetAllSlots_Slots, bool CallFunc_Less_IntInt_ReturnValue, class UWBP_InventorySlot_CM_C* CallFunc_Array_Get_Item_1, const struct FValeriaItem& CallFunc_GetItem_Item, bool CallFunc_Greater_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1, bool Temp_bool_Variable, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_GetPredictedResponseFor_bAlreadyReceived, EGiftPredictedResponse CallFunc_GetPredictedResponseFor_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_1, ESlateVisibility K2Node_Select_Default);
	void UpdateUIButtonPrompt(bool CallFunc_IsValid_ReturnValue, class UWBP_InventorySlot_CM_C* K2Node_DynamicCast_AsWBP_Inventory_Slot_CM, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsSlotHasGiftableItem_IsItemGiftable);

	class UWidget* BP_GetDesiredFocusTarget(bool CallFunc_IsValid_ReturnValue, class UWidget* CallFunc_GetChildAt_ReturnValue, class UWBP_InventoryBag_CM_C* K2Node_DynamicCast_AsWBP_Inventory_Bag_CM, bool K2Node_DynamicCast_bSuccess, TArray<class UWBP_InventorySlot_CM_C*>& CallFunc_GetAllSlots_Slots, class UWBP_InventorySlot_CM_C* CallFunc_Array_Get_Item, bool CallFunc_IsValid_ReturnValue_1) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_StandaloneInventory_CM_C">();
	}
	static class UWBP_StandaloneInventory_CM_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_StandaloneInventory_CM_C>();
	}
};
static_assert(alignof(UWBP_StandaloneInventory_CM_C) == 0x000008, "Wrong alignment on UWBP_StandaloneInventory_CM_C");
static_assert(sizeof(UWBP_StandaloneInventory_CM_C) == 0x000598, "Wrong size on UWBP_StandaloneInventory_CM_C");
static_assert(offsetof(UWBP_StandaloneInventory_CM_C, UberGraphFrame) == 0x000510, "Member 'UWBP_StandaloneInventory_CM_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_StandaloneInventory_CM_C, CloseButton) == 0x000518, "Member 'UWBP_StandaloneInventory_CM_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UWBP_StandaloneInventory_CM_C, CommunityPointsHBox) == 0x000520, "Member 'UWBP_StandaloneInventory_CM_C::CommunityPointsHBox' has a wrong offset!");
static_assert(offsetof(UWBP_StandaloneInventory_CM_C, CurrencyHBox) == 0x000528, "Member 'UWBP_StandaloneInventory_CM_C::CurrencyHBox' has a wrong offset!");
static_assert(offsetof(UWBP_StandaloneInventory_CM_C, Overflow_TextBlock) == 0x000530, "Member 'UWBP_StandaloneInventory_CM_C::Overflow_TextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_StandaloneInventory_CM_C, Text_Currency_CommunityPoints) == 0x000538, "Member 'UWBP_StandaloneInventory_CM_C::Text_Currency_CommunityPoints' has a wrong offset!");
static_assert(offsetof(UWBP_StandaloneInventory_CM_C, Text_Currency_Gold) == 0x000540, "Member 'UWBP_StandaloneInventory_CM_C::Text_Currency_Gold' has a wrong offset!");
static_assert(offsetof(UWBP_StandaloneInventory_CM_C, TitleTextBlock) == 0x000548, "Member 'UWBP_StandaloneInventory_CM_C::TitleTextBlock' has a wrong offset!");
static_assert(offsetof(UWBP_StandaloneInventory_CM_C, WBP_CommonUIButtonPrompt) == 0x000550, "Member 'UWBP_StandaloneInventory_CM_C::WBP_CommonUIButtonPrompt' has a wrong offset!");
static_assert(offsetof(UWBP_StandaloneInventory_CM_C, WBP_Inventory_CM) == 0x000558, "Member 'UWBP_StandaloneInventory_CM_C::WBP_Inventory_CM' has a wrong offset!");
static_assert(offsetof(UWBP_StandaloneInventory_CM_C, WBP_Inventory_CM_Overflow) == 0x000560, "Member 'UWBP_StandaloneInventory_CM_C::WBP_Inventory_CM_Overflow' has a wrong offset!");
static_assert(offsetof(UWBP_StandaloneInventory_CM_C, OnClosed) == 0x000568, "Member 'UWBP_StandaloneInventory_CM_C::OnClosed' has a wrong offset!");
static_assert(offsetof(UWBP_StandaloneInventory_CM_C, VillagerGiftReceiver) == 0x000578, "Member 'UWBP_StandaloneInventory_CM_C::VillagerGiftReceiver' has a wrong offset!");
static_assert(offsetof(UWBP_StandaloneInventory_CM_C, OnGiveGiftClosed) == 0x000580, "Member 'UWBP_StandaloneInventory_CM_C::OnGiveGiftClosed' has a wrong offset!");
static_assert(offsetof(UWBP_StandaloneInventory_CM_C, LastValidFocusedWidget) == 0x000590, "Member 'UWBP_StandaloneInventory_CM_C::LastValidFocusedWidget' has a wrong offset!");

}

