#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SocialPanel_Party

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_SocialPanel_Party.WBP_SocialPanel_Party_C.BndEvt__WBP_SocialPanel_Party_CustomNavigationGroup_Party_K2Node_ComponentBoundEvent_3_OnCustomNavigationGroupInitialized__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SocialPanel_Party_C_BndEvt__WBP_SocialPanel_Party_CustomNavigationGroup_Party_K2Node_ComponentBoundEvent_3_OnCustomNavigationGroupInitialized__DelegateSignature final
{
public:
	const class US6UI_CustomNavigationGroup*      NavGroup;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialPanel_Party_C_BndEvt__WBP_SocialPanel_Party_CustomNavigationGroup_Party_K2Node_ComponentBoundEvent_3_OnCustomNavigationGroupInitialized__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialPanel_Party_C_BndEvt__WBP_SocialPanel_Party_CustomNavigationGroup_Party_K2Node_ComponentBoundEvent_3_OnCustomNavigationGroupInitialized__DelegateSignature");
static_assert(sizeof(WBP_SocialPanel_Party_C_BndEvt__WBP_SocialPanel_Party_CustomNavigationGroup_Party_K2Node_ComponentBoundEvent_3_OnCustomNavigationGroupInitialized__DelegateSignature) == 0x000008, "Wrong size on WBP_SocialPanel_Party_C_BndEvt__WBP_SocialPanel_Party_CustomNavigationGroup_Party_K2Node_ComponentBoundEvent_3_OnCustomNavigationGroupInitialized__DelegateSignature");
static_assert(offsetof(WBP_SocialPanel_Party_C_BndEvt__WBP_SocialPanel_Party_CustomNavigationGroup_Party_K2Node_ComponentBoundEvent_3_OnCustomNavigationGroupInitialized__DelegateSignature, NavGroup) == 0x000000, "Member 'WBP_SocialPanel_Party_C_BndEvt__WBP_SocialPanel_Party_CustomNavigationGroup_Party_K2Node_ComponentBoundEvent_3_OnCustomNavigationGroupInitialized__DelegateSignature::NavGroup' has a wrong offset!");

// Function WBP_SocialPanel_Party.WBP_SocialPanel_Party_C.BndEvt__WBP_SocialPanel_Party_CustomNavigationGroup_Party_K2Node_ComponentBoundEvent_5_OnNavigated__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SocialPanel_Party_C_BndEvt__WBP_SocialPanel_Party_CustomNavigationGroup_Party_K2Node_ComponentBoundEvent_5_OnNavigated__DelegateSignature final
{
public:
	const class US6UI_CustomNavigationGroup*      NavGroup;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialPanel_Party_C_BndEvt__WBP_SocialPanel_Party_CustomNavigationGroup_Party_K2Node_ComponentBoundEvent_5_OnNavigated__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SocialPanel_Party_C_BndEvt__WBP_SocialPanel_Party_CustomNavigationGroup_Party_K2Node_ComponentBoundEvent_5_OnNavigated__DelegateSignature");
static_assert(sizeof(WBP_SocialPanel_Party_C_BndEvt__WBP_SocialPanel_Party_CustomNavigationGroup_Party_K2Node_ComponentBoundEvent_5_OnNavigated__DelegateSignature) == 0x000008, "Wrong size on WBP_SocialPanel_Party_C_BndEvt__WBP_SocialPanel_Party_CustomNavigationGroup_Party_K2Node_ComponentBoundEvent_5_OnNavigated__DelegateSignature");
static_assert(offsetof(WBP_SocialPanel_Party_C_BndEvt__WBP_SocialPanel_Party_CustomNavigationGroup_Party_K2Node_ComponentBoundEvent_5_OnNavigated__DelegateSignature, NavGroup) == 0x000000, "Member 'WBP_SocialPanel_Party_C_BndEvt__WBP_SocialPanel_Party_CustomNavigationGroup_Party_K2Node_ComponentBoundEvent_5_OnNavigated__DelegateSignature::NavGroup' has a wrong offset!");

// Function WBP_SocialPanel_Party.WBP_SocialPanel_Party_C.ClearMemberList
// 0x0010 (0x0010 - 0x0000)
struct WBP_SocialPanel_Party_C_ClearMemberList final
{
public:
	class UVAL_PartyManager*                      CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaximumPartySize_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialPanel_Party_C_ClearMemberList) == 0x000008, "Wrong alignment on WBP_SocialPanel_Party_C_ClearMemberList");
static_assert(sizeof(WBP_SocialPanel_Party_C_ClearMemberList) == 0x000010, "Wrong size on WBP_SocialPanel_Party_C_ClearMemberList");
static_assert(offsetof(WBP_SocialPanel_Party_C_ClearMemberList, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000000, "Member 'WBP_SocialPanel_Party_C_ClearMemberList::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ClearMemberList, CallFunc_GetMaximumPartySize_ReturnValue) == 0x000008, "Member 'WBP_SocialPanel_Party_C_ClearMemberList::CallFunc_GetMaximumPartySize_ReturnValue' has a wrong offset!");

// Function WBP_SocialPanel_Party.WBP_SocialPanel_Party_C.DisplayParty
// 0x0088 (0x0088 - 0x0000)
struct WBP_SocialPanel_Party_C_DisplayParty final
{
public:
	bool                                          bDidFocusOnExistingPartyMember;                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57A7[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_PartyManager*                      CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    CallFunc_GetDisplayedEntryWidgets_ReturnValue;     // 0x0010(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSet<struct FVAL_PartyMember>                 CallFunc_GetAllPartyMembers_ReturnValue;           // 0x0028(0x0050)()
	int32                                         CallFunc_Set_Length_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialPanel_Party_C_DisplayParty) == 0x000008, "Wrong alignment on WBP_SocialPanel_Party_C_DisplayParty");
static_assert(sizeof(WBP_SocialPanel_Party_C_DisplayParty) == 0x000088, "Wrong size on WBP_SocialPanel_Party_C_DisplayParty");
static_assert(offsetof(WBP_SocialPanel_Party_C_DisplayParty, bDidFocusOnExistingPartyMember) == 0x000000, "Member 'WBP_SocialPanel_Party_C_DisplayParty::bDidFocusOnExistingPartyMember' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_DisplayParty, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'WBP_SocialPanel_Party_C_DisplayParty::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_DisplayParty, CallFunc_GetDisplayedEntryWidgets_ReturnValue) == 0x000010, "Member 'WBP_SocialPanel_Party_C_DisplayParty::CallFunc_GetDisplayedEntryWidgets_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_DisplayParty, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_SocialPanel_Party_C_DisplayParty::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_DisplayParty, CallFunc_GetAllPartyMembers_ReturnValue) == 0x000028, "Member 'WBP_SocialPanel_Party_C_DisplayParty::CallFunc_GetAllPartyMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_DisplayParty, CallFunc_Set_Length_ReturnValue) == 0x000078, "Member 'WBP_SocialPanel_Party_C_DisplayParty::CallFunc_Set_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_DisplayParty, CallFunc_Array_Length_ReturnValue) == 0x00007C, "Member 'WBP_SocialPanel_Party_C_DisplayParty::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_DisplayParty, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000080, "Member 'WBP_SocialPanel_Party_C_DisplayParty::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_DisplayParty, CallFunc_Greater_IntInt_ReturnValue) == 0x000081, "Member 'WBP_SocialPanel_Party_C_DisplayParty::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_SocialPanel_Party.WBP_SocialPanel_Party_C.ExecuteUbergraph_WBP_SocialPanel_Party
// 0x0120 (0x0120 - 0x0000)
struct WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57A8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_PartyManager*                      CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57A9[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EVAL_PartyManagerState State)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EVAL_PartyManagerState State)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0068(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x006C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x008C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57AA[0x3];                                     // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x00A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FVAL_PartyMember& Member)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x00B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57AB[0x4];                                     // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class US6UI_CustomNavigationGroup*      K2Node_ComponentBoundEvent_NavGroup_1;             // 0x00C8(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumItems_ReturnValue;                  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57AC[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x00E0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57AD[0x4];                                     // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class US6UI_CustomNavigationGroup*      K2Node_ComponentBoundEvent_NavGroup;               // 0x00E8(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_DisplayParty_bDidFocusOnExistingPartyMember; // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57AE[0x7];                                     // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_PartyManager*                      CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57AF[0x6];                                     // 0x0112(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_PartyManager*                      CallFunc_GetLocalPlayerSubsystem_ReturnValue_2;    // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party) == 0x000008, "Wrong alignment on WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party");
static_assert(sizeof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party) == 0x000120, "Wrong size on WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, EntryPoint) == 0x000000, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, Temp_bool_Variable) == 0x000010, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, CallFunc_Not_PreBool_ReturnValue) == 0x000011, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, CallFunc_AkEventGlobal_ReturnValue) == 0x000014, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, K2Node_CreateDelegate_OutputDelegate_2) == 0x000038, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, K2Node_CreateDelegate_OutputDelegate_3) == 0x000048, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, K2Node_CreateDelegate_OutputDelegate_4) == 0x000058, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, Temp_int_Variable) == 0x000068, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, K2Node_CreateDelegate_OutputDelegate_5) == 0x00006C, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, K2Node_CreateDelegate_OutputDelegate_6) == 0x00007C, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, Temp_int_Variable_1) == 0x00008C, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, K2Node_CreateDelegate_OutputDelegate_7) == 0x000090, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, Temp_bool_Variable_1) == 0x0000A0, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, K2Node_CreateDelegate_OutputDelegate_8) == 0x0000A4, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, K2Node_CreateDelegate_OutputDelegate_9) == 0x0000B4, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, K2Node_ComponentBoundEvent_NavGroup_1) == 0x0000C8, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::K2Node_ComponentBoundEvent_NavGroup_1' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, Temp_int_Variable_2) == 0x0000D0, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, CallFunc_GetNumItems_ReturnValue) == 0x0000D4, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::CallFunc_GetNumItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, CallFunc_Greater_IntInt_ReturnValue) == 0x0000D8, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, CallFunc_Add_IntInt_ReturnValue) == 0x0000DC, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, K2Node_Select_Default) == 0x0000E0, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, K2Node_ComponentBoundEvent_NavGroup) == 0x0000E8, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::K2Node_ComponentBoundEvent_NavGroup' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, K2Node_MakeArray_Array) == 0x0000F0, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, CallFunc_DisplayParty_bDidFocusOnExistingPartyMember) == 0x000100, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::CallFunc_DisplayParty_bDidFocusOnExistingPartyMember' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, CallFunc_GetLocalPlayerSubsystem_ReturnValue_1) == 0x000108, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::CallFunc_GetLocalPlayerSubsystem_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000110, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, CallFunc_BooleanAND_ReturnValue) == 0x000111, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party, CallFunc_GetLocalPlayerSubsystem_ReturnValue_2) == 0x000118, "Member 'WBP_SocialPanel_Party_C_ExecuteUbergraph_WBP_SocialPanel_Party::CallFunc_GetLocalPlayerSubsystem_ReturnValue_2' has a wrong offset!");

// Function WBP_SocialPanel_Party.WBP_SocialPanel_Party_C.HandleOnMemberAdded
// 0x0050 (0x0050 - 0x0000)
struct WBP_SocialPanel_Party_C_HandleOnMemberAdded final
{
public:
	struct FVAL_PartyMember                       Member;                                            // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialPanel_Party_C_HandleOnMemberAdded) == 0x000008, "Wrong alignment on WBP_SocialPanel_Party_C_HandleOnMemberAdded");
static_assert(sizeof(WBP_SocialPanel_Party_C_HandleOnMemberAdded) == 0x000050, "Wrong size on WBP_SocialPanel_Party_C_HandleOnMemberAdded");
static_assert(offsetof(WBP_SocialPanel_Party_C_HandleOnMemberAdded, Member) == 0x000000, "Member 'WBP_SocialPanel_Party_C_HandleOnMemberAdded::Member' has a wrong offset!");

// Function WBP_SocialPanel_Party.WBP_SocialPanel_Party_C.HandleOnMemberKicked
// 0x0050 (0x0050 - 0x0000)
struct WBP_SocialPanel_Party_C_HandleOnMemberKicked final
{
public:
	struct FVAL_PartyMember                       Member;                                            // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialPanel_Party_C_HandleOnMemberKicked) == 0x000008, "Wrong alignment on WBP_SocialPanel_Party_C_HandleOnMemberKicked");
static_assert(sizeof(WBP_SocialPanel_Party_C_HandleOnMemberKicked) == 0x000050, "Wrong size on WBP_SocialPanel_Party_C_HandleOnMemberKicked");
static_assert(offsetof(WBP_SocialPanel_Party_C_HandleOnMemberKicked, Member) == 0x000000, "Member 'WBP_SocialPanel_Party_C_HandleOnMemberKicked::Member' has a wrong offset!");

// Function WBP_SocialPanel_Party.WBP_SocialPanel_Party_C.HandleOnMemberPromoted
// 0x0050 (0x0050 - 0x0000)
struct WBP_SocialPanel_Party_C_HandleOnMemberPromoted final
{
public:
	struct FVAL_PartyMember                       Member;                                            // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialPanel_Party_C_HandleOnMemberPromoted) == 0x000008, "Wrong alignment on WBP_SocialPanel_Party_C_HandleOnMemberPromoted");
static_assert(sizeof(WBP_SocialPanel_Party_C_HandleOnMemberPromoted) == 0x000050, "Wrong size on WBP_SocialPanel_Party_C_HandleOnMemberPromoted");
static_assert(offsetof(WBP_SocialPanel_Party_C_HandleOnMemberPromoted, Member) == 0x000000, "Member 'WBP_SocialPanel_Party_C_HandleOnMemberPromoted::Member' has a wrong offset!");

// Function WBP_SocialPanel_Party.WBP_SocialPanel_Party_C.HandleOnMemberRemoved
// 0x0050 (0x0050 - 0x0000)
struct WBP_SocialPanel_Party_C_HandleOnMemberRemoved final
{
public:
	struct FVAL_PartyMember                       Member;                                            // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialPanel_Party_C_HandleOnMemberRemoved) == 0x000008, "Wrong alignment on WBP_SocialPanel_Party_C_HandleOnMemberRemoved");
static_assert(sizeof(WBP_SocialPanel_Party_C_HandleOnMemberRemoved) == 0x000050, "Wrong size on WBP_SocialPanel_Party_C_HandleOnMemberRemoved");
static_assert(offsetof(WBP_SocialPanel_Party_C_HandleOnMemberRemoved, Member) == 0x000000, "Member 'WBP_SocialPanel_Party_C_HandleOnMemberRemoved::Member' has a wrong offset!");

// Function WBP_SocialPanel_Party.WBP_SocialPanel_Party_C.HandleOnPartyStateChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_SocialPanel_Party_C_HandleOnPartyStateChanged final
{
public:
	EVAL_PartyManagerState                        State;                                             // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialPanel_Party_C_HandleOnPartyStateChanged) == 0x000001, "Wrong alignment on WBP_SocialPanel_Party_C_HandleOnPartyStateChanged");
static_assert(sizeof(WBP_SocialPanel_Party_C_HandleOnPartyStateChanged) == 0x000001, "Wrong size on WBP_SocialPanel_Party_C_HandleOnPartyStateChanged");
static_assert(offsetof(WBP_SocialPanel_Party_C_HandleOnPartyStateChanged, State) == 0x000000, "Member 'WBP_SocialPanel_Party_C_HandleOnPartyStateChanged::State' has a wrong offset!");

// Function WBP_SocialPanel_Party.WBP_SocialPanel_Party_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_SocialPanel_Party_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x00F8(0x00B8)()
};
static_assert(alignof(WBP_SocialPanel_Party_C_OnFocusReceived) == 0x000008, "Wrong alignment on WBP_SocialPanel_Party_C_OnFocusReceived");
static_assert(sizeof(WBP_SocialPanel_Party_C_OnFocusReceived) == 0x0001B0, "Wrong size on WBP_SocialPanel_Party_C_OnFocusReceived");
static_assert(offsetof(WBP_SocialPanel_Party_C_OnFocusReceived, MyGeometry) == 0x000000, "Member 'WBP_SocialPanel_Party_C_OnFocusReceived::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_OnFocusReceived, InFocusEvent) == 0x000038, "Member 'WBP_SocialPanel_Party_C_OnFocusReceived::InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_OnFocusReceived, ReturnValue) == 0x000040, "Member 'WBP_SocialPanel_Party_C_OnFocusReceived::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_OnFocusReceived, CallFunc_Handled_ReturnValue) == 0x0000F8, "Member 'WBP_SocialPanel_Party_C_OnFocusReceived::CallFunc_Handled_ReturnValue' has a wrong offset!");

// Function WBP_SocialPanel_Party.WBP_SocialPanel_Party_C.Update Member List
// 0x0108 (0x0108 - 0x0000)
struct WBP_SocialPanel_Party_C_Update_Member_List final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57B0[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UListItem_SocialConnection_C*>   ListItemsSocialConnection;                         // 0x0008(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57B1[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_PartyManager*                      CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetMaximumPartySize_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSet<struct FVAL_PartyMember>                 CallFunc_GetAllPartyMembers_ReturnValue;           // 0x0030(0x0050)()
	TArray<struct FVAL_PartyMember>               CallFunc_Set_ToArray_Result;                       // 0x0080(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57B2[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVAL_PartyMember                       CallFunc_Array_Get_Item;                           // 0x0098(0x0050)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57B3[0x3];                                     // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57B4[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UListItem_SocialConnection_C*           CallFunc_SpawnObject_ReturnValue;                  // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialPanel_Party_C_Update_Member_List) == 0x000008, "Wrong alignment on WBP_SocialPanel_Party_C_Update_Member_List");
static_assert(sizeof(WBP_SocialPanel_Party_C_Update_Member_List) == 0x000108, "Wrong size on WBP_SocialPanel_Party_C_Update_Member_List");
static_assert(offsetof(WBP_SocialPanel_Party_C_Update_Member_List, bSuccess) == 0x000000, "Member 'WBP_SocialPanel_Party_C_Update_Member_List::bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_Update_Member_List, ListItemsSocialConnection) == 0x000008, "Member 'WBP_SocialPanel_Party_C_Update_Member_List::ListItemsSocialConnection' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_Update_Member_List, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_SocialPanel_Party_C_Update_Member_List::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_Update_Member_List, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000020, "Member 'WBP_SocialPanel_Party_C_Update_Member_List::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_Update_Member_List, CallFunc_GetMaximumPartySize_ReturnValue) == 0x000028, "Member 'WBP_SocialPanel_Party_C_Update_Member_List::CallFunc_GetMaximumPartySize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_Update_Member_List, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'WBP_SocialPanel_Party_C_Update_Member_List::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_Update_Member_List, CallFunc_GetAllPartyMembers_ReturnValue) == 0x000030, "Member 'WBP_SocialPanel_Party_C_Update_Member_List::CallFunc_GetAllPartyMembers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_Update_Member_List, CallFunc_Set_ToArray_Result) == 0x000080, "Member 'WBP_SocialPanel_Party_C_Update_Member_List::CallFunc_Set_ToArray_Result' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_Update_Member_List, CallFunc_Add_IntInt_ReturnValue) == 0x000090, "Member 'WBP_SocialPanel_Party_C_Update_Member_List::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_Update_Member_List, CallFunc_Array_Get_Item) == 0x000098, "Member 'WBP_SocialPanel_Party_C_Update_Member_List::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_Update_Member_List, CallFunc_Array_Length_ReturnValue) == 0x0000E8, "Member 'WBP_SocialPanel_Party_C_Update_Member_List::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_Update_Member_List, CallFunc_Less_IntInt_ReturnValue) == 0x0000EC, "Member 'WBP_SocialPanel_Party_C_Update_Member_List::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_Update_Member_List, CallFunc_Array_Length_ReturnValue_1) == 0x0000F0, "Member 'WBP_SocialPanel_Party_C_Update_Member_List::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_Update_Member_List, CallFunc_SpawnObject_ReturnValue) == 0x0000F8, "Member 'WBP_SocialPanel_Party_C_Update_Member_List::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_Update_Member_List, CallFunc_Array_Add_ReturnValue) == 0x000100, "Member 'WBP_SocialPanel_Party_C_Update_Member_List::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WBP_SocialPanel_Party.WBP_SocialPanel_Party_C.UpdateFromPartyState
// 0x0020 (0x0020 - 0x0000)
struct WBP_SocialPanel_Party_C_UpdateFromPartyState final
{
public:
	bool                                          CallFunc_DisplayParty_bDidFocusOnExistingPartyMember; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Update_Member_List_bSuccess;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57B5[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVAL_PartyManager*                      CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EVAL_PartyManagerState                        CallFunc_GetCurrentPartyState_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVAL_PartyManagerState                        Temp_byte_Variable;                                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57B6[0x5];                                     // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SocialPanel_Party_C_UpdateFromPartyState) == 0x000008, "Wrong alignment on WBP_SocialPanel_Party_C_UpdateFromPartyState");
static_assert(sizeof(WBP_SocialPanel_Party_C_UpdateFromPartyState) == 0x000020, "Wrong size on WBP_SocialPanel_Party_C_UpdateFromPartyState");
static_assert(offsetof(WBP_SocialPanel_Party_C_UpdateFromPartyState, CallFunc_DisplayParty_bDidFocusOnExistingPartyMember) == 0x000000, "Member 'WBP_SocialPanel_Party_C_UpdateFromPartyState::CallFunc_DisplayParty_bDidFocusOnExistingPartyMember' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_UpdateFromPartyState, CallFunc_Update_Member_List_bSuccess) == 0x000001, "Member 'WBP_SocialPanel_Party_C_UpdateFromPartyState::CallFunc_Update_Member_List_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_UpdateFromPartyState, CallFunc_AkEventGlobal_ReturnValue) == 0x000004, "Member 'WBP_SocialPanel_Party_C_UpdateFromPartyState::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_UpdateFromPartyState, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000008, "Member 'WBP_SocialPanel_Party_C_UpdateFromPartyState::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_UpdateFromPartyState, CallFunc_GetCurrentPartyState_ReturnValue) == 0x000010, "Member 'WBP_SocialPanel_Party_C_UpdateFromPartyState::CallFunc_GetCurrentPartyState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_UpdateFromPartyState, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'WBP_SocialPanel_Party_C_UpdateFromPartyState::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_UpdateFromPartyState, Temp_byte_Variable) == 0x000012, "Member 'WBP_SocialPanel_Party_C_UpdateFromPartyState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_UpdateFromPartyState, K2Node_Select_Default) == 0x000018, "Member 'WBP_SocialPanel_Party_C_UpdateFromPartyState::K2Node_Select_Default' has a wrong offset!");

// Function WBP_SocialPanel_Party.WBP_SocialPanel_Party_C.UpdateMemberText
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_SocialPanel_Party_C_UpdateMemberText final
{
public:
	int32                                         Num_members;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Total_members;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue_1;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0068(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C8(0x0018)()
};
static_assert(alignof(WBP_SocialPanel_Party_C_UpdateMemberText) == 0x000008, "Wrong alignment on WBP_SocialPanel_Party_C_UpdateMemberText");
static_assert(sizeof(WBP_SocialPanel_Party_C_UpdateMemberText) == 0x0000E0, "Wrong size on WBP_SocialPanel_Party_C_UpdateMemberText");
static_assert(offsetof(WBP_SocialPanel_Party_C_UpdateMemberText, Num_members) == 0x000000, "Member 'WBP_SocialPanel_Party_C_UpdateMemberText::Num_members' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_UpdateMemberText, Total_members) == 0x000004, "Member 'WBP_SocialPanel_Party_C_UpdateMemberText::Total_members' has a wrong offset!");
static_assert(offsetof(WBP_SocialPanel_Party_C_UpdateMemberText, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000008, "Member 'WBP_SocialPanel_Party_C_UpdateMemberText::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
