#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Inventory_Store_CM

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Inventory_Store_CM.WBP_Inventory_Store_CM_C.BndEvt__WBP_Inventory_Store_CM_WBP_Inventory_K2Node_ComponentBoundEvent_0_OnInventorySlotFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Inventory_Store_CM_C_BndEvt__WBP_Inventory_Store_CM_WBP_Inventory_K2Node_ComponentBoundEvent_0_OnInventorySlotFocused__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Store_CM_C_BndEvt__WBP_Inventory_Store_CM_WBP_Inventory_K2Node_ComponentBoundEvent_0_OnInventorySlotFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Inventory_Store_CM_C_BndEvt__WBP_Inventory_Store_CM_WBP_Inventory_K2Node_ComponentBoundEvent_0_OnInventorySlotFocused__DelegateSignature");
static_assert(sizeof(WBP_Inventory_Store_CM_C_BndEvt__WBP_Inventory_Store_CM_WBP_Inventory_K2Node_ComponentBoundEvent_0_OnInventorySlotFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_Inventory_Store_CM_C_BndEvt__WBP_Inventory_Store_CM_WBP_Inventory_K2Node_ComponentBoundEvent_0_OnInventorySlotFocused__DelegateSignature");
static_assert(offsetof(WBP_Inventory_Store_CM_C_BndEvt__WBP_Inventory_Store_CM_WBP_Inventory_K2Node_ComponentBoundEvent_0_OnInventorySlotFocused__DelegateSignature, Widget) == 0x000000, "Member 'WBP_Inventory_Store_CM_C_BndEvt__WBP_Inventory_Store_CM_WBP_Inventory_K2Node_ComponentBoundEvent_0_OnInventorySlotFocused__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Inventory_Store_CM.WBP_Inventory_Store_CM_C.BndEvt__WBP_Inventory_Store_CM_WBP_Inventory_K2Node_ComponentBoundEvent_1_OnSlotLeftClicked__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_Inventory_Store_CM_C_BndEvt__WBP_Inventory_Store_CM_WBP_Inventory_K2Node_ComponentBoundEvent_1_OnSlotLeftClicked__DelegateSignature final
{
public:
	class UWBP_Inventory_CM_C*                    Inventory;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventoryBag_CM_C*                 Bag;                                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventorySlot_CM_C*                Param_Slot;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Store_CM_C_BndEvt__WBP_Inventory_Store_CM_WBP_Inventory_K2Node_ComponentBoundEvent_1_OnSlotLeftClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Inventory_Store_CM_C_BndEvt__WBP_Inventory_Store_CM_WBP_Inventory_K2Node_ComponentBoundEvent_1_OnSlotLeftClicked__DelegateSignature");
static_assert(sizeof(WBP_Inventory_Store_CM_C_BndEvt__WBP_Inventory_Store_CM_WBP_Inventory_K2Node_ComponentBoundEvent_1_OnSlotLeftClicked__DelegateSignature) == 0x000018, "Wrong size on WBP_Inventory_Store_CM_C_BndEvt__WBP_Inventory_Store_CM_WBP_Inventory_K2Node_ComponentBoundEvent_1_OnSlotLeftClicked__DelegateSignature");
static_assert(offsetof(WBP_Inventory_Store_CM_C_BndEvt__WBP_Inventory_Store_CM_WBP_Inventory_K2Node_ComponentBoundEvent_1_OnSlotLeftClicked__DelegateSignature, Inventory) == 0x000000, "Member 'WBP_Inventory_Store_CM_C_BndEvt__WBP_Inventory_Store_CM_WBP_Inventory_K2Node_ComponentBoundEvent_1_OnSlotLeftClicked__DelegateSignature::Inventory' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_BndEvt__WBP_Inventory_Store_CM_WBP_Inventory_K2Node_ComponentBoundEvent_1_OnSlotLeftClicked__DelegateSignature, Bag) == 0x000008, "Member 'WBP_Inventory_Store_CM_C_BndEvt__WBP_Inventory_Store_CM_WBP_Inventory_K2Node_ComponentBoundEvent_1_OnSlotLeftClicked__DelegateSignature::Bag' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_BndEvt__WBP_Inventory_Store_CM_WBP_Inventory_K2Node_ComponentBoundEvent_1_OnSlotLeftClicked__DelegateSignature, Param_Slot) == 0x000010, "Member 'WBP_Inventory_Store_CM_C_BndEvt__WBP_Inventory_Store_CM_WBP_Inventory_K2Node_ComponentBoundEvent_1_OnSlotLeftClicked__DelegateSignature::Param_Slot' has a wrong offset!");

// Function WBP_Inventory_Store_CM.WBP_Inventory_Store_CM_C.ChangeCurrency
// 0x0028 (0x0028 - 0x0000)
struct WBP_Inventory_Store_CM_C_ChangeCurrency final
{
public:
	class UCurrencyConfig*                        Currency;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_593F[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetTooltipForCurrency_ReturnValue;        // 0x0010(0x0018)()
};
static_assert(alignof(WBP_Inventory_Store_CM_C_ChangeCurrency) == 0x000008, "Wrong alignment on WBP_Inventory_Store_CM_C_ChangeCurrency");
static_assert(sizeof(WBP_Inventory_Store_CM_C_ChangeCurrency) == 0x000028, "Wrong size on WBP_Inventory_Store_CM_C_ChangeCurrency");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ChangeCurrency, Currency) == 0x000000, "Member 'WBP_Inventory_Store_CM_C_ChangeCurrency::Currency' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ChangeCurrency, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_Inventory_Store_CM_C_ChangeCurrency::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ChangeCurrency, CallFunc_GetTooltipForCurrency_ReturnValue) == 0x000010, "Member 'WBP_Inventory_Store_CM_C_ChangeCurrency::CallFunc_GetTooltipForCurrency_ReturnValue' has a wrong offset!");

// Function WBP_Inventory_Store_CM.WBP_Inventory_Store_CM_C.ExecuteUbergraph_WBP_Inventory_Store_CM
// 0x0150 (0x0150 - 0x0000)
struct WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5940[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_TextBlockStyle*                  Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVALUI_TextBlockStyle*                  Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5941[0x5];                                     // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurrencyConfig*                        K2Node_CustomEvent_Config;                         // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Delta;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewValue;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5942[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5943[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerInventoryComponent*              CallFunc_GetInventory_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5944[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UVitalsComponent* Vitals)> K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5945[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_BasicTooltip_C*                    CallFunc_Create_ReturnValue;                       // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UVitalsComponent*                       K2Node_CustomEvent_Vitals;                         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVitalMax_ReturnValue;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVital_ReturnValue;                     // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetVital_ReturnValue_1;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5946[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0088(0x0018)()
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5947[0x7];                                     // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVALUI_TextBlockStyle*                  K2Node_Select_Default;                             // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5948[0x7];                                     // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x00B8(0x0018)()
	class FText                                   CallFunc_GetTooltipForVital_ReturnValue;           // 0x00D0(0x0018)()
	class FText                                   CallFunc_GetTooltipForVital_ReturnValue_1;         // 0x00E8(0x0018)()
	class UWBP_Inventory_CM_C*                    K2Node_ComponentBoundEvent_Inventory;              // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventoryBag_CM_C*                 K2Node_ComponentBoundEvent_Bag;                    // 0x0108(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_InventorySlot_CM_C*                K2Node_ComponentBoundEvent_Slot;                   // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_ComponentBoundEvent_Widget;                 // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConsole_ReturnValue;                    // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5949[0x6];                                     // 0x0122(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UCurrencyConfig* Config, int32 Delta, int32 NewValue)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0130(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USizeBoxSlot*                           CallFunc_SlotAsSizeBoxSlot_ReturnValue;            // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_BasicTooltip_C*                    CallFunc_Create_ReturnValue_1;                     // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM) == 0x000008, "Wrong alignment on WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM");
static_assert(sizeof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM) == 0x000150, "Wrong size on WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, EntryPoint) == 0x000000, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, Temp_bool_Variable) == 0x000004, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, Temp_object_Variable) == 0x000008, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, Temp_object_Variable_1) == 0x000010, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, Temp_bool_Variable_1) == 0x000018, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, Temp_byte_Variable) == 0x000019, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, Temp_byte_Variable_1) == 0x00001A, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, K2Node_CustomEvent_Config) == 0x000020, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::K2Node_CustomEvent_Config' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, K2Node_CustomEvent_Delta) == 0x000028, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::K2Node_CustomEvent_Delta' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, K2Node_CustomEvent_NewValue) == 0x00002C, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::K2Node_CustomEvent_NewValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000030, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, CallFunc_GetValeriaCharacter_OutResult) == 0x000031, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000038, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, CallFunc_GetInventory_ReturnValue) == 0x000048, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::CallFunc_GetInventory_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, K2Node_SwitchEnum_CmpSuccess) == 0x000050, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, K2Node_CreateDelegate_OutputDelegate) == 0x000054, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, CallFunc_Create_ReturnValue) == 0x000068, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, K2Node_CustomEvent_Vitals) == 0x000070, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::K2Node_CustomEvent_Vitals' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, CallFunc_GetVitalMax_ReturnValue) == 0x000078, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::CallFunc_GetVitalMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, CallFunc_GetVital_ReturnValue) == 0x00007C, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::CallFunc_GetVital_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, CallFunc_GetVital_ReturnValue_1) == 0x000080, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::CallFunc_GetVital_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, CallFunc_Conv_IntToText_ReturnValue) == 0x000088, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0000A0, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, K2Node_Select_Default) == 0x0000A8, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, K2Node_Select_Default_1) == 0x0000B0, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, CallFunc_Conv_IntToText_ReturnValue_1) == 0x0000B8, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, CallFunc_GetTooltipForVital_ReturnValue) == 0x0000D0, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::CallFunc_GetTooltipForVital_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, CallFunc_GetTooltipForVital_ReturnValue_1) == 0x0000E8, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::CallFunc_GetTooltipForVital_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, K2Node_ComponentBoundEvent_Inventory) == 0x000100, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::K2Node_ComponentBoundEvent_Inventory' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, K2Node_ComponentBoundEvent_Bag) == 0x000108, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::K2Node_ComponentBoundEvent_Bag' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, K2Node_ComponentBoundEvent_Slot) == 0x000110, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::K2Node_ComponentBoundEvent_Slot' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, K2Node_ComponentBoundEvent_Widget) == 0x000118, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, K2Node_Event_IsDesignTime) == 0x000120, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, CallFunc_IsConsole_ReturnValue) == 0x000121, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::CallFunc_IsConsole_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000128, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, K2Node_CreateDelegate_OutputDelegate_1) == 0x000130, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, CallFunc_SlotAsSizeBoxSlot_ReturnValue) == 0x000140, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::CallFunc_SlotAsSizeBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM, CallFunc_Create_ReturnValue_1) == 0x000148, "Member 'WBP_Inventory_Store_CM_C_ExecuteUbergraph_WBP_Inventory_Store_CM::CallFunc_Create_ReturnValue_1' has a wrong offset!");

// Function WBP_Inventory_Store_CM.WBP_Inventory_Store_CM_C.HandleCurrencyChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_Inventory_Store_CM_C_HandleCurrencyChanged final
{
public:
	class UCurrencyConfig*                        Config;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Delta;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewValue;                                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Store_CM_C_HandleCurrencyChanged) == 0x000008, "Wrong alignment on WBP_Inventory_Store_CM_C_HandleCurrencyChanged");
static_assert(sizeof(WBP_Inventory_Store_CM_C_HandleCurrencyChanged) == 0x000010, "Wrong size on WBP_Inventory_Store_CM_C_HandleCurrencyChanged");
static_assert(offsetof(WBP_Inventory_Store_CM_C_HandleCurrencyChanged, Config) == 0x000000, "Member 'WBP_Inventory_Store_CM_C_HandleCurrencyChanged::Config' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_HandleCurrencyChanged, Delta) == 0x000008, "Member 'WBP_Inventory_Store_CM_C_HandleCurrencyChanged::Delta' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_HandleCurrencyChanged, NewValue) == 0x00000C, "Member 'WBP_Inventory_Store_CM_C_HandleCurrencyChanged::NewValue' has a wrong offset!");

// Function WBP_Inventory_Store_CM.WBP_Inventory_Store_CM_C.HandleVitalsChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_Inventory_Store_CM_C_HandleVitalsChanged final
{
public:
	class UVitalsComponent*                       Vitals;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Store_CM_C_HandleVitalsChanged) == 0x000008, "Wrong alignment on WBP_Inventory_Store_CM_C_HandleVitalsChanged");
static_assert(sizeof(WBP_Inventory_Store_CM_C_HandleVitalsChanged) == 0x000008, "Wrong size on WBP_Inventory_Store_CM_C_HandleVitalsChanged");
static_assert(offsetof(WBP_Inventory_Store_CM_C_HandleVitalsChanged, Vitals) == 0x000000, "Member 'WBP_Inventory_Store_CM_C_HandleVitalsChanged::Vitals' has a wrong offset!");

// Function WBP_Inventory_Store_CM.WBP_Inventory_Store_CM_C.Navigate Inventory Tab
// 0x0001 (0x0001 - 0x0000)
struct WBP_Inventory_Store_CM_C_Navigate_Inventory_Tab final
{
public:
	bool                                          bForward;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Store_CM_C_Navigate_Inventory_Tab) == 0x000001, "Wrong alignment on WBP_Inventory_Store_CM_C_Navigate_Inventory_Tab");
static_assert(sizeof(WBP_Inventory_Store_CM_C_Navigate_Inventory_Tab) == 0x000001, "Wrong size on WBP_Inventory_Store_CM_C_Navigate_Inventory_Tab");
static_assert(offsetof(WBP_Inventory_Store_CM_C_Navigate_Inventory_Tab, bForward) == 0x000000, "Member 'WBP_Inventory_Store_CM_C_Navigate_Inventory_Tab::bForward' has a wrong offset!");

// Function WBP_Inventory_Store_CM.WBP_Inventory_Store_CM_C.OnSlotClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Inventory_Store_CM_C_OnSlotClicked__DelegateSignature final
{
public:
	class UWBP_InventorySlot_CM_C*                InventorySlot;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Store_CM_C_OnSlotClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Inventory_Store_CM_C_OnSlotClicked__DelegateSignature");
static_assert(sizeof(WBP_Inventory_Store_CM_C_OnSlotClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Inventory_Store_CM_C_OnSlotClicked__DelegateSignature");
static_assert(offsetof(WBP_Inventory_Store_CM_C_OnSlotClicked__DelegateSignature, InventorySlot) == 0x000000, "Member 'WBP_Inventory_Store_CM_C_OnSlotClicked__DelegateSignature::InventorySlot' has a wrong offset!");

// Function WBP_Inventory_Store_CM.WBP_Inventory_Store_CM_C.OnSlotFocused__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Inventory_Store_CM_C_OnSlotFocused__DelegateSignature final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Store_CM_C_OnSlotFocused__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Inventory_Store_CM_C_OnSlotFocused__DelegateSignature");
static_assert(sizeof(WBP_Inventory_Store_CM_C_OnSlotFocused__DelegateSignature) == 0x000008, "Wrong size on WBP_Inventory_Store_CM_C_OnSlotFocused__DelegateSignature");
static_assert(offsetof(WBP_Inventory_Store_CM_C_OnSlotFocused__DelegateSignature, Widget) == 0x000000, "Member 'WBP_Inventory_Store_CM_C_OnSlotFocused__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Inventory_Store_CM.WBP_Inventory_Store_CM_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Inventory_Store_CM_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Inventory_Store_CM_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Inventory_Store_CM_C_PreConstruct");
static_assert(sizeof(WBP_Inventory_Store_CM_C_PreConstruct) == 0x000001, "Wrong size on WBP_Inventory_Store_CM_C_PreConstruct");
static_assert(offsetof(WBP_Inventory_Store_CM_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Inventory_Store_CM_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Inventory_Store_CM.WBP_Inventory_Store_CM_C.UpdateCurrency
// 0x0040 (0x0040 - 0x0000)
struct WBP_Inventory_Store_CM_C_UpdateCurrency final
{
public:
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_594A[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_594B[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerInventoryComponent*              CallFunc_GetInventory_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrencyAmount_ReturnValue;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_594C[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0018)()
};
static_assert(alignof(WBP_Inventory_Store_CM_C_UpdateCurrency) == 0x000008, "Wrong alignment on WBP_Inventory_Store_CM_C_UpdateCurrency");
static_assert(sizeof(WBP_Inventory_Store_CM_C_UpdateCurrency) == 0x000040, "Wrong size on WBP_Inventory_Store_CM_C_UpdateCurrency");
static_assert(offsetof(WBP_Inventory_Store_CM_C_UpdateCurrency, CallFunc_GetValeriaCharacter_OutResult) == 0x000000, "Member 'WBP_Inventory_Store_CM_C_UpdateCurrency::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_UpdateCurrency, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000008, "Member 'WBP_Inventory_Store_CM_C_UpdateCurrency::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Inventory_Store_CM_C_UpdateCurrency, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_Inventory_Store_CM_C_UpdateCurrency::CallFunc_IsValid_ReturnValue' has a wrong offset!");
