#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AnnouncementsModalDialog_CM

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"
#include "SlateCore_structs.hpp"
#include "S6UICore_structs.hpp"


namespace SDK::Params
{

// Function WBP_AnnouncementsModalDialog_CM.WBP_AnnouncementsModalDialog_CM_C.BndEvt__WBP_AnnouncementsModalDialog_CM_S6UI_CustomNavigationGroup_K2Node_ComponentBoundEvent_2_OnCustomNavigationGroupInitialized__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_AnnouncementsModalDialog_CM_C_BndEvt__WBP_AnnouncementsModalDialog_CM_S6UI_CustomNavigationGroup_K2Node_ComponentBoundEvent_2_OnCustomNavigationGroupInitialized__DelegateSignature final
{
public:
	const class US6UI_CustomNavigationGroup*      NavGroup;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AnnouncementsModalDialog_CM_C_BndEvt__WBP_AnnouncementsModalDialog_CM_S6UI_CustomNavigationGroup_K2Node_ComponentBoundEvent_2_OnCustomNavigationGroupInitialized__DelegateSignature) == 0x000008, "Wrong alignment on WBP_AnnouncementsModalDialog_CM_C_BndEvt__WBP_AnnouncementsModalDialog_CM_S6UI_CustomNavigationGroup_K2Node_ComponentBoundEvent_2_OnCustomNavigationGroupInitialized__DelegateSignature");
static_assert(sizeof(WBP_AnnouncementsModalDialog_CM_C_BndEvt__WBP_AnnouncementsModalDialog_CM_S6UI_CustomNavigationGroup_K2Node_ComponentBoundEvent_2_OnCustomNavigationGroupInitialized__DelegateSignature) == 0x000008, "Wrong size on WBP_AnnouncementsModalDialog_CM_C_BndEvt__WBP_AnnouncementsModalDialog_CM_S6UI_CustomNavigationGroup_K2Node_ComponentBoundEvent_2_OnCustomNavigationGroupInitialized__DelegateSignature");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_BndEvt__WBP_AnnouncementsModalDialog_CM_S6UI_CustomNavigationGroup_K2Node_ComponentBoundEvent_2_OnCustomNavigationGroupInitialized__DelegateSignature, NavGroup) == 0x000000, "Member 'WBP_AnnouncementsModalDialog_CM_C_BndEvt__WBP_AnnouncementsModalDialog_CM_S6UI_CustomNavigationGroup_K2Node_ComponentBoundEvent_2_OnCustomNavigationGroupInitialized__DelegateSignature::NavGroup' has a wrong offset!");

// Function WBP_AnnouncementsModalDialog_CM.WBP_AnnouncementsModalDialog_CM_C.BndEvt__WBP_AnnouncementsModalDialog_CM_WBP_Checkmark_CM_K2Node_ComponentBoundEvent_0_OnCheckedStateChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_AnnouncementsModalDialog_CM_C_BndEvt__WBP_AnnouncementsModalDialog_CM_WBP_Checkmark_CM_K2Node_ComponentBoundEvent_0_OnCheckedStateChanged__DelegateSignature final
{
public:
	bool                                          Checked;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AnnouncementsModalDialog_CM_C_BndEvt__WBP_AnnouncementsModalDialog_CM_WBP_Checkmark_CM_K2Node_ComponentBoundEvent_0_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong alignment on WBP_AnnouncementsModalDialog_CM_C_BndEvt__WBP_AnnouncementsModalDialog_CM_WBP_Checkmark_CM_K2Node_ComponentBoundEvent_0_OnCheckedStateChanged__DelegateSignature");
static_assert(sizeof(WBP_AnnouncementsModalDialog_CM_C_BndEvt__WBP_AnnouncementsModalDialog_CM_WBP_Checkmark_CM_K2Node_ComponentBoundEvent_0_OnCheckedStateChanged__DelegateSignature) == 0x000001, "Wrong size on WBP_AnnouncementsModalDialog_CM_C_BndEvt__WBP_AnnouncementsModalDialog_CM_WBP_Checkmark_CM_K2Node_ComponentBoundEvent_0_OnCheckedStateChanged__DelegateSignature");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_BndEvt__WBP_AnnouncementsModalDialog_CM_WBP_Checkmark_CM_K2Node_ComponentBoundEvent_0_OnCheckedStateChanged__DelegateSignature, Checked) == 0x000000, "Member 'WBP_AnnouncementsModalDialog_CM_C_BndEvt__WBP_AnnouncementsModalDialog_CM_WBP_Checkmark_CM_K2Node_ComponentBoundEvent_0_OnCheckedStateChanged__DelegateSignature::Checked' has a wrong offset!");

// Function WBP_AnnouncementsModalDialog_CM.WBP_AnnouncementsModalDialog_CM_C.BP_OnHandleBackAction
// 0x0018 (0x0018 - 0x0000)
struct WBP_AnnouncementsModalDialog_CM_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5225[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AnnouncementsModalDialog_CM_C_BP_OnHandleBackAction) == 0x000008, "Wrong alignment on WBP_AnnouncementsModalDialog_CM_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_AnnouncementsModalDialog_CM_C_BP_OnHandleBackAction) == 0x000018, "Wrong size on WBP_AnnouncementsModalDialog_CM_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_AnnouncementsModalDialog_CM_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_BP_OnHandleBackAction, CallFunc_GetOwningPlayer_ReturnValue) == 0x000008, "Member 'WBP_AnnouncementsModalDialog_CM_C_BP_OnHandleBackAction::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_BP_OnHandleBackAction, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000010, "Member 'WBP_AnnouncementsModalDialog_CM_C_BP_OnHandleBackAction::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

// Function WBP_AnnouncementsModalDialog_CM.WBP_AnnouncementsModalDialog_CM_C.CanClose
// 0x0060 (0x0060 - 0x0000)
struct WBP_AnnouncementsModalDialog_CM_C_CanClose final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5226[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<ES6UI_ModalWidgetState>                  K2Node_MakeSet_Set;                                // 0x0008(0x0050)(ConstParm)
	ES6UI_ModalWidgetState                        CallFunc_GetModalWidgetState_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AnnouncementsModalDialog_CM_C_CanClose) == 0x000008, "Wrong alignment on WBP_AnnouncementsModalDialog_CM_C_CanClose");
static_assert(sizeof(WBP_AnnouncementsModalDialog_CM_C_CanClose) == 0x000060, "Wrong size on WBP_AnnouncementsModalDialog_CM_C_CanClose");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_CanClose, ReturnValue) == 0x000000, "Member 'WBP_AnnouncementsModalDialog_CM_C_CanClose::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_CanClose, K2Node_MakeSet_Set) == 0x000008, "Member 'WBP_AnnouncementsModalDialog_CM_C_CanClose::K2Node_MakeSet_Set' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_CanClose, CallFunc_GetModalWidgetState_ReturnValue) == 0x000058, "Member 'WBP_AnnouncementsModalDialog_CM_C_CanClose::CallFunc_GetModalWidgetState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_CanClose, CallFunc_Set_Contains_ReturnValue) == 0x000059, "Member 'WBP_AnnouncementsModalDialog_CM_C_CanClose::CallFunc_Set_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_CanClose, CallFunc_Not_PreBool_ReturnValue) == 0x00005A, "Member 'WBP_AnnouncementsModalDialog_CM_C_CanClose::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_AnnouncementsModalDialog_CM.WBP_AnnouncementsModalDialog_CM_C.ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM
// 0x0268 (0x0268 - 0x0000)
struct WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5227[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetAnnouncementUrl_ReturnValue;           // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_2;     // 0x0018(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_2;     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_2;   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_2;    // 0x0040(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_InputActionValueToAxis1D_ReturnValue; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable;                                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_2;                              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue_1;     // 0x0080(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime_1;     // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime_1;   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction_1;    // 0x00A8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable_1;                            // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5228[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_3;                              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4;                              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_3_0;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_4_0;                            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5229[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x00E8(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0110(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue_1; // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_522A[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           Temp_object_Variable_2;                            // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5;                              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_5_0;                            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_6;                              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_522B[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable_6_0;                            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_Message;                              // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0160(0x0018)()
	int32                                         CallFunc_AkEventGlobal_ReturnValue;                // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_1;              // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_AkEventGlobal_ReturnValue_2;              // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_522C[0x3];                                     // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_AkEventGlobal_ReturnValue_3;              // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_522D[0x4];                                     // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue;   // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0198(0x0018)()
	int32                                         CallFunc_Len_ReturnValue;                          // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_522E[0x3];                                     // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class US6UI_UIManagerWidgetBase*              CallFunc_GetUIManagerWidget_ReturnValue;           // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_Checked;                // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_522F[0x7];                                     // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UValeriaGameUserSettings*               CallFunc_GetValeriaGameUserSettings_ReturnValue_1; // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x01D8(0x0018)()
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class US6UI_CustomNavigationGroup*      K2Node_ComponentBoundEvent_NavGroup;               // 0x01F8(0x0008)(ConstParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5230[0x4];                                     // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x0210(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsConsole_ReturnValue;                    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5231[0x6];                                     // 0x0222(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0228(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0240(0x0018)()
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast; // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM) == 0x000008, "Wrong alignment on WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM");
static_assert(sizeof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM) == 0x000268, "Wrong size on WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, EntryPoint) == 0x000000, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, CallFunc_GetAnnouncementUrl_ReturnValue) == 0x000008, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::CallFunc_GetAnnouncementUrl_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, K2Node_EnhancedInputActionEvent_ActionValue_2) == 0x000018, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::K2Node_EnhancedInputActionEvent_ActionValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, K2Node_EnhancedInputActionEvent_ElapsedTime_2) == 0x000038, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::K2Node_EnhancedInputActionEvent_ElapsedTime_2' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, K2Node_EnhancedInputActionEvent_TriggeredTime_2) == 0x00003C, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::K2Node_EnhancedInputActionEvent_TriggeredTime_2' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, K2Node_EnhancedInputActionEvent_SourceAction_2) == 0x000040, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::K2Node_EnhancedInputActionEvent_SourceAction_2' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, CallFunc_Conv_InputActionValueToAxis1D_ReturnValue) == 0x000048, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::CallFunc_Conv_InputActionValueToAxis1D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, Temp_object_Variable) == 0x000050, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, Temp_real_Variable) == 0x000058, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, Temp_real_Variable_0) == 0x000060, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, Temp_real_Variable_1) == 0x000068, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, Temp_real_Variable_2) == 0x000070, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::Temp_real_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, Temp_real_Variable_1_0) == 0x000078, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, K2Node_EnhancedInputActionEvent_ActionValue_1) == 0x000080, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::K2Node_EnhancedInputActionEvent_ActionValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, K2Node_EnhancedInputActionEvent_ElapsedTime_1) == 0x0000A0, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::K2Node_EnhancedInputActionEvent_ElapsedTime_1' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, K2Node_EnhancedInputActionEvent_TriggeredTime_1) == 0x0000A4, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::K2Node_EnhancedInputActionEvent_TriggeredTime_1' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, K2Node_EnhancedInputActionEvent_SourceAction_1) == 0x0000A8, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::K2Node_EnhancedInputActionEvent_SourceAction_1' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, Temp_object_Variable_1) == 0x0000B0, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x0000B8, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, Temp_real_Variable_3) == 0x0000C0, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::Temp_real_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, Temp_real_Variable_4) == 0x0000C8, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::Temp_real_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, Temp_real_Variable_3_0) == 0x0000D0, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::Temp_real_Variable_3_0' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, Temp_real_Variable_4_0) == 0x0000D8, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::Temp_real_Variable_4_0' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, Temp_bool_Variable) == 0x0000E0, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, K2Node_EnhancedInputActionEvent_ActionValue) == 0x0000E8, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000108, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00010C, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000110, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, CallFunc_Conv_InputActionValueToBool_ReturnValue_1) == 0x000118, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::CallFunc_Conv_InputActionValueToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, Temp_object_Variable_2) == 0x000120, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, Temp_real_Variable_5) == 0x000128, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::Temp_real_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, Temp_real_Variable_5_0) == 0x000130, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::Temp_real_Variable_5_0' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, Temp_real_Variable_6) == 0x000138, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::Temp_real_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, Temp_bool_Variable_1) == 0x000140, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, Temp_real_Variable_6_0) == 0x000148, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::Temp_real_Variable_6_0' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, K2Node_Event_Message) == 0x000150, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::K2Node_Event_Message' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, CallFunc_Conv_StringToText_ReturnValue) == 0x000160, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, CallFunc_AkEventGlobal_ReturnValue) == 0x000178, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::CallFunc_AkEventGlobal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, CallFunc_AkEventGlobal_ReturnValue_1) == 0x00017C, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::CallFunc_AkEventGlobal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, CallFunc_AkEventGlobal_ReturnValue_2) == 0x000180, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::CallFunc_AkEventGlobal_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, K2Node_Event_IsDesignTime) == 0x000184, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, CallFunc_AkEventGlobal_ReturnValue_3) == 0x000188, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::CallFunc_AkEventGlobal_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, CallFunc_GetValeriaGameUserSettings_ReturnValue) == 0x000190, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::CallFunc_GetValeriaGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000198, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, CallFunc_Len_ReturnValue) == 0x0001B0, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, CallFunc_Greater_IntInt_ReturnValue) == 0x0001B4, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, CallFunc_GetOwningPlayer_ReturnValue) == 0x0001B8, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, CallFunc_GetUIManagerWidget_ReturnValue) == 0x0001C0, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, K2Node_ComponentBoundEvent_Checked) == 0x0001C8, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::K2Node_ComponentBoundEvent_Checked' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, CallFunc_GetValeriaGameUserSettings_ReturnValue_1) == 0x0001D0, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::CallFunc_GetValeriaGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, Temp_text_Variable) == 0x0001D8, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0001F0, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, K2Node_ComponentBoundEvent_NavGroup) == 0x0001F8, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::K2Node_ComponentBoundEvent_NavGroup' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, CallFunc_GetScrollOffset_ReturnValue) == 0x000200, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000208, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, K2Node_MakeArray_Array) == 0x000210, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, CallFunc_IsConsole_ReturnValue) == 0x000220, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::CallFunc_IsConsole_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, Temp_bool_Variable_2) == 0x000221, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, Temp_text_Variable_1) == 0x000228, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, K2Node_Select_Default) == 0x000240, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000258, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM, CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast) == 0x000260, "Member 'WBP_AnnouncementsModalDialog_CM_C_ExecuteUbergraph_WBP_AnnouncementsModalDialog_CM::CallFunc_SetScrollOffset_NewScrollOffset_ImplicitCast' has a wrong offset!");

// Function WBP_AnnouncementsModalDialog_CM.WBP_AnnouncementsModalDialog_CM_C.Focus Check Box
// 0x0010 (0x0010 - 0x0000)
struct WBP_AnnouncementsModalDialog_CM_C_Focus_Check_Box final
{
public:
	EUINavigation                                 Param_Navigation;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5232[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AnnouncementsModalDialog_CM_C_Focus_Check_Box) == 0x000008, "Wrong alignment on WBP_AnnouncementsModalDialog_CM_C_Focus_Check_Box");
static_assert(sizeof(WBP_AnnouncementsModalDialog_CM_C_Focus_Check_Box) == 0x000010, "Wrong size on WBP_AnnouncementsModalDialog_CM_C_Focus_Check_Box");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_Focus_Check_Box, Param_Navigation) == 0x000000, "Member 'WBP_AnnouncementsModalDialog_CM_C_Focus_Check_Box::Param_Navigation' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_Focus_Check_Box, ReturnValue) == 0x000008, "Member 'WBP_AnnouncementsModalDialog_CM_C_Focus_Check_Box::ReturnValue' has a wrong offset!");

// Function WBP_AnnouncementsModalDialog_CM.WBP_AnnouncementsModalDialog_CM_C.HandleRefreshedMessageFromWeb
// 0x0010 (0x0010 - 0x0000)
struct WBP_AnnouncementsModalDialog_CM_C_HandleRefreshedMessageFromWeb final
{
public:
	class FString                                 Message;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AnnouncementsModalDialog_CM_C_HandleRefreshedMessageFromWeb) == 0x000008, "Wrong alignment on WBP_AnnouncementsModalDialog_CM_C_HandleRefreshedMessageFromWeb");
static_assert(sizeof(WBP_AnnouncementsModalDialog_CM_C_HandleRefreshedMessageFromWeb) == 0x000010, "Wrong size on WBP_AnnouncementsModalDialog_CM_C_HandleRefreshedMessageFromWeb");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_HandleRefreshedMessageFromWeb, Message) == 0x000000, "Member 'WBP_AnnouncementsModalDialog_CM_C_HandleRefreshedMessageFromWeb::Message' has a wrong offset!");

// Function WBP_AnnouncementsModalDialog_CM.WBP_AnnouncementsModalDialog_CM_C.InpActEvt_IA_UI_Confirm_Select_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_Confirm_Select_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_Confirm_Select_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_Confirm_Select_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_Confirm_Select_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_Confirm_Select_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_Confirm_Select_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_Confirm_Select_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_Confirm_Select_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_Confirm_Select_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_Confirm_Select_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_Confirm_Select_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_Confirm_Select_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_Confirm_Select_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WBP_AnnouncementsModalDialog_CM.WBP_AnnouncementsModalDialog_CM_C.InpActEvt_IA_UI_MoveCursor_Y_K2Node_EnhancedInputActionEvent_2
// 0x0030 (0x0030 - 0x0000)
struct WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_MoveCursor_Y_K2Node_EnhancedInputActionEvent_2 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_MoveCursor_Y_K2Node_EnhancedInputActionEvent_2) == 0x000008, "Wrong alignment on WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_MoveCursor_Y_K2Node_EnhancedInputActionEvent_2");
static_assert(sizeof(WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_MoveCursor_Y_K2Node_EnhancedInputActionEvent_2) == 0x000030, "Wrong size on WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_MoveCursor_Y_K2Node_EnhancedInputActionEvent_2");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_MoveCursor_Y_K2Node_EnhancedInputActionEvent_2, ActionValue) == 0x000000, "Member 'WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_MoveCursor_Y_K2Node_EnhancedInputActionEvent_2::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_MoveCursor_Y_K2Node_EnhancedInputActionEvent_2, ElapsedTime) == 0x000020, "Member 'WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_MoveCursor_Y_K2Node_EnhancedInputActionEvent_2::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_MoveCursor_Y_K2Node_EnhancedInputActionEvent_2, TriggeredTime) == 0x000024, "Member 'WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_MoveCursor_Y_K2Node_EnhancedInputActionEvent_2::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_MoveCursor_Y_K2Node_EnhancedInputActionEvent_2, SourceAction) == 0x000028, "Member 'WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_MoveCursor_Y_K2Node_EnhancedInputActionEvent_2::SourceAction' has a wrong offset!");

// Function WBP_AnnouncementsModalDialog_CM.WBP_AnnouncementsModalDialog_CM_C.InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_1
// 0x0030 (0x0030 - 0x0000)
struct WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_1 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_1) == 0x000008, "Wrong alignment on WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_1");
static_assert(sizeof(WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_1) == 0x000030, "Wrong size on WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_1");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_1, ActionValue) == 0x000000, "Member 'WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_1::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_1, ElapsedTime) == 0x000020, "Member 'WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_1::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_1, TriggeredTime) == 0x000024, "Member 'WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_1::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_1, SourceAction) == 0x000028, "Member 'WBP_AnnouncementsModalDialog_CM_C_InpActEvt_IA_UI_SwitchItem_K2Node_EnhancedInputActionEvent_1::SourceAction' has a wrong offset!");

// Function WBP_AnnouncementsModalDialog_CM.WBP_AnnouncementsModalDialog_CM_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_AnnouncementsModalDialog_CM_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AnnouncementsModalDialog_CM_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_AnnouncementsModalDialog_CM_C_PreConstruct");
static_assert(sizeof(WBP_AnnouncementsModalDialog_CM_C_PreConstruct) == 0x000001, "Wrong size on WBP_AnnouncementsModalDialog_CM_C_PreConstruct");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_AnnouncementsModalDialog_CM_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_AnnouncementsModalDialog_CM.WBP_AnnouncementsModalDialog_CM_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_AnnouncementsModalDialog_CM_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_AnnouncementsModalDialog_CM_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_AnnouncementsModalDialog_CM_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_AnnouncementsModalDialog_CM_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_AnnouncementsModalDialog_CM_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_AnnouncementsModalDialog_CM_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_AnnouncementsModalDialog_CM_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

