#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Login_PF

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Login_PF.WBP_Login_PF_C
// 0x0070 (0x0330 - 0x02C0)
class UWBP_Login_PF_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_LoginVideo_PF_C*                   LoginVideo;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        LoginWidgetSwitcher;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Connecting_PF_C*                   WBP_Connecting_PF;                                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LoginFlow_PF_C*                    WBP_LoginFlow_PF;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnLoginSuccess;                                    // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWBP_LoginFlow_PF_C*                    LoginFlowPtr;                                      // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 LinkSuccessContent;                                // 0x0300(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 LinkSuccessButton;                                 // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bSkipLink;                                         // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDoOnceOnConfirmLinkSuccess;                       // 0x0321(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDoOnceOnConfirmEULA;                              // 0x0322(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C54[0x5];                                     // 0x0323(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PregameUIManager_C*                CachePregameUIManager;                             // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void DoLogin();
	void ExecuteUbergraph_WBP_Login_PF(int32 EntryPoint, class US6UI_ModalWidgetBase* K2Node_CustomEvent_ModalWidget_3, TDelegate<void(class US6UI_ModalWidgetBase* ModalWidget)> K2Node_CreateDelegate_OutputDelegate, class US6UI_ModalWidgetBase* Temp_object_Variable, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_1, class UWBP_PopupLinkSuccess_PF_C* K2Node_DynamicCast_AsWBP_Popup_Link_Success_PF, bool K2Node_DynamicCast_bSuccess, class US6UI_ModalWidgetBase* K2Node_CustomEvent_ModalWidget_2, TDelegate<void(class US6UI_ModalWidgetBase* ModalWidget)> K2Node_CreateDelegate_OutputDelegate_2, class US6UI_ModalWidgetBase* Temp_object_Variable_1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_3, class UWBP_PopupEULA_CM_C* K2Node_DynamicCast_AsWBP_Popup_EULA_CM, bool K2Node_DynamicCast_bSuccess_1, class US6UI_ModalWidgetBase* K2Node_CustomEvent_ModalWidget_1, TDelegate<void(class US6UI_ModalWidgetBase* ModalWidget)> K2Node_CreateDelegate_OutputDelegate_4, class US6UI_ModalWidgetBase* Temp_object_Variable_2, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_5, class UWBP_PopupConfirmSkipLink_PF_C* K2Node_DynamicCast_AsWBP_Popup_Confirm_Skip_Link_PF, bool K2Node_DynamicCast_bSuccess_2, class US6UI_ModalWidgetBase* K2Node_CustomEvent_ModalWidget, TDelegate<void(class US6UI_ModalWidgetBase* ModalWidget)> K2Node_CreateDelegate_OutputDelegate_6, class US6UI_ModalWidgetBase* Temp_object_Variable_3, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_7, const class FString& K2Node_CustomEvent_ErrorMessage, int32 K2Node_CustomEvent_ErrorCode, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_8, class UAuthManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_9, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_10, TDelegate<void(const class FString& ErrorMessage, int32 ErrorCode)> K2Node_CreateDelegate_OutputDelegate_11, bool CallFunc_Not_PreBool_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_12, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class US6UI_AsyncAction_OpenModal* CallFunc_OpenModal_ReturnValue, class UAuthManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_1, bool CallFunc_IsValid_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_1, class US6UI_AsyncAction_OpenModal* CallFunc_OpenModal_ReturnValue_1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_13, bool CallFunc_IsValid_ReturnValue_1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_14, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_2, class US6UI_AsyncAction_OpenModal* CallFunc_OpenModal_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_2, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_15, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_3, class US6UI_AsyncAction_OpenModal* CallFunc_OpenModal_ReturnValue_3, class UAuthManager* CallFunc_GetLocalPlayerSubsystem_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_3, TDelegate<void(const class FString& ErrorMessage, int32 ErrorCode)> K2Node_CreateDelegate_OutputDelegate_16, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_4, class US6UI_UIManagerWidgetBase* CallFunc_GetUIManagerWidget_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_17, class UWBP_PregameUIManager_C* K2Node_DynamicCast_AsWBP_Pregame_UIManager, bool K2Node_DynamicCast_bSuccess_3, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_18, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_19, class UValeriaGameUserSettings* CallFunc_GetValeriaGameUserSettings_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, class UValeriaGameUserSettings* CallFunc_GetValeriaGameUserSettings_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue_2);
	void Handle_Linked_S6_Account_Successfully(class UValeriaGameUserSettings* CallFunc_GetValeriaGameUserSettings_ReturnValue);
	void Handle_Open_Privacy_Policy();
	void Handle_Open_Terms_Of_Service();
	void HandleOnLinkSuccessPopupDeactive();
	void HandleOnSkipLink();
	void HandleOnSkipLinkConfirm();
	void HandleOnSkipLinkPopupDeactive();
	void OnConfirmPrivacyNotice();
	void OnFailed_4942A25B45CCC8C681474CBB816D4748();
	void OnFailed_69EEF34C438321278CC4E2B5F61940F0();
	void OnFailed_6AB51AC54FE1B8489FBF4D9EA953BA58();
	void OnFailed_8A83A3D24866C908BA13D294B109BDEF();
	void OnLinkSuccess();
	void OnLoginFailure(const class FString& ErrorMessage, int32 ErrorCode);
	void OnLoginSuccess__DelegateSignature();
	void OnOpened_4942A25B45CCC8C681474CBB816D4748(class US6UI_ModalWidgetBase* ModalWidget);
	void OnOpened_69EEF34C438321278CC4E2B5F61940F0(class US6UI_ModalWidgetBase* ModalWidget);
	void OnOpened_6AB51AC54FE1B8489FBF4D9EA953BA58(class US6UI_ModalWidgetBase* ModalWidget);
	void OnOpened_8A83A3D24866C908BA13D294B109BDEF(class US6UI_ModalWidgetBase* ModalWidget);
	void Toggle_Connecting(bool IsConnecting);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Login_PF_C">();
	}
	static class UWBP_Login_PF_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Login_PF_C>();
	}
};
static_assert(alignof(UWBP_Login_PF_C) == 0x000008, "Wrong alignment on UWBP_Login_PF_C");
static_assert(sizeof(UWBP_Login_PF_C) == 0x000330, "Wrong size on UWBP_Login_PF_C");
static_assert(offsetof(UWBP_Login_PF_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_Login_PF_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Login_PF_C, LoginVideo) == 0x0002C8, "Member 'UWBP_Login_PF_C::LoginVideo' has a wrong offset!");
static_assert(offsetof(UWBP_Login_PF_C, LoginWidgetSwitcher) == 0x0002D0, "Member 'UWBP_Login_PF_C::LoginWidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UWBP_Login_PF_C, WBP_Connecting_PF) == 0x0002D8, "Member 'UWBP_Login_PF_C::WBP_Connecting_PF' has a wrong offset!");
static_assert(offsetof(UWBP_Login_PF_C, WBP_LoginFlow_PF) == 0x0002E0, "Member 'UWBP_Login_PF_C::WBP_LoginFlow_PF' has a wrong offset!");
static_assert(offsetof(UWBP_Login_PF_C, OnLoginSuccess) == 0x0002E8, "Member 'UWBP_Login_PF_C::OnLoginSuccess' has a wrong offset!");
static_assert(offsetof(UWBP_Login_PF_C, LoginFlowPtr) == 0x0002F8, "Member 'UWBP_Login_PF_C::LoginFlowPtr' has a wrong offset!");
static_assert(offsetof(UWBP_Login_PF_C, LinkSuccessContent) == 0x000300, "Member 'UWBP_Login_PF_C::LinkSuccessContent' has a wrong offset!");
static_assert(offsetof(UWBP_Login_PF_C, LinkSuccessButton) == 0x000310, "Member 'UWBP_Login_PF_C::LinkSuccessButton' has a wrong offset!");
static_assert(offsetof(UWBP_Login_PF_C, bSkipLink) == 0x000320, "Member 'UWBP_Login_PF_C::bSkipLink' has a wrong offset!");
static_assert(offsetof(UWBP_Login_PF_C, bDoOnceOnConfirmLinkSuccess) == 0x000321, "Member 'UWBP_Login_PF_C::bDoOnceOnConfirmLinkSuccess' has a wrong offset!");
static_assert(offsetof(UWBP_Login_PF_C, bDoOnceOnConfirmEULA) == 0x000322, "Member 'UWBP_Login_PF_C::bDoOnceOnConfirmEULA' has a wrong offset!");
static_assert(offsetof(UWBP_Login_PF_C, CachePregameUIManager) == 0x000328, "Member 'UWBP_Login_PF_C::CachePregameUIManager' has a wrong offset!");

}

