#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GpPopup_AlignedPopupBase

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_GpPopup_AlignedPopupBase.WBP_GpPopup_AlignedPopupBase_C.SetModalAlignment
// 0x0020 (0x0020 - 0x0000)
struct WBP_GpPopup_AlignedPopupBase_C_SetModalAlignment final
{
public:
	class UOverlaySlot*                           Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56A3[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GpPopup_AlignedPopupBase_C_SetModalAlignment) == 0x000008, "Wrong alignment on WBP_GpPopup_AlignedPopupBase_C_SetModalAlignment");
static_assert(sizeof(WBP_GpPopup_AlignedPopupBase_C_SetModalAlignment) == 0x000020, "Wrong size on WBP_GpPopup_AlignedPopupBase_C_SetModalAlignment");
static_assert(offsetof(WBP_GpPopup_AlignedPopupBase_C_SetModalAlignment, Widget) == 0x000000, "Member 'WBP_GpPopup_AlignedPopupBase_C_SetModalAlignment::Widget' has a wrong offset!");
static_assert(offsetof(WBP_GpPopup_AlignedPopupBase_C_SetModalAlignment, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'WBP_GpPopup_AlignedPopupBase_C_SetModalAlignment::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GpPopup_AlignedPopupBase_C_SetModalAlignment, K2Node_MakeStruct_Margin) == 0x00000C, "Member 'WBP_GpPopup_AlignedPopupBase_C_SetModalAlignment::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_GpPopup_AlignedPopupBase_C_SetModalAlignment, K2Node_SwitchEnum_CmpSuccess_1) == 0x00001C, "Member 'WBP_GpPopup_AlignedPopupBase_C_SetModalAlignment::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

// Function WBP_GpPopup_AlignedPopupBase.WBP_GpPopup_AlignedPopupBase_C.SetupWidget
// 0x0048 (0x0048 - 0x0000)
struct WBP_GpPopup_AlignedPopupBase_C_SetupWidget final
{
public:
	class UGameplayInteractivePopupDataAsset*     PopupConfig;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UVAL_AlignedPopupType*            K2Node_DynamicCast_AsAligned_Modal_Type;           // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56A4[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56A5[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_GPPopup_QuickModal_C*              CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_GPPopup_TutorialModal_C*           CallFunc_Create_ReturnValue_1;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_AddChildToOverlay_ReturnValue_1;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_GpPopup_AlignedPopupBase_C_SetupWidget) == 0x000008, "Wrong alignment on WBP_GpPopup_AlignedPopupBase_C_SetupWidget");
static_assert(sizeof(WBP_GpPopup_AlignedPopupBase_C_SetupWidget) == 0x000048, "Wrong size on WBP_GpPopup_AlignedPopupBase_C_SetupWidget");
static_assert(offsetof(WBP_GpPopup_AlignedPopupBase_C_SetupWidget, PopupConfig) == 0x000000, "Member 'WBP_GpPopup_AlignedPopupBase_C_SetupWidget::PopupConfig' has a wrong offset!");
static_assert(offsetof(WBP_GpPopup_AlignedPopupBase_C_SetupWidget, K2Node_DynamicCast_AsAligned_Modal_Type) == 0x000008, "Member 'WBP_GpPopup_AlignedPopupBase_C_SetupWidget::K2Node_DynamicCast_AsAligned_Modal_Type' has a wrong offset!");
static_assert(offsetof(WBP_GpPopup_AlignedPopupBase_C_SetupWidget, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_GpPopup_AlignedPopupBase_C_SetupWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GpPopup_AlignedPopupBase_C_SetupWidget, K2Node_SwitchEnum_CmpSuccess) == 0x000011, "Member 'WBP_GpPopup_AlignedPopupBase_C_SetupWidget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_GpPopup_AlignedPopupBase_C_SetupWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'WBP_GpPopup_AlignedPopupBase_C_SetupWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_GpPopup_AlignedPopupBase_C_SetupWidget, CallFunc_Create_ReturnValue) == 0x000028, "Member 'WBP_GpPopup_AlignedPopupBase_C_SetupWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GpPopup_AlignedPopupBase_C_SetupWidget, CallFunc_Create_ReturnValue_1) == 0x000030, "Member 'WBP_GpPopup_AlignedPopupBase_C_SetupWidget::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_GpPopup_AlignedPopupBase_C_SetupWidget, CallFunc_AddChildToOverlay_ReturnValue) == 0x000038, "Member 'WBP_GpPopup_AlignedPopupBase_C_SetupWidget::CallFunc_AddChildToOverlay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_GpPopup_AlignedPopupBase_C_SetupWidget, CallFunc_AddChildToOverlay_ReturnValue_1) == 0x000040, "Member 'WBP_GpPopup_AlignedPopupBase_C_SetupWidget::CallFunc_AddChildToOverlay_ReturnValue_1' has a wrong offset!");

}

