#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ChatBubble

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "F_ChatBubbleTarget_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_ChatBubble.WBP_ChatBubble_C.CanShowBubble
// 0x0020 (0x0020 - 0x0000)
struct WBP_ChatBubble_C_CanShowBubble final
{
public:
	bool                                          Allowed;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanShow;                                           // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6021[0x5];                                     // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCharacterStateMachineComponent*        CallFunc_GetCSM_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECharacterState                               CallFunc_GetCurrentStateType_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ChatBubble_C_CanShowBubble) == 0x000008, "Wrong alignment on WBP_ChatBubble_C_CanShowBubble");
static_assert(sizeof(WBP_ChatBubble_C_CanShowBubble) == 0x000020, "Wrong size on WBP_ChatBubble_C_CanShowBubble");
static_assert(offsetof(WBP_ChatBubble_C_CanShowBubble, Allowed) == 0x000000, "Member 'WBP_ChatBubble_C_CanShowBubble::Allowed' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_CanShowBubble, CanShow) == 0x000001, "Member 'WBP_ChatBubble_C_CanShowBubble::CanShow' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_CanShowBubble, CallFunc_GetValeriaCharacter_OutResult) == 0x000002, "Member 'WBP_ChatBubble_C_CanShowBubble::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_CanShowBubble, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000008, "Member 'WBP_ChatBubble_C_CanShowBubble::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_CanShowBubble, CallFunc_GetCSM_ReturnValue) == 0x000010, "Member 'WBP_ChatBubble_C_CanShowBubble::CallFunc_GetCSM_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_CanShowBubble, CallFunc_GetCurrentStateType_ReturnValue) == 0x000018, "Member 'WBP_ChatBubble_C_CanShowBubble::CallFunc_GetCurrentStateType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_CanShowBubble, K2Node_SwitchEnum_CmpSuccess) == 0x000019, "Member 'WBP_ChatBubble_C_CanShowBubble::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_CanShowBubble, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001A, "Member 'WBP_ChatBubble_C_CanShowBubble::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_CanShowBubble, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00001B, "Member 'WBP_ChatBubble_C_CanShowBubble::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_CanShowBubble, CallFunc_Not_PreBool_ReturnValue) == 0x00001C, "Member 'WBP_ChatBubble_C_CanShowBubble::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_CanShowBubble, CallFunc_Not_PreBool_ReturnValue_1) == 0x00001D, "Member 'WBP_ChatBubble_C_CanShowBubble::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_CanShowBubble, CallFunc_BooleanAND_ReturnValue) == 0x00001E, "Member 'WBP_ChatBubble_C_CanShowBubble::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_ChatBubble.WBP_ChatBubble_C.DisplayMessage
// 0x0068 (0x0068 - 0x0000)
struct WBP_ChatBubble_C_DisplayMessage final
{
public:
	struct FValeriaChatMessage                    Message;                                           // 0x0000(0x0068)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_ChatBubble_C_DisplayMessage) == 0x000008, "Wrong alignment on WBP_ChatBubble_C_DisplayMessage");
static_assert(sizeof(WBP_ChatBubble_C_DisplayMessage) == 0x000068, "Wrong size on WBP_ChatBubble_C_DisplayMessage");
static_assert(offsetof(WBP_ChatBubble_C_DisplayMessage, Message) == 0x000000, "Member 'WBP_ChatBubble_C_DisplayMessage::Message' has a wrong offset!");

// Function WBP_ChatBubble.WBP_ChatBubble_C.ExecuteUbergraph_WBP_ChatBubble
// 0x0098 (0x0098 - 0x0000)
struct WBP_ChatBubble_C_ExecuteUbergraph_WBP_ChatBubble final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6022[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6023[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FValeriaChatMessage                    K2Node_Event_Message;                              // 0x0028(0x0068)(ConstParm)
	bool                                          CallFunc_CanShowBubble_Allowed;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ChatBubble_C_ExecuteUbergraph_WBP_ChatBubble) == 0x000008, "Wrong alignment on WBP_ChatBubble_C_ExecuteUbergraph_WBP_ChatBubble");
static_assert(sizeof(WBP_ChatBubble_C_ExecuteUbergraph_WBP_ChatBubble) == 0x000098, "Wrong size on WBP_ChatBubble_C_ExecuteUbergraph_WBP_ChatBubble");
static_assert(offsetof(WBP_ChatBubble_C_ExecuteUbergraph_WBP_ChatBubble, EntryPoint) == 0x000000, "Member 'WBP_ChatBubble_C_ExecuteUbergraph_WBP_ChatBubble::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_ExecuteUbergraph_WBP_ChatBubble, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'WBP_ChatBubble_C_ExecuteUbergraph_WBP_ChatBubble::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_ExecuteUbergraph_WBP_ChatBubble, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_ChatBubble_C_ExecuteUbergraph_WBP_ChatBubble::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_ExecuteUbergraph_WBP_ChatBubble, K2Node_Event_IsDesignTime) == 0x000020, "Member 'WBP_ChatBubble_C_ExecuteUbergraph_WBP_ChatBubble::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_ExecuteUbergraph_WBP_ChatBubble, K2Node_Event_Message) == 0x000028, "Member 'WBP_ChatBubble_C_ExecuteUbergraph_WBP_ChatBubble::K2Node_Event_Message' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_ExecuteUbergraph_WBP_ChatBubble, CallFunc_CanShowBubble_Allowed) == 0x000090, "Member 'WBP_ChatBubble_C_ExecuteUbergraph_WBP_ChatBubble::CallFunc_CanShowBubble_Allowed' has a wrong offset!");

// Function WBP_ChatBubble.WBP_ChatBubble_C.InitializeText
// 0x02B0 (0x02B0 - 0x0000)
struct WBP_ChatBubble_C_InitializeText final
{
public:
	struct FValeriaChatMessage                    Message;                                           // 0x0000(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   TargetText;                                        // 0x0068(0x0018)(Edit, BlueprintVisible)
	struct FLinearColor                           PrefixColor;                                       // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   PrefixText;                                        // 0x0090(0x0018)(Edit, BlueprintVisible)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00A8(0x0050)(HasGetValueTypeHash)
	struct FF_ChatBubbleTarget                    CallFunc_Map_Find_Value;                           // 0x00F8(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6024[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0120(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0138(0x0050)(HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ColorToHexString_ReturnValue;             // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x01A8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x01C0(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0210(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0260(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0270(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0280(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0298(0x0018)()
};
static_assert(alignof(WBP_ChatBubble_C_InitializeText) == 0x000008, "Wrong alignment on WBP_ChatBubble_C_InitializeText");
static_assert(sizeof(WBP_ChatBubble_C_InitializeText) == 0x0002B0, "Wrong size on WBP_ChatBubble_C_InitializeText");
static_assert(offsetof(WBP_ChatBubble_C_InitializeText, Message) == 0x000000, "Member 'WBP_ChatBubble_C_InitializeText::Message' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_InitializeText, TargetText) == 0x000068, "Member 'WBP_ChatBubble_C_InitializeText::TargetText' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_InitializeText, PrefixColor) == 0x000080, "Member 'WBP_ChatBubble_C_InitializeText::PrefixColor' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_InitializeText, PrefixText) == 0x000090, "Member 'WBP_ChatBubble_C_InitializeText::PrefixText' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_InitializeText, K2Node_MakeStruct_FormatArgumentData) == 0x0000A8, "Member 'WBP_ChatBubble_C_InitializeText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_InitializeText, CallFunc_Map_Find_Value) == 0x0000F8, "Member 'WBP_ChatBubble_C_InitializeText::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_InitializeText, CallFunc_Map_Find_ReturnValue) == 0x000118, "Member 'WBP_ChatBubble_C_InitializeText::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_InitializeText, CallFunc_Conv_StringToText_ReturnValue) == 0x000120, "Member 'WBP_ChatBubble_C_InitializeText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_InitializeText, K2Node_MakeStruct_FormatArgumentData_1) == 0x000138, "Member 'WBP_ChatBubble_C_InitializeText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_InitializeText, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000188, "Member 'WBP_ChatBubble_C_InitializeText::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_InitializeText, CallFunc_ColorToHexString_ReturnValue) == 0x000198, "Member 'WBP_ChatBubble_C_InitializeText::CallFunc_ColorToHexString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_InitializeText, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0001A8, "Member 'WBP_ChatBubble_C_InitializeText::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_InitializeText, K2Node_MakeStruct_FormatArgumentData_2) == 0x0001C0, "Member 'WBP_ChatBubble_C_InitializeText::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_InitializeText, K2Node_MakeStruct_FormatArgumentData_3) == 0x000210, "Member 'WBP_ChatBubble_C_InitializeText::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_InitializeText, K2Node_MakeArray_Array) == 0x000260, "Member 'WBP_ChatBubble_C_InitializeText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_InitializeText, K2Node_MakeArray_Array_1) == 0x000270, "Member 'WBP_ChatBubble_C_InitializeText::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_InitializeText, CallFunc_Format_ReturnValue) == 0x000280, "Member 'WBP_ChatBubble_C_InitializeText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ChatBubble_C_InitializeText, CallFunc_Format_ReturnValue_1) == 0x000298, "Member 'WBP_ChatBubble_C_InitializeText::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function WBP_ChatBubble.WBP_ChatBubble_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ChatBubble_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ChatBubble_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ChatBubble_C_PreConstruct");
static_assert(sizeof(WBP_ChatBubble_C_PreConstruct) == 0x000001, "Wrong size on WBP_ChatBubble_C_PreConstruct");
static_assert(offsetof(WBP_ChatBubble_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ChatBubble_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

