#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CommonUIButtonPrompt_Styled

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "S6Core_structs.hpp"
#include "UMG_structs.hpp"
#include "F_CommonUIButtonPrompt_structs.hpp"


namespace SDK::Params
{

// Function WBP_CommonUIButtonPrompt_Styled.WBP_CommonUIButtonPrompt_Styled_C.ExecuteUbergraph_WBP_CommonUIButtonPrompt_Styled
// 0x0030 (0x0030 - 0x0000)
struct WBP_CommonUIButtonPrompt_Styled_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt_Styled final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50CA[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              K2Node_CustomEvent_bNewInputType;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERedirectsPlatform                            CallFunc_GetPlatformType_ReturnValue;              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50CB[0x6];                                     // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonUIButtonPrompt_Styled_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt_Styled) == 0x000008, "Wrong alignment on WBP_CommonUIButtonPrompt_Styled_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt_Styled");
static_assert(sizeof(WBP_CommonUIButtonPrompt_Styled_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt_Styled) == 0x000030, "Wrong size on WBP_CommonUIButtonPrompt_Styled_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt_Styled");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt_Styled, EntryPoint) == 0x000000, "Member 'WBP_CommonUIButtonPrompt_Styled_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt_Styled::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt_Styled, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_CommonUIButtonPrompt_Styled_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt_Styled::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt_Styled, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_CommonUIButtonPrompt_Styled_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt_Styled::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt_Styled, K2Node_CustomEvent_bNewInputType) == 0x000018, "Member 'WBP_CommonUIButtonPrompt_Styled_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt_Styled::K2Node_CustomEvent_bNewInputType' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt_Styled, CallFunc_GetPlatformType_ReturnValue) == 0x000019, "Member 'WBP_CommonUIButtonPrompt_Styled_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt_Styled::CallFunc_GetPlatformType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt_Styled, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x000020, "Member 'WBP_CommonUIButtonPrompt_Styled_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt_Styled::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt_Styled, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000028, "Member 'WBP_CommonUIButtonPrompt_Styled_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt_Styled::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt_Styled, CallFunc_GetCurrentInputType_ReturnValue) == 0x000029, "Member 'WBP_CommonUIButtonPrompt_Styled_C_ExecuteUbergraph_WBP_CommonUIButtonPrompt_Styled::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");

// Function WBP_CommonUIButtonPrompt_Styled.WBP_CommonUIButtonPrompt_Styled_C.GetPromptItemByIA
// 0x0080 (0x0080 - 0x0000)
struct WBP_CommonUIButtonPrompt_Styled_C_GetPromptItemByIA final
{
public:
	class UInputAction*                           Input_Action;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHold;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50CC[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CommonUIButtonPromptItem_C*        PromptItem;                                        // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50CD[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UInputAction*, class UWBP_CommonUIButtonPromptItem_C*> K2Node_Select_Default;                             // 0x0020(0x0050)(ContainsInstancedReference)
	class UWBP_CommonUIButtonPromptItem_C*        CallFunc_Map_Find_Value;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonUIButtonPrompt_Styled_C_GetPromptItemByIA) == 0x000008, "Wrong alignment on WBP_CommonUIButtonPrompt_Styled_C_GetPromptItemByIA");
static_assert(sizeof(WBP_CommonUIButtonPrompt_Styled_C_GetPromptItemByIA) == 0x000080, "Wrong size on WBP_CommonUIButtonPrompt_Styled_C_GetPromptItemByIA");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_GetPromptItemByIA, Input_Action) == 0x000000, "Member 'WBP_CommonUIButtonPrompt_Styled_C_GetPromptItemByIA::Input_Action' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_GetPromptItemByIA, IsHold) == 0x000008, "Member 'WBP_CommonUIButtonPrompt_Styled_C_GetPromptItemByIA::IsHold' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_GetPromptItemByIA, PromptItem) == 0x000010, "Member 'WBP_CommonUIButtonPrompt_Styled_C_GetPromptItemByIA::PromptItem' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_GetPromptItemByIA, Temp_bool_Variable) == 0x000018, "Member 'WBP_CommonUIButtonPrompt_Styled_C_GetPromptItemByIA::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_GetPromptItemByIA, K2Node_Select_Default) == 0x000020, "Member 'WBP_CommonUIButtonPrompt_Styled_C_GetPromptItemByIA::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_GetPromptItemByIA, CallFunc_Map_Find_Value) == 0x000070, "Member 'WBP_CommonUIButtonPrompt_Styled_C_GetPromptItemByIA::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_GetPromptItemByIA, CallFunc_Map_Find_ReturnValue) == 0x000078, "Member 'WBP_CommonUIButtonPrompt_Styled_C_GetPromptItemByIA::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_CommonUIButtonPrompt_Styled.WBP_CommonUIButtonPrompt_Styled_C.GetSpecialPromptItem
// 0x0028 (0x0028 - 0x0000)
struct WBP_CommonUIButtonPrompt_Styled_C_GetSpecialPromptItem final
{
public:
	class FString                                 SpecialName;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UWBP_CommonUIButtonPromptItem_C*        PromptItem;                                        // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_CommonUIButtonPromptItem_C*        CallFunc_Map_Find_Value;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonUIButtonPrompt_Styled_C_GetSpecialPromptItem) == 0x000008, "Wrong alignment on WBP_CommonUIButtonPrompt_Styled_C_GetSpecialPromptItem");
static_assert(sizeof(WBP_CommonUIButtonPrompt_Styled_C_GetSpecialPromptItem) == 0x000028, "Wrong size on WBP_CommonUIButtonPrompt_Styled_C_GetSpecialPromptItem");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_GetSpecialPromptItem, SpecialName) == 0x000000, "Member 'WBP_CommonUIButtonPrompt_Styled_C_GetSpecialPromptItem::SpecialName' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_GetSpecialPromptItem, PromptItem) == 0x000010, "Member 'WBP_CommonUIButtonPrompt_Styled_C_GetSpecialPromptItem::PromptItem' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_GetSpecialPromptItem, CallFunc_Map_Find_Value) == 0x000018, "Member 'WBP_CommonUIButtonPrompt_Styled_C_GetSpecialPromptItem::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_GetSpecialPromptItem, CallFunc_Map_Find_ReturnValue) == 0x000020, "Member 'WBP_CommonUIButtonPrompt_Styled_C_GetSpecialPromptItem::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_CommonUIButtonPrompt_Styled.WBP_CommonUIButtonPrompt_Styled_C.HandleOnInputMethodChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_CommonUIButtonPrompt_Styled_C_HandleOnInputMethodChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonUIButtonPrompt_Styled_C_HandleOnInputMethodChanged) == 0x000001, "Wrong alignment on WBP_CommonUIButtonPrompt_Styled_C_HandleOnInputMethodChanged");
static_assert(sizeof(WBP_CommonUIButtonPrompt_Styled_C_HandleOnInputMethodChanged) == 0x000001, "Wrong size on WBP_CommonUIButtonPrompt_Styled_C_HandleOnInputMethodChanged");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_HandleOnInputMethodChanged, bNewInputType) == 0x000000, "Member 'WBP_CommonUIButtonPrompt_Styled_C_HandleOnInputMethodChanged::bNewInputType' has a wrong offset!");

// Function WBP_CommonUIButtonPrompt_Styled.WBP_CommonUIButtonPrompt_Styled_C.InitUIButtonPromptByArray
// 0x0098 (0x0098 - 0x0000)
struct WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray final
{
public:
	TArray<struct FF_CommonUIButtonPrompt>        ItemInfos;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50CE[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50CF[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CommonUIButtonPromptItem_C*        CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FF_CommonUIButtonPrompt>        K2Node_Select_Default;                             // 0x0038(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50D0[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FF_CommonUIButtonPrompt                CallFunc_Array_Get_Item;                           // 0x0050(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray) == 0x000008, "Wrong alignment on WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray");
static_assert(sizeof(WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray) == 0x000098, "Wrong size on WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray, ItemInfos) == 0x000000, "Member 'WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray::ItemInfos' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray, CallFunc_Array_IsNotEmpty_ReturnValue) == 0x000014, "Member 'WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray::CallFunc_Array_IsNotEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray, Temp_bool_Variable) == 0x000020, "Member 'WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray, CallFunc_Create_ReturnValue) == 0x000028, "Member 'WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000030, "Member 'WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray, K2Node_Select_Default) == 0x000038, "Member 'WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray, CallFunc_Array_Get_Item) == 0x000050, "Member 'WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray, CallFunc_IsEmpty_ReturnValue) == 0x000091, "Member 'WBP_CommonUIButtonPrompt_Styled_C_InitUIButtonPromptByArray::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");

// Function WBP_CommonUIButtonPrompt_Styled.WBP_CommonUIButtonPrompt_Styled_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CommonUIButtonPrompt_Styled_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonUIButtonPrompt_Styled_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CommonUIButtonPrompt_Styled_C_PreConstruct");
static_assert(sizeof(WBP_CommonUIButtonPrompt_Styled_C_PreConstruct) == 0x000001, "Wrong size on WBP_CommonUIButtonPrompt_Styled_C_PreConstruct");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CommonUIButtonPrompt_Styled_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CommonUIButtonPrompt_Styled.WBP_CommonUIButtonPrompt_Styled_C.SetAllPromptItemVisibility
// 0x0040 (0x0040 - 0x0000)
struct WBP_CommonUIButtonPrompt_Styled_C_SetAllPromptItemVisibility final
{
public:
	bool                                          IsShow;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50D1[0x1];                                     // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50D2[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50D3[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonUIButtonPrompt_Styled_C_SetAllPromptItemVisibility) == 0x000008, "Wrong alignment on WBP_CommonUIButtonPrompt_Styled_C_SetAllPromptItemVisibility");
static_assert(sizeof(WBP_CommonUIButtonPrompt_Styled_C_SetAllPromptItemVisibility) == 0x000040, "Wrong size on WBP_CommonUIButtonPrompt_Styled_C_SetAllPromptItemVisibility");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_SetAllPromptItemVisibility, IsShow) == 0x000000, "Member 'WBP_CommonUIButtonPrompt_Styled_C_SetAllPromptItemVisibility::IsShow' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_SetAllPromptItemVisibility, Temp_byte_Variable) == 0x000001, "Member 'WBP_CommonUIButtonPrompt_Styled_C_SetAllPromptItemVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_SetAllPromptItemVisibility, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_CommonUIButtonPrompt_Styled_C_SetAllPromptItemVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_SetAllPromptItemVisibility, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_CommonUIButtonPrompt_Styled_C_SetAllPromptItemVisibility::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_SetAllPromptItemVisibility, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_CommonUIButtonPrompt_Styled_C_SetAllPromptItemVisibility::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_SetAllPromptItemVisibility, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_CommonUIButtonPrompt_Styled_C_SetAllPromptItemVisibility::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_SetAllPromptItemVisibility, Temp_bool_Variable) == 0x000010, "Member 'WBP_CommonUIButtonPrompt_Styled_C_SetAllPromptItemVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_SetAllPromptItemVisibility, CallFunc_GetAllChildren_ReturnValue) == 0x000018, "Member 'WBP_CommonUIButtonPrompt_Styled_C_SetAllPromptItemVisibility::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_SetAllPromptItemVisibility, K2Node_Select_Default) == 0x000028, "Member 'WBP_CommonUIButtonPrompt_Styled_C_SetAllPromptItemVisibility::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_SetAllPromptItemVisibility, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_CommonUIButtonPrompt_Styled_C_SetAllPromptItemVisibility::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_SetAllPromptItemVisibility, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_CommonUIButtonPrompt_Styled_C_SetAllPromptItemVisibility::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_SetAllPromptItemVisibility, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_CommonUIButtonPrompt_Styled_C_SetAllPromptItemVisibility::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_CommonUIButtonPrompt_Styled.WBP_CommonUIButtonPrompt_Styled_C.SetButtonPromptsToCenter
// 0x0008 (0x0008 - 0x0000)
struct WBP_CommonUIButtonPrompt_Styled_C_SetButtonPromptsToCenter final
{
public:
	class UBorderSlot*                            CallFunc_SlotAsBorderSlot_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonUIButtonPrompt_Styled_C_SetButtonPromptsToCenter) == 0x000008, "Wrong alignment on WBP_CommonUIButtonPrompt_Styled_C_SetButtonPromptsToCenter");
static_assert(sizeof(WBP_CommonUIButtonPrompt_Styled_C_SetButtonPromptsToCenter) == 0x000008, "Wrong size on WBP_CommonUIButtonPrompt_Styled_C_SetButtonPromptsToCenter");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_SetButtonPromptsToCenter, CallFunc_SlotAsBorderSlot_ReturnValue) == 0x000000, "Member 'WBP_CommonUIButtonPrompt_Styled_C_SetButtonPromptsToCenter::CallFunc_SlotAsBorderSlot_ReturnValue' has a wrong offset!");

// Function WBP_CommonUIButtonPrompt_Styled.WBP_CommonUIButtonPrompt_Styled_C.SetButtonPromptsVisibility
// 0x0006 (0x0006 - 0x0000)
struct WBP_CommonUIButtonPrompt_Styled_C_SetButtonPromptsVisibility final
{
public:
	ECommonInputType                              Input_Type;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonUIButtonPrompt_Styled_C_SetButtonPromptsVisibility) == 0x000001, "Wrong alignment on WBP_CommonUIButtonPrompt_Styled_C_SetButtonPromptsVisibility");
static_assert(sizeof(WBP_CommonUIButtonPrompt_Styled_C_SetButtonPromptsVisibility) == 0x000006, "Wrong size on WBP_CommonUIButtonPrompt_Styled_C_SetButtonPromptsVisibility");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_SetButtonPromptsVisibility, Input_Type) == 0x000000, "Member 'WBP_CommonUIButtonPrompt_Styled_C_SetButtonPromptsVisibility::Input_Type' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_SetButtonPromptsVisibility, Temp_bool_Variable) == 0x000001, "Member 'WBP_CommonUIButtonPrompt_Styled_C_SetButtonPromptsVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_SetButtonPromptsVisibility, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'WBP_CommonUIButtonPrompt_Styled_C_SetButtonPromptsVisibility::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_SetButtonPromptsVisibility, Temp_byte_Variable) == 0x000003, "Member 'WBP_CommonUIButtonPrompt_Styled_C_SetButtonPromptsVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_SetButtonPromptsVisibility, Temp_byte_Variable_1) == 0x000004, "Member 'WBP_CommonUIButtonPrompt_Styled_C_SetButtonPromptsVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_SetButtonPromptsVisibility, K2Node_Select_Default) == 0x000005, "Member 'WBP_CommonUIButtonPrompt_Styled_C_SetButtonPromptsVisibility::K2Node_Select_Default' has a wrong offset!");

// Function WBP_CommonUIButtonPrompt_Styled.WBP_CommonUIButtonPrompt_Styled_C.SetDescriptionByIA
// 0x0030 (0x0030 - 0x0000)
struct WBP_CommonUIButtonPrompt_Styled_C_SetDescriptionByIA final
{
public:
	class UInputAction*                           InputAction;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Description;                                       // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsHold;                                            // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50D4[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CommonUIButtonPromptItem_C*        CallFunc_GetPromptItemByIA_PromptItem;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonUIButtonPrompt_Styled_C_SetDescriptionByIA) == 0x000008, "Wrong alignment on WBP_CommonUIButtonPrompt_Styled_C_SetDescriptionByIA");
static_assert(sizeof(WBP_CommonUIButtonPrompt_Styled_C_SetDescriptionByIA) == 0x000030, "Wrong size on WBP_CommonUIButtonPrompt_Styled_C_SetDescriptionByIA");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_SetDescriptionByIA, InputAction) == 0x000000, "Member 'WBP_CommonUIButtonPrompt_Styled_C_SetDescriptionByIA::InputAction' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_SetDescriptionByIA, Description) == 0x000008, "Member 'WBP_CommonUIButtonPrompt_Styled_C_SetDescriptionByIA::Description' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_SetDescriptionByIA, IsHold) == 0x000020, "Member 'WBP_CommonUIButtonPrompt_Styled_C_SetDescriptionByIA::IsHold' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_SetDescriptionByIA, CallFunc_GetPromptItemByIA_PromptItem) == 0x000028, "Member 'WBP_CommonUIButtonPrompt_Styled_C_SetDescriptionByIA::CallFunc_GetPromptItemByIA_PromptItem' has a wrong offset!");

// Function WBP_CommonUIButtonPrompt_Styled.WBP_CommonUIButtonPrompt_Styled_C.SetPromptItemVisibilityByIA
// 0x0020 (0x0020 - 0x0000)
struct WBP_CommonUIButtonPrompt_Styled_C_SetPromptItemVisibilityByIA final
{
public:
	class UInputAction*                           InputAction;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsShow;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHold;                                            // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50D5[0x5];                                     // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CommonUIButtonPromptItem_C*        CallFunc_GetPromptItemByIA_PromptItem;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CommonUIButtonPrompt_Styled_C_SetPromptItemVisibilityByIA) == 0x000008, "Wrong alignment on WBP_CommonUIButtonPrompt_Styled_C_SetPromptItemVisibilityByIA");
static_assert(sizeof(WBP_CommonUIButtonPrompt_Styled_C_SetPromptItemVisibilityByIA) == 0x000020, "Wrong size on WBP_CommonUIButtonPrompt_Styled_C_SetPromptItemVisibilityByIA");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_SetPromptItemVisibilityByIA, InputAction) == 0x000000, "Member 'WBP_CommonUIButtonPrompt_Styled_C_SetPromptItemVisibilityByIA::InputAction' has a wrong offset!");
static_assert(offsetof(WBP_CommonUIButtonPrompt_Styled_C_SetPromptItemVisibilityByIA, IsShow) == 0x000008, "Member 'WBP_CommonUIButtonPrompt_Styled_C_SetPromptItemVisibilityByIA::IsShow' has a wrong offset!");
