#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CharacterCustomization_TabButtonsPanel_CM

#include "Basic.hpp"

#include "BP_CharacterCustomization_WardrobeButtonInfo_structs.hpp"


namespace SDK::Params
{

// Function WBP_CharacterCustomization_TabButtonsPanel_CM.WBP_CharacterCustomization_TabButtonsPanel_CM_C.ExecuteUbergraph_WBP_CharacterCustomization_TabButtonsPanel_CM
// 0x0060 (0x0060 - 0x0000)
struct WBP_CharacterCustomization_TabButtonsPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_TabButtonsPanel_CM final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4269[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class FName>                             K2Node_MakeSet_Set;                                // 0x0008(0x0050)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_TabButtonsPanel_CM) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_TabButtonsPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_TabButtonsPanel_CM");
static_assert(sizeof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_TabButtonsPanel_CM) == 0x000060, "Wrong size on WBP_CharacterCustomization_TabButtonsPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_TabButtonsPanel_CM");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_TabButtonsPanel_CM, EntryPoint) == 0x000000, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_TabButtonsPanel_CM::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_TabButtonsPanel_CM, K2Node_MakeSet_Set) == 0x000008, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_TabButtonsPanel_CM::K2Node_MakeSet_Set' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_TabButtonsPanel_CM, K2Node_Event_IsDesignTime) == 0x000058, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_ExecuteUbergraph_WBP_CharacterCustomization_TabButtonsPanel_CM::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_CharacterCustomization_TabButtonsPanel_CM.WBP_CharacterCustomization_TabButtonsPanel_CM_C.GenerateButtons
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_CharacterCustomization_TabButtonsPanel_CM_C_GenerateButtons final
{
public:
	TSet<class FName>                             ExcludedButtons;                                   // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_CharacterCustomization_TabButton_CM_C* Button)> K2Node_CreateDelegate_OutputDelegate;              // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_426A[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CharacterCustomization_TabButton_CM_C* CallFunc_Create_ReturnValue;                       // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FBP_CharacterCustomization_WardrobeButtonInfo CallFunc_Array_Get_Item;                           // 0x0080(0x0030)(ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_426B[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_GenerateButtons) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_TabButtonsPanel_CM_C_GenerateButtons");
static_assert(sizeof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_GenerateButtons) == 0x0000C0, "Wrong size on WBP_CharacterCustomization_TabButtonsPanel_CM_C_GenerateButtons");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_GenerateButtons, ExcludedButtons) == 0x000000, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_GenerateButtons::ExcludedButtons' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_GenerateButtons, Temp_int_Array_Index_Variable) == 0x000050, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_GenerateButtons::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_GenerateButtons, Temp_int_Loop_Counter_Variable) == 0x000054, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_GenerateButtons::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_GenerateButtons, CallFunc_Add_IntInt_ReturnValue) == 0x000058, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_GenerateButtons::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_GenerateButtons, K2Node_CreateDelegate_OutputDelegate) == 0x00005C, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_GenerateButtons::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_GenerateButtons, CallFunc_Create_ReturnValue) == 0x000070, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_GenerateButtons::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_GenerateButtons, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000078, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_GenerateButtons::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_GenerateButtons, CallFunc_Array_Get_Item) == 0x000080, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_GenerateButtons::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_GenerateButtons, CallFunc_Set_Contains_ReturnValue) == 0x0000B0, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_GenerateButtons::CallFunc_Set_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_GenerateButtons, CallFunc_Array_Length_ReturnValue) == 0x0000B4, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_GenerateButtons::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_GenerateButtons, CallFunc_Not_PreBool_ReturnValue) == 0x0000B8, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_GenerateButtons::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_GenerateButtons, CallFunc_Less_IntInt_ReturnValue) == 0x0000B9, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_GenerateButtons::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_CharacterCustomization_TabButtonsPanel_CM.WBP_CharacterCustomization_TabButtonsPanel_CM_C.GetActiveTabName
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterCustomization_TabButtonsPanel_CM_C_GetActiveTabName final
{
public:
	class FName                                   Param_Name;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_GetActiveTabName) == 0x000004, "Wrong alignment on WBP_CharacterCustomization_TabButtonsPanel_CM_C_GetActiveTabName");
static_assert(sizeof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_GetActiveTabName) == 0x000008, "Wrong size on WBP_CharacterCustomization_TabButtonsPanel_CM_C_GetActiveTabName");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_GetActiveTabName, Param_Name) == 0x000000, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_GetActiveTabName::Param_Name' has a wrong offset!");

// Function WBP_CharacterCustomization_TabButtonsPanel_CM.WBP_CharacterCustomization_TabButtonsPanel_CM_C.GetTabNames
// 0x0020 (0x0020 - 0x0000)
struct WBP_CharacterCustomization_TabButtonsPanel_CM_C_GetTabNames final
{
public:
	TArray<class FName>                           TabNames;                                          // 0x0000(0x0010)(Parm, OutParm)
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0010(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_GetTabNames) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_TabButtonsPanel_CM_C_GetTabNames");
static_assert(sizeof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_GetTabNames) == 0x000020, "Wrong size on WBP_CharacterCustomization_TabButtonsPanel_CM_C_GetTabNames");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_GetTabNames, TabNames) == 0x000000, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_GetTabNames::TabNames' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_GetTabNames, CallFunc_Map_Keys_Keys) == 0x000010, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_GetTabNames::CallFunc_Map_Keys_Keys' has a wrong offset!");

// Function WBP_CharacterCustomization_TabButtonsPanel_CM.WBP_CharacterCustomization_TabButtonsPanel_CM_C.HandleOnButtonClickedCM
// 0x0010 (0x0010 - 0x0000)
struct WBP_CharacterCustomization_TabButtonsPanel_CM_C_HandleOnButtonClickedCM final
{
public:
	class UWBP_CharacterCustomization_TabButton_CM_C* Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TrySetActiveTabName_Success;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_HandleOnButtonClickedCM) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_TabButtonsPanel_CM_C_HandleOnButtonClickedCM");
static_assert(sizeof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_HandleOnButtonClickedCM) == 0x000010, "Wrong size on WBP_CharacterCustomization_TabButtonsPanel_CM_C_HandleOnButtonClickedCM");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_HandleOnButtonClickedCM, Button) == 0x000000, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_HandleOnButtonClickedCM::Button' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_HandleOnButtonClickedCM, CallFunc_TrySetActiveTabName_Success) == 0x000008, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_HandleOnButtonClickedCM::CallFunc_TrySetActiveTabName_Success' has a wrong offset!");

// Function WBP_CharacterCustomization_TabButtonsPanel_CM.WBP_CharacterCustomization_TabButtonsPanel_CM_C.OnButtonClicked__DelegateSignature
// 0x0030 (0x0030 - 0x0000)
struct WBP_CharacterCustomization_TabButtonsPanel_CM_C_OnButtonClicked__DelegateSignature final
{
public:
	struct FBP_CharacterCustomization_WardrobeButtonInfo WardrobeButtonInfo;                                // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_OnButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_TabButtonsPanel_CM_C_OnButtonClicked__DelegateSignature");
static_assert(sizeof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_OnButtonClicked__DelegateSignature) == 0x000030, "Wrong size on WBP_CharacterCustomization_TabButtonsPanel_CM_C_OnButtonClicked__DelegateSignature");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_OnButtonClicked__DelegateSignature, WardrobeButtonInfo) == 0x000000, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_OnButtonClicked__DelegateSignature::WardrobeButtonInfo' has a wrong offset!");

// Function WBP_CharacterCustomization_TabButtonsPanel_CM.WBP_CharacterCustomization_TabButtonsPanel_CM_C.OnPostTabSetActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterCustomization_TabButtonsPanel_CM_C_OnPostTabSetActive__DelegateSignature final
{
public:
	class FName                                   TabName;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_OnPostTabSetActive__DelegateSignature) == 0x000004, "Wrong alignment on WBP_CharacterCustomization_TabButtonsPanel_CM_C_OnPostTabSetActive__DelegateSignature");
static_assert(sizeof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_OnPostTabSetActive__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterCustomization_TabButtonsPanel_CM_C_OnPostTabSetActive__DelegateSignature");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_OnPostTabSetActive__DelegateSignature, TabName) == 0x000000, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_OnPostTabSetActive__DelegateSignature::TabName' has a wrong offset!");

// Function WBP_CharacterCustomization_TabButtonsPanel_CM.WBP_CharacterCustomization_TabButtonsPanel_CM_C.OnPreTabSetActive__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CharacterCustomization_TabButtonsPanel_CM_C_OnPreTabSetActive__DelegateSignature final
{
public:
	class FName                                   Tab_Name;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_OnPreTabSetActive__DelegateSignature) == 0x000004, "Wrong alignment on WBP_CharacterCustomization_TabButtonsPanel_CM_C_OnPreTabSetActive__DelegateSignature");
static_assert(sizeof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_OnPreTabSetActive__DelegateSignature) == 0x000008, "Wrong size on WBP_CharacterCustomization_TabButtonsPanel_CM_C_OnPreTabSetActive__DelegateSignature");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_OnPreTabSetActive__DelegateSignature, Tab_Name) == 0x000000, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_OnPreTabSetActive__DelegateSignature::Tab_Name' has a wrong offset!");

// Function WBP_CharacterCustomization_TabButtonsPanel_CM.WBP_CharacterCustomization_TabButtonsPanel_CM_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CharacterCustomization_TabButtonsPanel_CM_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CharacterCustomization_TabButtonsPanel_CM_C_PreConstruct");
static_assert(sizeof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_PreConstruct) == 0x000001, "Wrong size on WBP_CharacterCustomization_TabButtonsPanel_CM_C_PreConstruct");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CharacterCustomization_TabButtonsPanel_CM.WBP_CharacterCustomization_TabButtonsPanel_CM_C.TrySetActiveTabName
// 0x0068 (0x0068 - 0x0000)
struct WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName final
{
public:
	class FName                                   TabName;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FoundTab;                                          // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_426C[0x2];                                     // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_CharacterCustomization_TabButton_CM_C* CallFunc_Map_Find_Value;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_426D[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CharacterCustomization_TabButton_CM_C* CallFunc_Map_Find_Value_1;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_426E[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0038(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_426F[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CharacterCustomization_TabButton_CM_C* CallFunc_Map_Find_Value_2;                         // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName");
static_assert(sizeof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName) == 0x000068, "Wrong size on WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName, TabName) == 0x000000, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName::TabName' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName, Success) == 0x000008, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName::Success' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName, FoundTab) == 0x000009, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName::FoundTab' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName, CallFunc_Map_Find_Value) == 0x000018, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName, CallFunc_Map_Find_ReturnValue) == 0x000020, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName, CallFunc_Map_Find_Value_1) == 0x000028, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName, CallFunc_Map_Find_ReturnValue_1) == 0x000030, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName, CallFunc_Map_Keys_Keys) == 0x000038, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName, CallFunc_Map_Find_Value_2) == 0x000058, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName, CallFunc_Map_Find_ReturnValue_2) == 0x000060, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName, CallFunc_Less_IntInt_ReturnValue) == 0x000061, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName, CallFunc_IsValid_ReturnValue) == 0x000062, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000063, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_TrySetActiveTabName::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function WBP_CharacterCustomization_TabButtonsPanel_CM.WBP_CharacterCustomization_TabButtonsPanel_CM_C.UpdateTabBadgeCount
// 0x0020 (0x0020 - 0x0000)
struct WBP_CharacterCustomization_TabButtonsPanel_CM_C_UpdateTabBadgeCount final
{
public:
	class FName                                   Tab_Name;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Badge_Number;                                      // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4270[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CharacterCustomization_TabButton_CM_C* CallFunc_Map_Find_Value;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_UpdateTabBadgeCount) == 0x000008, "Wrong alignment on WBP_CharacterCustomization_TabButtonsPanel_CM_C_UpdateTabBadgeCount");
static_assert(sizeof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_UpdateTabBadgeCount) == 0x000020, "Wrong size on WBP_CharacterCustomization_TabButtonsPanel_CM_C_UpdateTabBadgeCount");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_UpdateTabBadgeCount, Tab_Name) == 0x000000, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_UpdateTabBadgeCount::Tab_Name' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_UpdateTabBadgeCount, Badge_Number) == 0x000008, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_UpdateTabBadgeCount::Badge_Number' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_UpdateTabBadgeCount, CallFunc_Map_Find_Value) == 0x000010, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_UpdateTabBadgeCount::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_CharacterCustomization_TabButtonsPanel_CM_C_UpdateTabBadgeCount, CallFunc_Map_Find_ReturnValue) == 0x000018, "Member 'WBP_CharacterCustomization_TabButtonsPanel_CM_C_UpdateTabBadgeCount::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

}

