#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CrafterInWorld

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Palia_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CrafterInWorld.WBP_CrafterInWorld_C
// 0x00B0 (0x0370 - 0x02C0)
class UWBP_CrafterInWorld_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Cooking_Status_Background;                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CrafterInWorld_Item_C*             Cooking_Status_Item;                               // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Timer_Crafting_C*                  Cooking_Status_Timer;                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_93;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class US6UI_GridPanel*                        IngredientsGridPanel;                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class US6UI_GridPanel*                        InteractionsGridPanel;                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CrafterInWorld_Item_C*             WBP_CrafterInWorld_Item_1;                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Widget_Actions;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_Border_Styled*                   Widget_Collect;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Widget_ComplexCooking;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Widget_Cooking_Status;                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Cooking_Cue_Station_C*             Widget_RecipeCues;                                 // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Base;                               // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             OnClosed;                                          // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UCrafterComponent*                      CurrentCrafter;                                    // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	ECrafterState                                 CurrentCrafterState;                               // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61C2[0x7];                                     // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	FMulticastInlineDelegateProperty_             HandleCrafterChanged;                              // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UCrafterComponent*                      MainComplexCrafter;                                // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          HasCues;                                           // 0x0368(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Bind_ComplexCrafter_OnStateChanged();
	void BP_OnCrafterChanged(class UCrafterComponent* Crafter, int32 MaxColumnsInteractions, int32 MaxColumnsIngredients, int32 MaxVisibleColumnsInteractions, int32 MaxVisibleColumnsIngredients, int32 MaxColumns, bool CallFunc_IsValid_ReturnValue, int32 Temp_int_Variable, int32 CallFunc_Add_IntInt_ReturnValue, ESlateVisibility Temp_byte_Variable, ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue_1, int32 CallFunc_Max_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue, double CallFunc_Conv_IntToDouble_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue_1, int32 CallFunc_SelectInt_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue_2, int32 CallFunc_Subtract_IntInt_ReturnValue_3, int32 CallFunc_Max_ReturnValue_1, double CallFunc_Conv_IntToDouble_ReturnValue_1, int32 Temp_int_Variable_1, int32 CallFunc_SelectInt_ReturnValue_1, bool CallFunc_LessEqual_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_1, bool CallFunc_Greater_IntInt_ReturnValue_2, bool CallFunc_Greater_IntInt_ReturnValue_3, ESlateVisibility K2Node_Select_Default, int32 CallFunc_Max_ReturnValue_2, bool CallFunc_IsVisible_ReturnValue, int32 CallFunc_UpdateIngredients_AmountVisible, ECrafterState CallFunc_GetCrafterState_ReturnValue, int32 CallFunc_UpdateInteractions_AmountVisible, int32 CallFunc_Max_ReturnValue_3, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, float CallFunc_SetColumnFill_Coefficient_ImplicitCast, float CallFunc_SetColumnFill_Coefficient_ImplicitCast_1);
	void CalculateNumberOfColumns(int32 NumElements, int32* NumColumns, bool Temp_bool_Variable, bool CallFunc_EqualEqual_IntInt_ReturnValue, int32 Temp_int_Variable, int32 Temp_int_Variable_1, int32 K2Node_Select_Default);
	void ConsiderDisablingCueMode(bool CallFunc_ShouldBlockEnablingCueMode_ReturnValue);
	void Construct();
	void CrafterHandleComplexRecipeFinished(struct FComplexRecipeCrafter& CrafterRecord);
	void CrafterHandleComplexRecipeStarted(struct FComplexRecipeCrafter& CrafterRecord);
	void EnactRecipeSlots(class UPanelWidget* ParentPanel, TArray<int32>& Indices, TSubclassOf<class UUserWidget> WidgetToCreate, bool CharReachable, int32 NumColumns, bool Temp_bool_True_if_break_was_hit_Variable, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, int32 Temp_int_Array_Index_Variable, EValeriaFuncResult CallFunc_GetValeriaCharacter_OutResult, class AValeriaCharacter* CallFunc_GetValeriaCharacter_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, class UWidget* CallFunc_GetChildAt_ReturnValue, class UWBP_CrafterRecipeStep_Base_C* K2Node_DynamicCast_AsWBP_Crafter_Recipe_Step_Base, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_Array_Get_Item, class UGridSlot* CallFunc_SlotAsGridSlot_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	void ExecuteUbergraph_WBP_CrafterInWorld(int32 EntryPoint, class UCrafterComponent* K2Node_Event_Crafter, TDelegate<void(struct FCrafterConfig& MainCrafterConfig, struct FComplexRecipeRecord& RecipeRecord)> K2Node_CreateDelegate_OutputDelegate, class UCrafterComponent* CallFunc_Set_Current_Crafter_OutCrafter, TDelegate<void(struct FComplexRecipeRecord& RecipeRecord)> K2Node_CreateDelegate_OutputDelegate_1, TDelegate<void(struct FComplexRecipeRecord& RecipeRecord)> K2Node_CreateDelegate_OutputDelegate_2, struct FCrafterConfig& K2Node_CustomEvent_mainCrafterConfig, struct FComplexRecipeRecord& K2Node_CustomEvent_recipeRecord_2, struct FComplexRecipeRecord& K2Node_CustomEvent_recipeRecord_1, struct FComplexRecipeRecord& K2Node_CustomEvent_recipeRecord, class UCrafterComponent* K2Node_CustomEvent_Crafter, TDelegate<void(class UCrafterComponent* Crafter)> K2Node_CreateDelegate_OutputDelegate_3, ECrafterState CallFunc_GetCrafterState_ReturnValue, TDelegate<void(class UCrafterComponent* Crafter)> K2Node_CreateDelegate_OutputDelegate_4, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_5, TDelegate<void(struct FComplexRecipeRecord& ComplexState, struct FComplexRecipeCrafter& CrafterState, int32 RecipeIndex)> K2Node_CreateDelegate_OutputDelegate_6, struct FComplexRecipeRecord& K2Node_CustomEvent_complexState, struct FComplexRecipeCrafter& K2Node_CustomEvent_CrafterState, int32 K2Node_CustomEvent_recipeIndex, struct FComplexRecipeCrafter& K2Node_CustomEvent_crafterRecord, struct FComplexRecipeCrafter& K2Node_CustomEvent_crafterRecord_1, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, class UCookingSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_7, TDelegate<void()> K2Node_CreateDelegate_OutputDelegate_8);
	void GetRecipeItem(int32 RecipeConfigId, struct FValeriaItem* Item, EValeriaFuncResult CallFunc_FindRecipeConfigById_OutResult, const struct FRecipeConfig& CallFunc_FindRecipeConfigById_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, TSoftObjectPtr<class UVAL_ItemTypeDefinitionAsset> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue, const struct FValeriaItem& K2Node_MakeStruct_ValeriaItem);
	void HandleComplexRecipeExited(struct FComplexRecipeRecord& RecipeRecord);
	void HandleComplexRecipeFinishing(struct FComplexRecipeRecord& RecipeRecord);
	void HandleComplexRecipeJoin(struct FCrafterConfig& MainCrafterConfig, struct FComplexRecipeRecord& RecipeRecord);
	void HandleCrafterCameraChanged();
	void HandleCrafterChanged__DelegateSignature(class UObject* Crafter);
	void HandleOnComplexRecipeChanged();
	void HandleOnRecipeBrowse(struct FComplexRecipeRecord& ComplexState, struct FComplexRecipeCrafter& CrafterState, int32 RecipeIndex);
	void LinkOrUnlinkCrafter(class UCrafterComponent* Crafter);
	void OnClosed__DelegateSignature();
	void OnComplexCrafterStateChanged(class UCrafterComponent* Crafter);
	void OnTimerRedZoneThreshold();
	void Set_Current_Crafter(class UCrafterComponent* NewCrafter, class UCrafterComponent** OutCrafter, bool CallFunc_IsValid_ReturnValue, TDelegate<void(struct FComplexRecipeCrafter& CrafterRecord)> K2Node_CreateDelegate_OutputDelegate, TDelegate<void(struct FComplexRecipeCrafter& CrafterRecord)> K2Node_CreateDelegate_OutputDelegate_1, TDelegate<void(struct FComplexRecipeCrafter& CrafterRecord)> K2Node_CreateDelegate_OutputDelegate_2, TDelegate<void(struct FComplexRecipeCrafter& CrafterRecord)> K2Node_CreateDelegate_OutputDelegate_3, TDelegate<void(class UCrafterComponent* Crafter)> K2Node_CreateDelegate_OutputDelegate_4, TDelegate<void(class UCrafterComponent* Crafter)> K2Node_CreateDelegate_OutputDelegate_5, bool CallFunc_IsValid_ReturnValue_1);
	void SetCueMode(bool bCueMode, const struct FComplexRecipeCrafter& CrafterRecord, bool OldHasCues, bool CallFunc_NotEqual_BoolBool_ReturnValue, bool CallFunc_ShouldBlockEnablingCueMode_ReturnValue);
	void SetPanelItemCount(class UPanelWidget* ParentPanel, int32 DesiredChildCont, class UClass* WidgetToCreate, int32 NumColumns, const struct FMargin& K2Node_MakeStruct_Margin, const struct FAdditionalEnsureWidgetsOptions& K2Node_MakeStruct_AdditionalEnsureWidgetsOptions, bool CallFunc_Greater_IntInt_ReturnValue);
	bool ShouldBlockEnablingCueMode(ECrafterState CallFunc_GetCrafterState_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue);
	void Unbind_ComplexCrafter_OnStateChanged();
	void UpdateCraftTimer(class UCrafterComponent* Crafter, ECrafterState LocalState, int32 EndTime, int32 StartTime, struct FCrafterConfig& CallFunc_GetCrafterConfig_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, bool CallFunc_EqualEqual_ByteByte_ReturnValue_2, ECrafterState CallFunc_GetCrafterState_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_1, bool Temp_bool_Variable, bool Temp_bool_Variable_1, bool CallFunc_EqualEqual_ByteByte_ReturnValue_3, bool Temp_bool_Variable_2, bool CallFunc_EqualEqual_ByteByte_ReturnValue_4, bool CallFunc_Greater_IntInt_ReturnValue, int32 CallFunc_GetRecipeIdCrafting_ReturnValue, int32 CallFunc_GetCraftLimitTimes_startTime, int32 CallFunc_GetCraftLimitTimes_endTime, bool CallFunc_GetCraftLimitTimes_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_5, bool CallFunc_BooleanOR_ReturnValue_2, int32 CallFunc_GetCraftPhaseTimes_startTime, int32 CallFunc_GetCraftPhaseTimes_endTime, bool CallFunc_GetCraftPhaseTimes_ReturnValue, EValeriaFuncResult CallFunc_FindRecipeConfigById_OutResult, const struct FRecipeConfig& CallFunc_FindRecipeConfigById_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, bool Temp_bool_Variable_3, ECrafterMode Temp_byte_Variable, bool K2Node_Select_Default, bool CallFunc_BooleanAND_ReturnValue);
	void UpdateCraftTimerTint(bool CallFunc_IsRedZone_ReturnValue, const struct FLinearColor& CallFunc_SelectColor_ReturnValue);
	void UpdateIngredients(int32* AmountVisible, const TArray<struct FCrafterIngredient>& RequestedIngredients, const TArray<int32>& Indices, int32 NumRequests, bool Temp_bool_True_if_break_was_hit_Variable, int32 Temp_int_Array_Index_Variable, bool CallFunc_Not_PreBool_ReturnValue, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable_1, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, const struct FCrafterIngredient& CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, class UWidget* CallFunc_GetChildAt_ReturnValue, class UWBP_CrafterRecipeStep_Ingredient_C* K2Node_DynamicCast_AsWBP_Crafter_Recipe_Step_Ingredient, bool K2Node_DynamicCast_bSuccess, const struct FCrafterIngredient& CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Add_ReturnValue, class UGridSlot* CallFunc_SlotAsGridSlot_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_3, bool CallFunc_Less_IntInt_ReturnValue_1);
	void UpdateInteractions(int32* AmountVisible, const TArray<int32>& Indices, int32 NumRequests, int32 Temp_int_Variable, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_ShouldShowForInteraction_Show, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_GetNumberOfRequests_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue);
	void UpdateVisibility(class UCookingSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue, bool CallFunc_Client_GetLocalPlayerInCrafterCamera_ReturnValue, int32 CallFunc_GetRecipeIdCrafting_ReturnValue, bool CallFunc_IsComplexRecipe_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, struct FCrafterConfig& CallFunc_GetCrafterConfig_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess);

	void ShouldShowForInteraction(int32 Param_Index, bool* Show, const struct FRecipeStepConfig& CachedStep, const struct FRecipeStepConfig& CallFunc_GetRecipeStepConfig_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue) const;
	void ShouldShowForItemRequest(int32 Param_Index, bool* Show, const struct FRecipeStepConfig& CachedStep, const struct FRecipeStepConfig& CallFunc_GetRecipeStepConfig_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CrafterInWorld_C">();
	}
	static class UWBP_CrafterInWorld_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CrafterInWorld_C>();
	}
};
static_assert(alignof(UWBP_CrafterInWorld_C) == 0x000008, "Wrong alignment on UWBP_CrafterInWorld_C");
static_assert(sizeof(UWBP_CrafterInWorld_C) == 0x000370, "Wrong size on UWBP_CrafterInWorld_C");
static_assert(offsetof(UWBP_CrafterInWorld_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_CrafterInWorld_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterInWorld_C, Cooking_Status_Background) == 0x0002C8, "Member 'UWBP_CrafterInWorld_C::Cooking_Status_Background' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterInWorld_C, Cooking_Status_Item) == 0x0002D0, "Member 'UWBP_CrafterInWorld_C::Cooking_Status_Item' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterInWorld_C, Cooking_Status_Timer) == 0x0002D8, "Member 'UWBP_CrafterInWorld_C::Cooking_Status_Timer' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterInWorld_C, Image_93) == 0x0002E0, "Member 'UWBP_CrafterInWorld_C::Image_93' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterInWorld_C, IngredientsGridPanel) == 0x0002E8, "Member 'UWBP_CrafterInWorld_C::IngredientsGridPanel' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterInWorld_C, InteractionsGridPanel) == 0x0002F0, "Member 'UWBP_CrafterInWorld_C::InteractionsGridPanel' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterInWorld_C, WBP_CrafterInWorld_Item_1) == 0x0002F8, "Member 'UWBP_CrafterInWorld_C::WBP_CrafterInWorld_Item_1' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterInWorld_C, Widget_Actions) == 0x000300, "Member 'UWBP_CrafterInWorld_C::Widget_Actions' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterInWorld_C, Widget_Collect) == 0x000308, "Member 'UWBP_CrafterInWorld_C::Widget_Collect' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterInWorld_C, Widget_ComplexCooking) == 0x000310, "Member 'UWBP_CrafterInWorld_C::Widget_ComplexCooking' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterInWorld_C, Widget_Cooking_Status) == 0x000318, "Member 'UWBP_CrafterInWorld_C::Widget_Cooking_Status' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterInWorld_C, Widget_RecipeCues) == 0x000320, "Member 'UWBP_CrafterInWorld_C::Widget_RecipeCues' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterInWorld_C, WidgetSwitcher_Base) == 0x000328, "Member 'UWBP_CrafterInWorld_C::WidgetSwitcher_Base' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterInWorld_C, OnClosed) == 0x000330, "Member 'UWBP_CrafterInWorld_C::OnClosed' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterInWorld_C, CurrentCrafter) == 0x000340, "Member 'UWBP_CrafterInWorld_C::CurrentCrafter' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterInWorld_C, CurrentCrafterState) == 0x000348, "Member 'UWBP_CrafterInWorld_C::CurrentCrafterState' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterInWorld_C, HandleCrafterChanged) == 0x000350, "Member 'UWBP_CrafterInWorld_C::HandleCrafterChanged' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterInWorld_C, MainComplexCrafter) == 0x000360, "Member 'UWBP_CrafterInWorld_C::MainComplexCrafter' has a wrong offset!");
static_assert(offsetof(UWBP_CrafterInWorld_C, HasCues) == 0x000368, "Member 'UWBP_CrafterInWorld_C::HasCues' has a wrong offset!");

}

