#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NotificationStack

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "S6UICore_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_NotificationStack.WBP_NotificationStack_C
// 0x0038 (0x0558 - 0x0520)
class UWBP_NotificationStack_C final : public US6UI_InputActionHandlingUserWidget
{
public:
	class UVerticalBox*                           VBox_Stack;                                        // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVALUI_NotificationQueue*               NotificationQueue;                                 // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxNotificationsToShowAtOnce;                      // 0x0530(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E42[0x4];                                     // 0x0534(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGuid>                          ShownNotificationIds;                              // 0x0538(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FGuid>                          PendingNotificationIds;                            // 0x0548(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void HandleNoficiationDismissed(class UVALUI_NotificationQueue* Param_NotificationQueue, struct FGuid& AffectedNotificationId, class UWidget* NotificationWidget, const struct FGuid& CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_Array_RemoveItem_ReturnValue);
	void HandleNoficiationPushed(class UVALUI_NotificationQueue* Param_NotificationQueue, struct FGuid& AffectedNotificationId, int32 CallFunc_Array_Add_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue);
	void SetNotificationQueue(class UVALUI_NotificationQueue* Notification_Queue, TDelegate<void(class UVALUI_NotificationQueue* NotificationQueue, struct FGuid& AffectedNotificationId, class UWidget* NotificationWidget)> K2Node_CreateDelegate_OutputDelegate, TDelegate<void(class UVALUI_NotificationQueue* NotificationQueue, struct FGuid& AffectedNotificationId)> K2Node_CreateDelegate_OutputDelegate_1);
	void ShowNotification(struct FGuid& NotificationId, class UWidget* CallFunc_GetNotificationById_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, const struct FMargin& K2Node_MakeStruct_Margin, class UVerticalBoxSlot* CallFunc_AddChildToVerticalBox_ReturnValue);
	void UpdateInputRoutingForNotifications(bool bHasFoundAnInputRoutingNotification, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class UWidget* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, TScriptInterface<class IS6UI_InputActionHandlingWidgetInterface> K2Node_DynamicCast_AsS6UI_Input_Action_Handling_Widget_Interface, bool K2Node_DynamicCast_bSuccess, class US6UI_InputActionHandlingWidgetComponent* CallFunc_GetInputActionHandlingComponent_ReturnValue, bool CallFunc_DoesImplementInterface_ReturnValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_NotificationStack_C">();
	}
	static class UWBP_NotificationStack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NotificationStack_C>();
	}
};
static_assert(alignof(UWBP_NotificationStack_C) == 0x000008, "Wrong alignment on UWBP_NotificationStack_C");
static_assert(sizeof(UWBP_NotificationStack_C) == 0x000558, "Wrong size on UWBP_NotificationStack_C");
static_assert(offsetof(UWBP_NotificationStack_C, VBox_Stack) == 0x000520, "Member 'UWBP_NotificationStack_C::VBox_Stack' has a wrong offset!");
static_assert(offsetof(UWBP_NotificationStack_C, NotificationQueue) == 0x000528, "Member 'UWBP_NotificationStack_C::NotificationQueue' has a wrong offset!");
static_assert(offsetof(UWBP_NotificationStack_C, MaxNotificationsToShowAtOnce) == 0x000530, "Member 'UWBP_NotificationStack_C::MaxNotificationsToShowAtOnce' has a wrong offset!");
static_assert(offsetof(UWBP_NotificationStack_C, ShownNotificationIds) == 0x000538, "Member 'UWBP_NotificationStack_C::ShownNotificationIds' has a wrong offset!");
static_assert(offsetof(UWBP_NotificationStack_C, PendingNotificationIds) == 0x000548, "Member 'UWBP_NotificationStack_C::PendingNotificationIds' has a wrong offset!");

}

