#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VillagerStoreCustomSellItem_Console

#include "Basic.hpp"

#include "Palia_structs.hpp"
#include "SlateCore_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function WBP_VillagerStoreCustomSellItem_Console.WBP_VillagerStoreCustomSellItem_Console_C.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct WBP_VillagerStoreCustomSellItem_Console_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VillagerStoreCustomSellItem_Console_C_BP_OnHandleBackAction) == 0x000001, "Wrong alignment on WBP_VillagerStoreCustomSellItem_Console_C_BP_OnHandleBackAction");
static_assert(sizeof(WBP_VillagerStoreCustomSellItem_Console_C_BP_OnHandleBackAction) == 0x000001, "Wrong size on WBP_VillagerStoreCustomSellItem_Console_C_BP_OnHandleBackAction");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_BP_OnHandleBackAction, ReturnValue) == 0x000000, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_BP_OnHandleBackAction::ReturnValue' has a wrong offset!");

// Function WBP_VillagerStoreCustomSellItem_Console.WBP_VillagerStoreCustomSellItem_Console_C.ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console
// 0x0118 (0x0118 - 0x0000)
struct WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_552A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionValue                      K2Node_EnhancedInputActionEvent_ActionValue;       // 0x0008(0x0020)(NoDestructor)
	float                                         K2Node_EnhancedInputActionEvent_ElapsedTime;       // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_EnhancedInputActionEvent_TriggeredTime;     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     K2Node_EnhancedInputActionEvent_SourceAction;      // 0x0030(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputAction*                           Temp_object_Variable;                              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_InputActionValueToBool_ReturnValue;  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_552B[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Temp_real_Variable;                                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_0;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_real_Variable_1_0;                            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_552C[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FValeriaItem                           K2Node_CustomEvent_Item;                           // 0x0070(0x0060)()
	struct FBagSlotLocation                       K2Node_CustomEvent_Location;                       // 0x00D0(0x0008)(NoDestructor)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVillagerStoreComponent*                CallFunc_GetStore_Store;                           // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetCurrentValue_ReturnValue;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_552D[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVAL_ItemTypeDefinitionAsset*           CallFunc_FindConfig_Loaded_Item_Type;              // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindConfig_Success;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_552E[0x3];                                     // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0104(0x0014)()
};
static_assert(alignof(WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console) == 0x000008, "Wrong alignment on WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console");
static_assert(sizeof(WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console) == 0x000118, "Wrong size on WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console, EntryPoint) == 0x000000, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console, K2Node_EnhancedInputActionEvent_ActionValue) == 0x000008, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console::K2Node_EnhancedInputActionEvent_ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console, K2Node_EnhancedInputActionEvent_ElapsedTime) == 0x000028, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console::K2Node_EnhancedInputActionEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console, K2Node_EnhancedInputActionEvent_TriggeredTime) == 0x00002C, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console::K2Node_EnhancedInputActionEvent_TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console, K2Node_EnhancedInputActionEvent_SourceAction) == 0x000030, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console::K2Node_EnhancedInputActionEvent_SourceAction' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console, Temp_object_Variable) == 0x000038, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console, CallFunc_Conv_InputActionValueToBool_ReturnValue) == 0x000040, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console::CallFunc_Conv_InputActionValueToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console, Temp_real_Variable) == 0x000048, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console::Temp_real_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console, Temp_real_Variable_1) == 0x000050, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console::Temp_real_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console, Temp_real_Variable_0) == 0x000058, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console::Temp_real_Variable_0' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console, Temp_real_Variable_1_0) == 0x000060, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console::Temp_real_Variable_1_0' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console, Temp_bool_Variable) == 0x000068, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console, K2Node_CustomEvent_Item) == 0x000070, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console::K2Node_CustomEvent_Item' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console, K2Node_CustomEvent_Location) == 0x0000D0, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console::K2Node_CustomEvent_Location' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0000D8, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console, CallFunc_GetStore_Store) == 0x0000E0, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console::CallFunc_GetStore_Store' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console, CallFunc_GetCurrentValue_ReturnValue) == 0x0000E8, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console::CallFunc_GetCurrentValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console, CallFunc_Round_ReturnValue) == 0x0000F0, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console, CallFunc_FindConfig_Loaded_Item_Type) == 0x0000F8, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console::CallFunc_FindConfig_Loaded_Item_Type' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console, CallFunc_FindConfig_Success) == 0x000100, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console::CallFunc_FindConfig_Success' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console, K2Node_MakeStruct_SlateColor) == 0x000104, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_ExecuteUbergraph_WBP_VillagerStoreCustomSellItem_Console::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WBP_VillagerStoreCustomSellItem_Console.WBP_VillagerStoreCustomSellItem_Console_C.FindConfig
// 0x0088 (0x0088 - 0x0000)
struct WBP_VillagerStoreCustomSellItem_Console_C_FindConfig final
{
public:
	struct FValeriaItem                           Valeria_Item;                                      // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UVAL_ItemTypeDefinitionAsset*           Loaded_Item_Type;                                  // 0x0060(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Success;                                           // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_552F[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UVAL_ItemTypeDefinitionAsset*           K2Node_DynamicCast_AsItem_Type_Definition;         // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VillagerStoreCustomSellItem_Console_C_FindConfig) == 0x000008, "Wrong alignment on WBP_VillagerStoreCustomSellItem_Console_C_FindConfig");
static_assert(sizeof(WBP_VillagerStoreCustomSellItem_Console_C_FindConfig) == 0x000088, "Wrong size on WBP_VillagerStoreCustomSellItem_Console_C_FindConfig");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_FindConfig, Valeria_Item) == 0x000000, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_FindConfig::Valeria_Item' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_FindConfig, Loaded_Item_Type) == 0x000060, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_FindConfig::Loaded_Item_Type' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_FindConfig, Success) == 0x000068, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_FindConfig::Success' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_FindConfig, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000070, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_FindConfig::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_FindConfig, K2Node_DynamicCast_AsItem_Type_Definition) == 0x000078, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_FindConfig::K2Node_DynamicCast_AsItem_Type_Definition' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_FindConfig, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_FindConfig::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_FindConfig, CallFunc_IsValid_ReturnValue) == 0x000081, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_FindConfig::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_VillagerStoreCustomSellItem_Console.WBP_VillagerStoreCustomSellItem_Console_C.GetStore
// 0x0028 (0x0028 - 0x0000)
struct WBP_VillagerStoreCustomSellItem_Console_C_GetStore final
{
public:
	class UVillagerStoreComponent*                Store;                                             // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EValeriaFuncResult                            CallFunc_GetValeriaCharacter_OutResult;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5530[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AValeriaCharacter*                      CallFunc_GetValeriaCharacter_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5531[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVillagerStoreComponent*                CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VillagerStoreCustomSellItem_Console_C_GetStore) == 0x000008, "Wrong alignment on WBP_VillagerStoreCustomSellItem_Console_C_GetStore");
static_assert(sizeof(WBP_VillagerStoreCustomSellItem_Console_C_GetStore) == 0x000028, "Wrong size on WBP_VillagerStoreCustomSellItem_Console_C_GetStore");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_GetStore, Store) == 0x000000, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_GetStore::Store' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_GetStore, CallFunc_GetValeriaCharacter_OutResult) == 0x000008, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_GetStore::CallFunc_GetValeriaCharacter_OutResult' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_GetStore, CallFunc_GetValeriaCharacter_ReturnValue) == 0x000010, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_GetStore::CallFunc_GetValeriaCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_GetStore, K2Node_SwitchEnum_CmpSuccess) == 0x000018, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_GetStore::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_GetStore, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_GetStore::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function WBP_VillagerStoreCustomSellItem_Console.WBP_VillagerStoreCustomSellItem_Console_C.InitilizeItem
// 0x0068 (0x0068 - 0x0000)
struct WBP_VillagerStoreCustomSellItem_Console_C_InitilizeItem final
{
public:
	struct FValeriaItem                           Item;                                              // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FBagSlotLocation                       Param_Location;                                    // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_VillagerStoreCustomSellItem_Console_C_InitilizeItem) == 0x000008, "Wrong alignment on WBP_VillagerStoreCustomSellItem_Console_C_InitilizeItem");
static_assert(sizeof(WBP_VillagerStoreCustomSellItem_Console_C_InitilizeItem) == 0x000068, "Wrong size on WBP_VillagerStoreCustomSellItem_Console_C_InitilizeItem");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_InitilizeItem, Item) == 0x000000, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_InitilizeItem::Item' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_InitilizeItem, Param_Location) == 0x000060, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_InitilizeItem::Param_Location' has a wrong offset!");

// Function WBP_VillagerStoreCustomSellItem_Console.WBP_VillagerStoreCustomSellItem_Console_C.InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_VillagerStoreCustomSellItem_Console_C_InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0 final
{
public:
	struct FInputActionValue                      ActionValue;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TriggeredTime;                                     // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UInputAction*                     SourceAction;                                      // 0x0028(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VillagerStoreCustomSellItem_Console_C_InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0) == 0x000008, "Wrong alignment on WBP_VillagerStoreCustomSellItem_Console_C_InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0");
static_assert(sizeof(WBP_VillagerStoreCustomSellItem_Console_C_InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0) == 0x000030, "Wrong size on WBP_VillagerStoreCustomSellItem_Console_C_InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0, ActionValue) == 0x000000, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0::ActionValue' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0, ElapsedTime) == 0x000020, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0::ElapsedTime' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0, TriggeredTime) == 0x000024, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0::TriggeredTime' has a wrong offset!");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0, SourceAction) == 0x000028, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_InpActEvt_IA_UI_GenericAccept_K2Node_EnhancedInputActionEvent_0::SourceAction' has a wrong offset!");

// Function WBP_VillagerStoreCustomSellItem_Console.WBP_VillagerStoreCustomSellItem_Console_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_VillagerStoreCustomSellItem_Console_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_VillagerStoreCustomSellItem_Console_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_VillagerStoreCustomSellItem_Console_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_VillagerStoreCustomSellItem_Console_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong size on WBP_VillagerStoreCustomSellItem_Console_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_VillagerStoreCustomSellItem_Console_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_VillagerStoreCustomSellItem_Console_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");

}

